List<Map<String, dynamic>> json_grammars_n1 = [
  {
    "id": 1,
    "grammar": "をもって (2)",
    "means": "으로, 로써",
    "description":
        "근거, 수단, 방법을 표현한다.\n\n일상적인 장소에서는 잘 사용안된다.\n\n[ ~をもってして, ~もってすれば, ~もってしても ] 등 관용적 표현이 있다",
    "connectionWays":
        "명사 + をもって\n명사 + をもってして\n명사 + をもってすれば (순접가정) \n명사 + をもってしても (역접가정)",
    "examples": [
      {
        "answer": "もって",
        "word": "書類の提出をもって, 正式な応募とみなします。",
        "mean": "서류 제출로써 정식적인 응모로 간주합니다"
      },
      {
        "answer": "もって",
        "word": "期末レポートをもって, 成績を決めます。",
        "mean": "기말 레포트으로 성적이 정해집니다"
      },
      {"answer": "もって", "word": "毒をもって毒を制す", "mean": "독으로 독을 제거한다"},
      {
        "answer": "もって",
        "word": "[ 頭が良い ]という言葉があるが, 一体何をもって[ 頭が良い ]とするのだろうか。",
        "mean": "[머리가 좋다] 라는 말이 있는데 대체 무엇으로써 (무엇을 근거로써) [머리가 좋다] 라고 하는것인가"
      },
      {
        "answer": "もって",
        "word": "喧嘩では直接的な暴力をもって相手を屈服させることが手っ取り早い。",
        "mean": "싸움에서 직접적인 폭력으로써 상대를 굴복 시키는 것이 빠른 길이다"
      },
      {
        "answer": "もって",
        "word": "きちんとした話し合いをもって出た結論ならこちらは受け入れざるをえない。",
        "mean": "제대로 된 논의로써 해도 이 난제는 풀 수 없었다"
      },
      {
        "answer": "もって",
        "word": "俺のIQ50000をもってしてもこの難問は解けなかった。",
        "mean": "내 50000 IQ를 수단으로 해도 이 문제는 풀 수 없었다."
      },
      {
        "answer": "もって",
        "word": "あいつのやったことは死をもってしても償えるものではない, 永遠に消えない罪だ。",
        "mean": "그놈이 한 짓은 죽음으로써 (근거로써) 보상받을 수 없는 영원한 죄다."
      },
      {
        "answer": "もって",
        "word": "大震災から何年も経ったが, 何をもってして[ 復興 ]と言うのだろうか。",
        "mean": "대지진이 일어난 지 몇 년이나 지났지만, 무엇을 근거로 [ 부흥 ]이라고 말할 것인가."
      },
      {
        "answer": "もって",
        "word": "血液は現代の科学をもってしても人工的に作ることができない。",
        "mean": "혈액은 현대 과학으로도 (수단으로도) 인공적으로 만들 수 없다."
      },
      {
        "answer": "もって",
        "word": "彼女の圧倒的な美をもってすれば, そこらへんにいる男は全員虜にできる。",
        "mean": "그녀의 압도적인 아름다움 (수단) 으로 하면 그곳에 있는 남자들은 모두 사로잡을 수 있다."
      },
      {
        "answer": "もって",
        "word": "忍耐と反省とをもってすれば, 君は困難を突き破ることができる。",
        "mean": "인내와 반성을 방법으로 하면 자네는 어려움을 극복할 수 있다"
      },
      {
        "answer": "もって",
        "word": "梅雨が明けたって言うけど, 私の力をもってすれば雨を降らせることができるよ。雨女だから。",
        "mean": "장마가 끝났다고 말하는데, 나의 힘으로 하면 비를 내리게 할 수 있어. 나는 우녀니까"
      },
      {
        "answer": "もって",
        "word": "悩みや苦しみはどんな技術をもってしても消すことはできない。",
        "mean": "고민이라 괴로움은 어떤 기술로써도 지우는 것은 불가능하다"
      }
    ]
  },
  {
    "id": 2,
    "grammar": "をものともせずに",
    "means": "~에도 아랑곳하지 않고",
    "description": "어려움이나 장애를 어려워하지 않고 극복한다는 표현",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "をものともせずに",
        "word": "体の障害をものともせずに生き抜いた。",
        "mean": "몸의 장애를 아랑곳하지 않고 끝까지 살아 남았다"
      },
      {
        "answer": "をものともせず",
        "word": "度重なる災害をものともせず, 救助隊は夜通し人命救助に徹した。",
        "mean": "거듭된 재해에도 불구하고 구조대는 밤새 인명구조에 매달렸다."
      },
      {
        "answer": "をものともせずに",
        "word": "緊張やプレッシャーをものともせずに, 最後まで演奏しきった。",
        "mean": "긴장이나 압박에도 아랑곳하지 않고 끝까지 연주했다."
      },
      {
        "answer": "をものともせずに",
        "word": "彼は逆境をものともせずに, とてつもない偉業を成し遂げた。",
        "mean": "그는 역경에도 아랑곳하지 않고 엄청난 위업을 이뤘다."
      },
      {
        "answer": "をものともせずに",
        "word": "雨をものともせずに, 土砂降りの中を駆け抜けていく。",
        "mean": "비를 아랑곳하지 않고 억수같이 쏟아지는 비 속을 달려가다."
      },
      {
        "answer": "をものともせずに",
        "word": "Ａ選手は怪我をものともせずに, 完璧が演技を見せてくれた。",
        "mean": "A 선수는 다치지 않고 완벽이 연기를 보여주었다."
      },
      {
        "answer": "をものともせず",
        "word": "老いをものともせず, 何歳になっても挑戦的でありたい。",
        "mean": "늙음에도 아랑곳하지 않고 몇 살이 되어도 도전적이고 싶다."
      },
      {
        "answer": "をものともせずに",
        "word": "数か月のブランクをものともせずに, 圧巻のパフォーマンスを見せてくれた。",
        "mean": "몇 달의 공백에도 아랑곳하지 않고 압권 퍼포먼스를 보여줬다."
      },
      {
        "answer": "をものともせずに",
        "word": "台風をものともせずに, ジョギングに行く。",
        "mean": "태풍에도 아랑곳하지 않고 조깅하러 가다."
      },
      {
        "answer": "をものともせずに",
        "word": "出る杭は打たれるって言うけど, それをものともせずに, 突き進んでいきたい。",
        "mean": "나오는 말뚝은 맞는다고 하지만, 그것을 아랑곳하지 않고 돌진하고 싶다."
      },
      {
        "answer": "をものともせず",
        "word": "子どもたちが真っ赤な日焼けをものともせず, 水遊びしている。",
        "mean": "아이들이 시뻘건 햇볕에 아랑곳하지 않고 물놀이를 하고 있다."
      },
      {
        "answer": "をものともせず",
        "word": "人が危険をものともせず, 自分の人生を実験台にすることをいとわないとき, その人は変化し成長するのである。",
        "mean":
            "사람이 위험에 아랑곳하지 않고 자신의 삶을 실험대로 삼는 것을 마다하지 않을 때, 그 사람은 변화하고 성장하는 것이다."
      },
      {
        "answer": "をものともせずに",
        "word": "蝉だけは暑さをものともせずに, 元気いっぱいの大合唱だ。",
        "mean": "매미만큼은 더위에도 아랑곳하지 않고 활기찬 대합창이다."
      },
      {
        "answer": "をものともせずに",
        "word": "世の中には自分に降りかかる不幸をものともせずに, 明るく生きてる人がいる。",
        "mean": "세상에는 자신에게 닥칠 불행을 아랑곳하지 않고 밝게 사는 사람이 있다."
      }
    ]
  },
  {
    "id": 3,
    "grammar": "を余儀なくされる",
    "means": "어쩔 수 없이~하게 되다\n~을 피할 수 없다",
    "description": "상황이 변해서 싫어도 할 수 밖에 없다는 의미를 표현",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "余儀なくされた",
        "word": "路拡張工事のため, 住民は引っ越しを余儀なくされた。",
        "mean": "도로 확장 공사 때문에 어쩔 수 없이 주민은 이사 하게 되었다"
      },
      {
        "answer": "を余儀なくされる",
        "word": "不景気が続き, 多くの人々は職場を離れることを余儀なくされている。",
        "mean": "불경기가 지속되어 많은 어쩔 수 없이 많은 사람들은 직장을 떠나야 하게 되었다"
      },
      {
        "answer": "余儀なくされた",
        "word": "発政策の再検討を余儀なくされた。",
        "mean": "발 정책의 재검토를 피할 수 없게 되었다"
      },
      {
        "answer": "余儀なくされた",
        "word": "大雨によって街は冠水を余儀なくされた。",
        "mean": "폭우로 인해 거리는 침수하게 되었다"
      },
      {
        "answer": "余儀なくされた",
        "word": "大きなミスをしたため, 彼は辞職を余儀なくされた。",
        "mean": "큰 실수를 해서 그는 어쩔 수 없이 사직을 하게 되었다"
      },
      {
        "answer": "を余儀なくされる",
        "word": "核戦争が起きれば, 現代文明は大幅な後退を余儀なくされるだろう。",
        "mean": "핵전쟁이 일어나면 현대문명은 대폭적인 후퇴를 피할 수 없게 될 것이다"
      },
      {
        "answer": "余儀なくされた",
        "word": "巨人の襲撃により, 人類は活動領域の後退を余儀なくされた。",
        "mean": "거인의 공격으로 인해 인류는 활동 영역의 후퇴를 피할 수 없게 되었다"
      },
      {
        "answer": "を余儀なくされる",
        "word":
            "新型コロナウイルスの影響でこのままライブハウスの営業自粛が続くと, バンドやミュージシャンの半分以上が廃業を余儀なくされるだろう。",
        "mean":
            "신형 코로나 바이러스의 영향으로 이 대로 라이브 하우스의 영업 자제가 이어지면 아르바이트와 뮤지선의 절반 이상이 폐업를 피할 수 없게 되겠지"
      },
      {
        "answer": "余儀なくされた",
        "word": "大規模な火災により避難を余儀なくされた。",
        "mean": "대규모적인 화재로 인해 어쩔 수 없이 피난하게 되었다"
      },
      {
        "answer": "を余儀なくされる",
        "word": "高齢化が進めば国民が負担する財政負担は膨らみ続け, 経済は停滞を余儀なくされる。",
        "mean": "고령화가 진행되면 국민이 부담하는 재정부담은 계속 커져, 경제는 정체를 피할 수 없게 된다"
      }
    ]
  },
  {
    "id": 4,
    "grammar": "をよそに",
    "means": "~에도 아랑곳하지 않고\n~을 개의치 않고\n~을 무시하고",
    "description": "타인의 걱정, 기대, 판단, 평가 또는 주변의 상황을 무시하거나 신경쓰지 않는 것을 표현하는 표현",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "をよそに",
        "word": "雨の予報をよそに傘も持たず出かけていった。",
        "mean": "비 예보를 무시하고 우산도 없이 외출 나갔다."
      },
      {
        "answer": "をよそに",
        "word": "自分の失敗をよそに他人の批判ばかりしている。",
        "mean": "자신의 실패를 개의치 않고 상대 비판만 하고 있다"
      },
      {
        "answer": "をよそに",
        "word": "親の心配をよそに四六時中部屋にこもっている。",
        "mean": "부모님의 걱정을 개의치 않고 언제나 방안에 틀어박혀 있다"
      },
      {
        "answer": "をよそに",
        "word": "冷たい周囲の視線をよそにイチャイチャしている。",
        "mean": "차가운 분위기의 시선을 무시하고 농땡이 치고 있다"
      },
      {
        "answer": "をよそに",
        "word": "夜勤を終えた私は通勤する人をよそに毎日帰宅する。",
        "mean": "야근을 끝낸 나는 출근하는 사람을 개의치하고매일 귀가 한다"
      },
      {
        "answer": "をよそに",
        "word": "親の心配をよそに, 朝まで帰らない。",
        "mean": "부모님의 걱정을 아랑곳하지 않고, 아침까지 귀가하지 않는다."
      },
      {
        "answer": "をよそに",
        "word": "コロナをよそにオリンピックが盛り上がっています。",
        "mean": "코로나를 아랑곳하지 않고 올림픽이 달아오르고 있습니다."
      },
      {
        "answer": "をよそに",
        "word": "恥ずかしがる私をよそに, 彼はどんどん攻めてくる。",
        "mean": "부끄러워하는 나를 개의치 않고 그는 점점 공격해왔다"
      },
      {
        "answer": "をよそに",
        "word": "周囲の反対をよそにやりたい放題する。",
        "mean": "주위의 반대를 아랑곳하지 않고 싶은 대로 하다."
      }
    ]
  },
  {
    "id": 5,
    "grammar": "んがために",
    "means": "~하기 위해,~하고 싶어서",
    "description": "회화체로 사용안함. する는 せんがため 로 활용한다.",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "持たんがため",
        "word": "自分の店を持たんがため, 必死で働いている。",
        "mean": "자신의 가게를 갖기 위해서 필사적으로 일하고 있다."
      },
      {
        "answer": "勝たんがため",
        "word": "試合で勝たんがため, 毎日の練習を怠らない。",
        "mean": "시합에서 이기기 위해서 매일 연습을 게을리 하지 않는다"
      },
      {
        "answer": "奪取せんがために",
        "word": "戦争とは, 権力を奪取せんがために起こされたものである。",
        "mean": "전쟁이라는 것은 권력을 탈취하기 위해 일어나는 것이다."
      },
      {
        "answer": "叶えんがため",
        "word": "これもまた夢を叶えんがためのことだ。",
        "mean": "이 또한 꿈을 이루기 위한 것이다"
      },
      {
        "answer": "維持せんがため",
        "word": "政府や経済界には, いまだに現状を維持せんがための政策や取り組みが目立つ。",
        "mean": "정부나 경제계는 아직까지도 현상을 유지하기 위한 정책이나 대처가 눈에 띈다"
      },
      {"answer": "生きんがために", "word": "生きんがために食べる。", "mean": "살기 위해서 먹는다"},
      {
        "answer": "達成せんがために",
        "word": "目標を達成せんがために日々努力してきた。",
        "mean": "목표를 달성하기 위해서 매일 노력해 왔다."
      },
      {
        "answer": "なさんがために",
        "word": "私はこの世界に, 何事かをなさんがために生まれてきたのだ。",
        "mean": "나는 이 세계에 무엇인가를 이루기 위해서 태어난 것이다"
      },
      {
        "answer": "得んがため",
        "word": "僅かな幸福を得んがため, いくたの苦悩に身を震わす。",
        "mean": "근소한 행복을 얻기 위해, 얼마간의 고뇌에 몸을 떨다."
      }
    ]
  },
  {
    "id": 6,
    "grammar": "んばかりに / んばかりの / んばかりだ",
    "means": "곧 ~ 할 듯이\n곳 ~ 할 듯한\n곳 ~ 할 듯하다",
    "description": "동작의 정도를 표현하는 표현\n지금이라도~할 듯이 이라는 의미\n\nする는 せんばかり로 활용한다.",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "土下座せんばかりに",
        "word": "土下座せんばかりに必死に謝ったが許してくれなかった。",
        "mean": "땅에 엎드려 조아릴 듯이 필사적으로 사과했지만 용서해 주지 않았다"
      },
      {
        "answer": "万引きせんばかりに",
        "word": "今すぐ万引きせんばかりに怪しい動きをしている。",
        "mean": "당장 도둑질할 듯이 수상쩍은 움직임을 하고 있다."
      },
      {
        "answer": "溢れんばかりの",
        "word": "祖母は溢れんばかりの愛情を私に注いでくれた。",
        "mean": "할머니는 넘처 흐를듯한 애정을 나에게 쏫아 주었다"
      },
      {
        "answer": "吐かんばかりに",
        "word": "彼は今にも吐かんばかりに酩酊している。",
        "mean": "그는 지금이라도 토할 듯이 매우 취해 있다"
      },
      {
        "answer": "割れんばかりの",
        "word": "頭が割れんばかりの頭痛に悩んでいる。",
        "mean": "머리가 깨질 듯한 두통에 시달리고 있다"
      },
      {
        "answer": "割れんばかりの",
        "word": "スピーチが終わると, 割れんばかりの拍手が沸き起こった。",
        "mean": "연설이 끝나자 깨질듯한 박수가 터져 나왔다."
      },
      {
        "answer": "言わんばかりの",
        "word": "お前がやったんだろと言わんばかりの視線が降り注ぐ。",
        "mean": "네가 했구나 하는 듯한 시선이 쏟아진다."
      },
      {
        "answer": "泣かんばかりの",
        "word": "今にも泣かんばかりの表情でこっちを見ている。",
        "mean": "당장이라도 울거 같은 표정으로 이쪽을 보고 있다."
      },
      {
        "answer": "溢れんばかりの",
        "word": "彼女の溢れんばかりの笑顔に癒された。",
        "mean": "그녀의 넘치는 미소에 힐링이 되었다"
      },
      {
        "answer": "こすらんばかりの",
        "word": "飛行機が地面スレスレ, 機体を地面にこすらんばかりの低空飛行で飛んでいる。",
        "mean": "비행기가 지면 슬레스레, 기체를 땅바닥에 늘어놓을 정도의 저공비행으로 날고 있다"
      }
    ]
  },
  {
    "id": 8,
    "grammar": "とばかりに",
    "means": "마치 ~ 라는 듯이",
    "description":
        "실제로는 그런 말을 하지 않았지만 마치 말한 것 같은 행동이나 표정을 지을 때 사용하는 표현\n\n관용표현으로 ここぞとばかりに [마치 지금이라는 듯이] 가 있다.",
    "connectionWays": "동사 보통형, い형용사 보통형, な형용사 보통형, 명사 보통형 등",
    "examples": [
      {
        "answer": "待ってましたとばかりに",
        "word": "彼の登場で, 待ってましたとばかりに大きな拍手が起こった。",
        "mean": "그의 등장으로 기다렸다는 듯이 큰 박수가 터졌다."
      },
      {
        "answer": "ここぞとばかりに",
        "word": "あの人に恋人が居ないことを知り, ここぞとばかりに告白した。",
        "mean": "그 사람에게 애인이 없다는 것을 알고, 마치 지금이라는 듯이 고백했다."
      },
      {
        "answer": "悪いとばかりに",
        "word": "お前が悪いとばかりに指を指され怒られた。",
        "mean": "네가 나쁘다는 듯이 손가락질을 받고 혼났다."
      },
      {
        "answer": "ここだとばかりに",
        "word": "ここだとばかりにスマッシュを放った。",
        "mean": "마치 지금이라는 듯이 스매시를 날렸다."
      },
      {
        "answer": "とばかりに",
        "word": "今がチャンスだとばかりに攻めかかる。",
        "mean": "지금이 기회라는 듯이 덤벼들다."
      },
      {
        "answer": "とばかりの",
        "word": "もう話したくもないとばかりの形相で立ち去っていった。",
        "mean": "더 이상 말하고 싶지도 않다는 듯한 형상으로 떠나갔다."
      },
      {
        "answer": "とばかりに",
        "word": "カッコいいだろうとばかりに腕時計を自慢してくる。",
        "mean": "멋있다는 듯이 손목시계를 자랑해 오다."
      }
    ]
  },
  {
    "id": 9,
    "grammar": "~ともなく / ともなしに (특정 불가의 출처)",
    "means": "~모르게",
    "description":
        "의문사에 대해서 동작이나 장소, 시간 등을 특정할 수 없음을 나타낸다\n\n[어디선가 모르게, 누구에게나, 어느 쪽이든 상관없이, 어디론가] 라는 해석.",
    "connectionWays": "의문사 ( + 조사) + ともなく\n의문사 ( + 조사) + ともなしに",
    "examples": [
      {
        "answer": "ともなく",
        "word": "どこからともなく銃声が聞こえてくる。",
        "mean": "어디선가 모르게 총성이 들려온다."
      },
      {
        "answer": "ともなく",
        "word": "二人はどちらからともなく手を繫ぎ, 歩き出した。",
        "mean": "두 사람은 어디선가 모르게 손을 잡고 걷기 시작했다."
      },
      {
        "answer": "ともなく",
        "word": "いつもガムを噛んでいることから, 彼を[ ガム男 ]と誰ともなく呼ぶようになった。",
        "mean": "항상 껌을 씹다 보니 나도 모르게 그를 껌남이라고 남몰래 부르게 됐다."
      },
      {
        "answer": "ともなく",
        "word": "窓開けてるとどこからともなく良い匂いしてきた。",
        "mean": "창문 여니 어딘지 모르게 좋은 낸다새가 난다."
      },
      {
        "answer": "ともなく",
        "word": "誰にともなく言いたい。この気持ちを誰かに知ってほしい。",
        "mean": "누구에게나 말하고 싶다.이 마음을 누군가가 알았으면 좋겠어."
      },
      {
        "answer": "ともなく",
        "word": "陽も落ちて辺りが暗くなり始めた頃から, どこからともなく人々が集まってきました。",
        "mean": "햇빛도 떨어지고 주위가 어두워지기 시작했을 무렵부터 어디선가 모르게 사람들이 모여들었습니다."
      },
      {
        "answer": "ともなく",
        "word": "どこからともなく花火の音が聞こえてきて夏を感じた。",
        "mean": "어디선가 모르게 불꽃소리가 들려와 여름을 느꼈다."
      },
      {
        "answer": "ともなく",
        "word": "不思議な光がどこからともなく現れ, どこへともなく消えていった。",
        "mean": "이상한 빛이 어디선가 모르게 나타나더니 어디론가 사라져 갔다."
      },
      {
        "answer": "ともなく",
        "word": "いい感じの雰囲気になってどちらともなくキスをした。",
        "mean": "분위기가 좋아져서 둘 다 (어느 쪽이든 상관없이) 키스를 했다."
      },
      {
        "answer": "ともなく",
        "word": "どこからともなく臭いにおいがする。",
        "mean": "어딘지 모르게 구린내가 난다."
      },
      {
        "answer": "ともなしに",
        "word": "文句を誰ともなしに言ったところで世の中が変わる訳でもない。",
        "mean": "불평을 누구에게나 한다고 세상이 바뀌는 것도 아니다."
      },
      {
        "answer": "ともなしに",
        "word": "何処からともなしにお香の香りが漂ってきた。",
        "mean": "어딘지 모르게 향내가 풍겨왔다."
      }
    ]
  },
  {
    "id": 10,
    "grammar": "ともなると / ともなれば",
    "means": "~쯤 되면, ~라도 되면",
    "description": "~라는 특별한 상황이나 입장이 되면",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ともなると",
        "word": "この年齢ともなると体が思うように動いてくれなくなる。",
        "mean": "그 나이 쯤 되면 몸에 마음대로 움직이지 않게 된다."
      },
      {
        "answer": "ともなると",
        "word": "ホラーゲームも２週目ともなると慣れてあまり怖くなくなる。",
        "mean": "공포 게임을 2주 쯤 하게 되면 익숙해져서 그다지 무섭지 않게 된다."
      },
      {
        "answer": "ともなると",
        "word": "結婚ともなると二人だけの問題ではなくなる。",
        "mean": "결혼 하게 되면 두명만의 문제가 않이게 된다"
      },
      {
        "answer": "ともなると",
        "word": "木曜日ともなると疲れも溜まってくるものだ。",
        "mean": "목요일 쯤 되면 피로도 쌓이게 된다"
      },
      {
        "answer": "ともなると",
        "word": "決勝戦ともなると, その注目度も高い。",
        "mean": "결승전이라도 되면 , 그 주목도도 높다"
      },
      {
        "answer": "ともなれば",
        "word": "繁忙期ともなれば, こうもうすぐは帰れない。",
        "mean": "성수기 쯤 되면 이렇게 금방 돌아갈 수 없다"
      },
      {
        "answer": "ともなれば",
        "word": "小学生ともなれば, 自転車くらいは乗れないと。",
        "mean": "초등학생 쯤 되면 자전거 정도는 탈 수 있어야한다."
      },
      {
        "answer": "ともなれば",
        "word": "12月ともなれば冷え込んでくる。",
        "mean": "12월 쯤 되면 몹시 추워진다"
      },
      {
        "answer": "ともなると",
        "word": "人の顔と名前を覚えるのが苦手。海外の人ともなると特に。",
        "mean": "사람의 얼굴과 이름을 잘 기억 못한다. 외국인이라도 되면 특히"
      },
      {
        "answer": "ともなると",
        "word": "ダイエットしてもさすがに３日目ともなると食欲がすごい。",
        "mean": "다이어트하고 역시 3일 째 쯤 되면 식욕이 굉장하다"
      },
      {"answer": "ともなると", "word": "金曜日ともなると体力限界だ。", "mean": "금요일 쯤이 되면 체력 한계다"},
      {
        "answer": "ともなると",
        "word": "５連休の後半ともなるとやることなくてさすがに暇だ。",
        "mean": "5일 연휴 후반이면 할 일이 없어서 역시 한가해요."
      },
      {
        "answer": "ともなれば",
        "word": "異性との食事ともなれば緊張で吐き気がしてくる。",
        "mean": "이성과의 식사라도 되면 긴장해서 구역질이 나온다"
      },
      {
        "answer": "ともなれば",
        "word": "お姫様ともなれば, パーティーの主役になるのは権利じゃなくて義務。",
        "mean": "공중님 쯤 되면 파티 주인이 되는 것은 권리가 아니라 의무"
      },
      {
        "answer": "ともなれば",
        "word": "社会人ともなれば異性との関わりはどうしても避けられなくなる。",
        "mean": "회사원 쯤 되면 이성과의 관계가 아무리 해도 피해지지 않게 된다"
      },
      {
        "answer": "ともなれば",
        "word": "夏休みで土日ともなれば飲食店は混雑するに決まっている。",
        "mean": "여름 방학에 주말 쯤 되면 음식점은 혼잡할게 뻔 하다"
      }
    ]
  },
  {
    "id": 11,
    "grammar": "ないではおかない",
    "means": "(1) 반드시~하고야 말겠다 (강한의지)\n(2) ~하게 된다 (자연발생)",
    "description":
        "(1) 화자의 강한 의지가 표현된다\n\n(2-1) 본인의 의지와 관계없이, 자연적으로 그 감정이나 행동이 일어나는 것을 표현\n\n(2-2) 감정, 심리를 표현하는 동사에 접속할 때는 사역형이 되는 경우가 믾다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "引き付けずにはおかない",
        "word": "私たちの劇団には人を引き付けずにはおかない魅力的な演技ができる俳優がたくさんいます。",
        "mean": "우리 극단에는 사람을 끌어들이는 매력적인 연기가 가능한 배우가 많이 있습니다."
      },
      {
        "answer": "感動させずにはおかない",
        "word": "実話に基づいた親子の愛を描くこの物語は人を感動させずにはおかないだろう。",
        "mean": "실화를 바탕으로 부모와 자식의 사랑을 그리는 이 이야기는 사람을 감동시키지 않을 수 없을 것입니다."
      },
      {
        "answer": "考えさせずにはおかない",
        "word": "近年の異常気象は, 環境問題の深刻さについて考えさせずにはおかない。",
        "mean": "근년 이상현상은 환경문제의 심각성에 대해서 생각하게 하지 않을 수 없다."
      },
      {
        "answer": "魅了せずにはおかない",
        "word": "その見た目から漂う高級感と精巧に作られたフォルム。腕時計好きを魅了せずにはおかない。",
        "mean": "그 외형에서 풍기는 고급감과 정교히 만들어진 형태. 손목시계를 좋아하는 사람을 매료시키지 않을 수 없다"
      },
      {
        "answer": "与えずにはおかない",
        "word": "スポーツは見る者に驚嘆や感銘を与えずにはおかない。",
        "mean": "스포츠는 보는 사람에게 경탄이나 감명을 받게하지 않을 수 없다"
      },
      {
        "answer": "誘わずにはおかない",
        "word": "戦ったもの同士が健闘を讃え, 抱き合う姿は人の涙を誘わずにはおかないものだ。",
        "mean": "싸운 사람들끼리 건투를 찬양하고 서로 껴안는 모습은 남의 눈물을 자아내지 않을 수 없는 법입니다."
      },
      {
        "answer": "感動させずにはおかない",
        "word": "そのピアニズムは聴く者を感動させずにはおかない。",
        "mean": "그 피아니스트는 듣는 사람을 감동시키지 않을 수 없다."
      },
      {
        "answer": "意識させずにはおかない",
        "word": "癌とは, 誰もに死を意識させずにはおかない病だ。",
        "mean": "암은 누구나 죽음을 의식하는 병이다."
      },
      {
        "answer": "及ぼさずにはおかないだろう",
        "word": "石油価格の高騰は今後の国民生活に影響を及ぼさずにはおかないだろう。",
        "mean": "유가 급등은 향후 민생에 영향을 미치지 않을 수 없을 것이다."
      },
      {
        "answer": "攻めずにはおかない",
        "word": "うちのチームは守備に弱点があるので, 相手はそこを攻めずにはおかないはずだ。",
        "mean": "우리 팀은 수비에 약점이 있기 때문에 상대는 거기를 공격하지 않을 수 없을 것이다."
      },
      {
        "answer": "謝らせないではおかない",
        "word": "こんなに酷いことをされたのだから, 絶対に謝らせないではおかない。",
        "mean": "이렇게 심한 일을 당했으니 절대 사과하게 하지 않을 수 없다."
      },
      {
        "answer": "やり返せずにはおかない",
        "word": "やられたらやり返せずにはおかない。",
        "mean": "당하면 되받아치지 않을 수 없다."
      },
      {
        "answer": "罰せずにはおかない",
        "word": "不正は罰せずにはおかない。",
        "mean": "부정은 벌하지 않을 수 없다."
      },
      {
        "answer": "仕返しせずにはおかない",
        "word": "私はあいつらに仕返しせずにはおかない。",
        "mean": "나는 그들에게 보복하지 않을 수 없어."
      },
      {
        "answer": "見通さずにはおかない",
        "word": "彼女は人の笑顔の裏にあるものを見通さずにはおかない鋭い観察力を持っている。",
        "mean": "그녀는 남의 웃는 얼굴 뒤에 있는 것을 보는 날카로운 관찰력을 가지고 있다."
      },
      {
        "answer": "手に入れずにはおかない",
        "word": "限定品だから何としても手に入れずにはおかない。",
        "mean": "한정품이라 어떻게든 구하지 않을 수 없다."
      }
    ]
  },
  {
    "id": 12,
    "grammar": "~を限りに / ~限りで",
    "means": "~을 끝으로\n~을 마지막으로",
    "description":
        "시간을 나타내는 명사에 접속하여 기한을 나타낸다.\n\n특히 [~を限りに] 는 [今回, 今日, 今月, 今年, 本日] 등의 시간명사에 붙는다.\n\n그 기한이 지나면 뭔가를 멈출 것 같은 결의를 나타내거나 무언가가 끝나고 아쉬워할 때 사용.",
    "connectionWays": "시간 명사에 직접 접속",
    "examples": [
      {
        "answer": "限りに",
        "word": "ダイエットのため, 今日を限りに甘いものは食べません。",
        "mean": "다이어트 때문에 오늘을 끝으로 단 것은 먹지 않습니다."
      },
      {"answer": "限りに", "word": "この試合を限りに引退します。", "mean": "이 경기를 끝으로 은퇴합니다."},
      {
        "answer": "限りに",
        "word": "二人はその日を限りに, 二度と会わなかった。",
        "mean": "두 사람은 그날을 끝으로 다시는 만나지 않았다."
      },
      {
        "answer": "限りに",
        "word": "着られなくなった服を今日を限りに捨てることにした。",
        "mean": "입을 수 없게 된 옷을 오늘을 끝으로 버리기로 했다."
      },
      {
        "answer": "限りに",
        "word": "太ってきたので今日を限りに暴飲暴食止めます。",
        "mean": "살이 쪄서 오늘을 끝으로 폭음 폭식을 멈출게요."
      },
      {
        "answer": "限りに",
        "word": "今日を限りにお菓子を食べるの控えます。",
        "mean": "오늘을 끝으로 과자 먹는 것을 삼가겠습니다."
      },
      {
        "answer": "限り",
        "word": "この要綱は, 令和5年3月31日を限り, にその効力を失う。",
        "mean": "이 요강은 2020년3월31일을 끝으로 그 효력을 잃는다."
      },
      {
        "answer": "限りに",
        "word": "利用者が減ったことで最後まで残った鉄道も今年９月３０日を限りに運行を取り止めた。",
        "mean": "이용자가 줄면서 마지막까지 남은 철도도 올해 9월 30일을 끝으로 운행을 중단했다."
      },
      {
        "answer": "限りで",
        "word": "今の仕事は今月末限りで, 辞める予定だ。",
        "mean": "지금 하는 일은 이달 말부로 그만둘 예정이다."
      },
      {
        "answer": "限りで",
        "word": "当店は今月３１日限りで, 閉店致します。",
        "mean": "저희 가게는 이번 달 31일부로 폐점합니다."
      },
      {
        "answer": "限りで",
        "word": "仕事の人間関係でついに限界が来て, 本日限りで退職をしました。",
        "mean": "일의 인간관계에서 드디어 한계가 와서 오늘부로 퇴직을 했습니다."
      },
      {
        "answer": "限り",
        "word": "４年に一度の１日限り, たった１０秒の試合のために練習をしてきた選手たちに尊敬の念を覚えます。",
        "mean": "4년에 한 번뿐인 하루에 단 10초 경기를 위해 훈련을 해온 선수들에게 존경을 느낍니다."
      },
      {
        "answer": "限りで",
        "word": "2000年3月10日, 東海道 / 山陽新幹線の食堂車がこの日限りで廃止された。",
        "mean": "2000년 3월 10일, 동해도·산요 신칸센의 식당차가 이날부로 폐지되었다."
      },
      {
        "answer": "限りで",
        "word": "もし[ もうこの辺でいい ]という気持ちが生まれたら, 俺はその日限りでサッカーをやめる。",
        "mean": "만약 '이쯤이면 됐다'는 마음이 생긴다면 나는 그날로 축구를 그만둘 것이다."
      },
      {
        "answer": "限りで",
        "word": "せっかく出会えた人達のことを大切にしたい。その日限りで終わりにはしたくない。",
        "mean": "모처럼 만난 사람들을 소중히 여기고 싶다.그 날짜로 끝내고 싶지 않아."
      },
      {
        "answer": "限りで",
        "word": "から揚げ弁当が８日, ９日限りで５０円引きです。",
        "mean": "가라아게 도시락이 8일, 9일 한정으로 50엔 할인됩니다."
      }
    ]
  },
  {
    "id": 13,
    "grammar": "くらいなら",
    "means": "~할 거라면",
    "description": "[~ 하느니 차라리 ~ 하는 편이 낫겠다] 라는 표현\n\nむしろ가 붙어 문장을 더 강조할 때가 많음",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "ぐらいなら",
        "word": "嫌々やるぐらいなら初めからやらないほうがましだ。",
        "mean": "마지못해 할 바에야 아예 안 하는 게 낫다."
      },
      {
        "answer": "くらいなら",
        "word": "遊びに散財するくらいなら貯金したい。",
        "mean": "노는 것에 돈을 쓸 바에야 저금하고 싶다."
      },
      {
        "answer": "くらいなら",
        "word": "この品質で３万円くらいならむしろ安いほうだ。",
        "mean": "이 품질로 3만엔 정도면 오히려 싼 편이다."
      },
      {
        "answer": "くらいなら",
        "word": "ビールは１杯くらいならむしろ健康に良いと言われている。",
        "mean": "맥주는 한 잔 정도면 오히려 건강에 좋다고 한다."
      },
      {
        "answer": "くらいなら",
        "word": "東京は都会過ぎて嫌い。仙台くらいならむしろちょうどいい。",
        "mean": "도쿄는 도시가 너무 많아서 싫어.센다이 정도면 오히려 딱 좋아."
      },
      {
        "answer": "くらいなら",
        "word": "数万円かけて修理するくらいなら, 新しいパソコン買った方がいい。",
        "mean": "몇 만엔 들여 수리할 바에야 새 컴퓨터를 사는 것이 좋다."
      },
      {
        "answer": "くらいなら",
        "word": "心から信じられない友達を多く持つくらいなら, むしろ居ないほうがいい。",
        "mean": "진심으로 믿을 수 없는 친구를 많이 가질 바에야 차라리 없는 게 낫다."
      }
    ]
  },
  {
    "id": 14,
    "grammar": "ことだし",
    "means": "~하고(이고)\n~하니까(이기도 하고)",
    "description": "이유를 나타내는 표현\n\n앞에는 근거가 되는 이유나 원인이 오며 뒤에는 판단이나 결정이 온다.",
    "connectionWays": "명사 접속 형태",
    "examples": [
      {"answer": "ことだし", "word": "熱もあることだし寝ます。", "mean": "열도 있고 잘거에요."},
      {
        "answer": "ことだし",
        "word": "テストも終わったことだし, 明日から思いっきり好きなことする。",
        "mean": "시험도 끝났으니 내일부터 맘껏 좋아하는 거 할 거야."
      },
      {
        "answer": "ことだし",
        "word": "天気も良いことだし, 散歩でも一緒にどう。",
        "mean": "날씨도 좋은데 산책이나 같이 어때?"
      },
      {
        "answer": "ことだし",
        "word": "採譜も全部終わったことだし練習に入る。",
        "mean": "채보도 다 끝난 거고 연습 들어가."
      },
      {
        "answer": "ことだし",
        "word": "１か月頑張ったことだし, 給料入ったら高い美容液を自分へのご褒美に買いたい。",
        "mean": "한 달 열심히 했고 월급이 들어오면 비싼 에센스를 나에게 주는 보상으로 사고 싶다."
      },
      {
        "answer": "ことだし",
        "word": "目も覚めてしまったことだし, 起きて仕事行く準備でもしよう。",
        "mean": "잠도 깨버렸으니 일어나서 일하러 갈 준비나 하자."
      },
      {
        "answer": "ことだし",
        "word": "朝ご飯も食べたことだしどっか行こうかな。",
        "mean": "아침도 먹은건데 어디 갈까?"
      },
      {
        "answer": "ことだし",
        "word": "目撃者も多数いることだし, 犯人が捕まるのも時間の問題だろう。",
        "mean": "목격자도 다수 있는 일이고 범인이 잡히는 것도 시간문제일 것이다."
      }
    ]
  },
  {
    "id": 16,
    "grammar": "ずじまい",
    "means": "~하지 않고 말다",
    "description":
        "어떤 일을 끝내지 못 한 채로 상황이 종료되었다.\n\n[원래 ~를 하고 싶었는데 어떠한 이유로 실현 되지 않았다.] 라는 의미 이기 때문에 화자의 유감이나, 후회의 뉘양스로 사용\n\nする는 せずじまい 로 사용된다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "せずじまいだった",
        "word": "しようしようと思いつつも, 今週も結局運動せずじまいだった。",
        "mean": "하려고 하려고 생각하면서도 이번 주도 결국 운동을 안 하고 말았지."
      },
      {
        "answer": "ずじまいで",
        "word": "家賃も水道代も払えずじまいで, ついに電気も止められてしまった。",
        "mean": "집세도 수도세도 내지 못하고 결국 전기도 끊기고 말았다."
      },
      {
        "answer": "ずじまい",
        "word": "ずっと待ってたのに, 会えずじまい。",
        "mean": "계속 기다렸는데 못 만나겠네."
      },
      {
        "answer": "ずじまい",
        "word": "メイクに挑戦しようと思ってメイク道具は買ったものの, 結局今の今まで手をつけずじまい。",
        "mean": "메이크업에 도전하려고 메이크업 도구는 샀지만 결국 지금까지 손을 대지 않고 있다."
      },
      {
        "answer": "ずじまいだった",
        "word": "時間がなくて金閣寺には行けずじまいだった。",
        "mean": "시간이 없어서 금각사에는 갈 수가 없었다."
      },
      {
        "answer": "ずじまいになってしまった",
        "word": "今日郵便局に行こうと思ったけど, 自分が思ってた以上に忙しくて今日も行けずじまいになってしまった。",
        "mean": "오늘 우체국 가려고 했는데 내가 생각했던 것보다 더 바빠서 오늘도 못가게 되었어."
      },
      {
        "answer": "できずじまいで",
        "word": "お見かけはしたのですが, 結局挨拶できずじまいですみませんでした。",
        "mean": "보긴 했는데 결국 인사를 못드려서 죄송해요."
      }
    ]
  },
  {
    "id": 17,
    "grammar": "(た)手前",
    "means": "~한 체면상\n~해 놓았으니",
    "description":
        "手前 는 체면이란 뜻이 있어 화자의 본의 아닌 감정을 나타낸다\n\n앞에는 이유를 뒤에는 입장이나 사회적 평가를 고려한 후에 사실은 하고 싶지 않지만 해야하는 의미를 나타낸다.\n\n하지 않으면 평가가 떨어지거나 면목이 서지 않기 때문이다.\n\n따라 뒤에는 [するしかない, なければならない, すべき] 등 동작을 제한하는 의미가 온다.\nたてまえ 라고 발음한다.",
    "connectionWays": "동사 과거형,\n명사+の+手前",
    "examples": [
      {
        "answer": "した手前",
        "word": "約束した手前, 寝る時間を割いてでもやるべきだと思う。",
        "mean": "약속 해 놓았으니 잘 시간을 내서라도 해야 할 것 같아."
      },
      {
        "answer": "もらっている手前",
        "word": "毎度助けてもらっている手前, 何かお礼をしなければ。",
        "mean": "매번 도움을 받은 체면상 뭔가 감사를 드려야죠."
      },
      {
        "answer": "誘った手前",
        "word": "自分から誘った手前, 今さらやっぱり止めようとは言いにくい。",
        "mean": "자신이 권유해 놓았으니, 이제 와서 역시 그만두자고 말하기 어렵다."
      },
      {
        "answer": "言い出した手前",
        "word": "[ 別れよう ]と私が言い出した手前, やっぱりやり直そうとは言えない。",
        "mean": "헤어지자고 내가 말을 꺼내었으니, 역시 다시 시작하자고는 할 수 없다."
      }
    ]
  },
  {
    "id": 18,
    "grammar": "だけましだ",
    "means": "~만으로 다행이다",
    "description":
        "이미 좋지 않은 상황인 것을 인정하면서도, 앞에 서술한 정도에 머물러 다행이다 (최소한의 피해로 끝났다) 라는 의미를 나타낸다\n\n~だけまだましだ 라고 まだ 가 붙어 강조할 때도 있다.",
    "connectionWays":
        "명사 + である + だけましだ\nな형용사 어간 + な / である + だけましだ\nい형용사 보통형 + だけましだ\n동사 보통형 + だけましだ",
    "examples": [
      {
        "answer": "だけまだましだ",
        "word": "確かに暑いが, 湿度が高くないだけまだましだ。",
        "mean": "확실히 덥긴 하지만 습도가 높지 않은 것 만으로도 다행이다"
      },
      {
        "answer": "だけましだ",
        "word": "喧嘩できるだけましだ。こっちは喧嘩する恋人さえいないんだから。",
        "mean": "싸울 수 있는 만으로 다행이다.이쪽은 싸울 애인조차 없다니까."
      },
      {
        "answer": "だけましだ",
        "word": "残業時間は長いが, 残業代がしっかり出るだけましだ。",
        "mean": "잔업 시간은 길지만 잔업비가 나오는 것만으로도 다행이다."
      },
      {
        "answer": "だけましです",
        "word": "怪我はしたものの, 大事にならなかっただけましです。",
        "mean": "다치기는 했지만 큰 사건이 되지 않은 것 만으로도 다행입니다."
      },
      {
        "answer": "だけましだ",
        "word": "隣の部屋から日中騒音が凄いが, 深夜は静かなだけましだ。",
        "mean": "옆방에서 낮 동안 소음이 대단하지만 심야에 조용한 것 만으로도 다행이다."
      },
      {
        "answer": "だけましだ",
        "word": "金品は根こそぎ盗られたが, 殺されなかっただけましだと思いたい。",
        "mean": "금품은 송두리째 도둑맞았지만 살해 되지 않은 것만으로도 다행이라고 생각하고 싶다"
      },
      {
        "answer": "だけましだ",
        "word": "喉は痛いが, 声が変わっていないだけましだ。",
        "mean": "목은 아프지만 목소리가 변하지 않은 것 만으로도 다행이다."
      },
      {
        "answer": "だけまし",
        "word": "鼻水がつらいが, 熱が出ていないだけまし。",
        "mean": "콧물이 괴롭지만 열이 나지 않은 것 만으로도 다행이다"
      }
    ]
  },
  {
    "id": 19,
    "grammar": "てしかるべきだ",
    "means": "~하는게 당연하다",
    "description": "しかるべき + 명사 형태에 연체사적인 사용하면 [적합하다] 라는 의미가 된다.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "てしかるべき",
        "word": "女性は料理ができてしかるべきという考え方は古い。",
        "mean": "여자는 당연히 요리를 할 줄 알아야 한다는 생각은 오래됐다."
      },
      {
        "answer": "しかるべきだ",
        "word": "軍は上から下まで統率がとれていてしかるべきだ。",
        "mean": "군은 위에서부터 아래까지 통솔되어야 하는게 당연하다"
      },
      {
        "answer": "しかるべきだ",
        "word": "生まれ持った能力なんて持っていなくてしかるべきだと思う。",
        "mean": "타고난 능력 따위는 가지고 있지 않아야 하는것이 당연하다고 생각한다."
      },
      {
        "answer": "しかるべきだ",
        "word": "非正規社員でも能力が伴っていれば給与も高くてしかるべきだ。",
        "mean": "비정규직이라도 능력이 따랐다면 급여도 높아야하는게 당연하다."
      },
      {
        "answer": "しかるべきだ",
        "word": "後輩なら先輩に敬語を使ってしかるべきだ。",
        "mean": "후배라면 선배에게 존댓말을 써야하는게 당연하다."
      },
      {
        "answer": "しかるべきだ",
        "word": "彼はその功績からもっと評価されてしかるべきだ。",
        "mean": "그는 그 공적으로부터 더 평가 받는것이 마땅하다."
      },
      {
        "answer": "てしかるべき",
        "word": "恋愛は辛くてしかるべきものだ。",
        "mean": "연애는 괴로운 것이 마땅한 것이다."
      },
      {
        "answer": "しかるべきだ",
        "word": "仮に誕生日でも, プレゼントはもらえてしかるべきだと思わないことだ。",
        "mean": "가령 생일이라도 선물은 받는게 당연하다고 생각해서는 안되는 것이다."
      }
    ]
  },
  {
    "id": 20,
    "grammar": "~ては~ては",
    "means": "~하고~하고",
    "description":
        "두 개의 동사를 반복해서 사용하여 동작이나 현상이 반복되어 일어남을 나타낸다.\n\n[~ちゃ~ちゃ ,~じゃ~じゃ] 가 회화적 표현이다",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "離婚しては",
        "word": "結婚しては離婚し, 離婚しては結婚し。",
        "mean": "결혼하고는 이혼하고, 이혼하고는 결혼하고"
      },
      {
        "answer": "寝ては",
        "word": "食べては寝, 寝ては食べの生活は太りやすい。",
        "mean": "먹고 자고 자고 먹고 사는 생활은 살찌기 쉽다."
      },
      {
        "answer": "消して",
        "word": "もう三日三晩卒論を書いては消し, 消しては書くの繰り返しだ。",
        "mean": "벌써 사흘 밤 졸업 논문을 쓰고 지우고 쓰기의 반복이다."
      }
    ]
  },
  {
    "id": 22,
    "grammar": "てはばからない",
    "means": "~하기를 주저하지 않는다\n~거리낌 없이~하다",
    "description":
        "憚る(はばかる) [꺼리다] 의 부정표현이 문법화 된 것. \n\n거리낌 없이 눈치 보지 않고 당당하게 행동할 때 사용 ",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "てはばからない",
        "word": "田中さんは自分がクラスで一番頭がいいと言ってはばからない。",
        "mean": "다나카씨는 자신이 반에서 가장 머리가 좋다고 말하는 것을 주저하지 않는다."
      },
      {
        "answer": "てはばからない",
        "word": "その政治家は日本のアニメオタクであることを公言してはばからない。",
        "mean": "그 정치인은 일본 애니메이션 오타쿠임을 거리낌없이 공언했다."
      },
      {
        "answer": "てはばからない",
        "word": "最近のアイドルは[ 恋人がいる ]と公言してはばからない。",
        "mean": "요즘 아이돌은 애인이 있다고 공언하기를 주저하지 않는다."
      },
      {
        "answer": "てはばからない",
        "word": "部長は部下の功績を自分のものと嘘をついてはばからない。",
        "mean": "부장은 부하의 공적을 자기 것이라고 거짓말하는 것을 주저하지 않는다."
      },
      {
        "answer": "てはばからない",
        "word": "言い訳が多い人はなんでも時代のせいにしてはばからない。",
        "mean": "변명이 많은 사람은 뭐든지 시대를 탓이라고 하는 것을 주저하지 않는다."
      },
      {
        "answer": "てはばからない",
        "word": "弟は少しテレビに映っただけなのに, 有名人を気取ってはばからない。",
        "mean": "동생은 잠깐 TV에 나왔을 뿐인데 거리낌 없이 유명인 척을 한다."
      },
      {
        "answer": "てはばからない",
        "word": "彼女は彼の好きな部分をみんなに語ってはばからない。",
        "mean": "그녀는 그가 좋아하는 부분을 모두에게 말하는 것을 주저하지 않는다."
      },
      {
        "answer": "てはばからない",
        "word": "彼は利益のためなら周りの人を犠牲にしてはばからない人だ。",
        "mean": "그는 이익을 위해서라면 주위 사람들을 희생 시키기를 주저하지 않는 인간이다."
      },
      {
        "answer": "てはばからない",
        "word": "あの親は自分の子どもが天才だと断言してはばからない。",
        "mean": "저 부모는 자기 아이가 천재라고 단언하는 하는 것을 주저하지 않는다."
      },
      {
        "answer": "とってはばからない",
        "word": "佐藤さんは仕事はよくできるが, 他人に不機嫌な態度をとってはばからないので嫌われている。",
        "mean": "사토 씨는 일은 잘하지만, 다른 사람에게 기분 나쁜 태도를 하는 것을 주저하지 않기 때문에 미움을 받고 있다."
      },
      {
        "answer": "てはばからない",
        "word": "彼は実家がお金持ちなことを自慢してはばからない。",
        "mean": "그는 친정이 부자라는 것을 거리낌 없이 자랑한다."
      }
    ]
  },
  {
    "id": 23,
    "grammar": "てまで / までして",
    "means": "~해서 까지",
    "description": "~와 같은 심한 / 극단적인 정도 까지",
    "connectionWays": "명사 + までして\nて형 + まで",
    "examples": [
      {
        "answer": "までして",
        "word": "どれだけ欲しくても, 借金までして買いたいとは思わない。",
        "mean": "아무리 갖고 싶어도 빚을 내서까지 사고 싶은 생각은 없다."
      },
      {
        "answer": "聞いてまで",
        "word": "直接本人に聞いてまで知りたいわけじゃない。",
        "mean": "직접 본인한테 물어보면서까지 알고 싶은 건 아니야."
      },
      {
        "answer": "並んでまで",
        "word": "わざわざ１時間も行列に並んでまで食べたくない。",
        "mean": "일부러 1시간이나 줄을 서서까지 먹고 싶지 않아."
      },
      {
        "answer": "までして",
        "word": "なぜそうまでして嘘をつくのだろうか。",
        "mean": "왜 그렇게해서까지 거짓말을 할까."
      },
      {
        "answer": "までして",
        "word": "結婚のために夜勤までして貯めたお金を使い込まれた。",
        "mean": "결혼하느라 야근까지 해서 모은 돈을 탕진했다."
      },
      {
        "answer": "してまで",
        "word": "徹夜してまで追い込んだのに, 試験では力を出し切れなかった。",
        "mean": "밤새워 몰아붙였는데도 시험에서는 힘을 다 낼 수가 없었다."
      }
    ]
  },
  {
    "id": 24,
    "grammar": "てみせる",
    "means": "~해 보이겠다.",
    "description": "타인에게 이해를 받기 위해 모범을 나타내는 표현.",
    "connectionWays": "동사て형 접속",
    "examples": [
      {
        "answer": "やってみせて",
        "word": "やり方が分からないので, 一度やってみせてくれませんか？",
        "mean": "방법을 모르는데 한번 해보시겠어요?"
      },
      {
        "answer": "やってみせましょう",
        "word": "この実験は危険ですので, まずは私が皆さんにやってみせましょう。",
        "mean": "이 실험은 위험하기 때문에 우선 제가 여러분께 해 보이겠습니다."
      },
      {
        "answer": "てみせましょう",
        "word": "何でもいいので好きな絵を描いてください。私はあなたが何を描いたか当ててみせましょう。",
        "mean": "아무거나 좋으니까 좋아하는 그림을 그려주세요.저는 당신이 무엇을 그렸는지 맞춰보겠어요"
      },
      {
        "answer": "描いてみせますね",
        "word": "人を描くときは筋肉の構造を知らなければいけません。私がまず全身を描いてみせますね。",
        "mean": "사람을 그릴 때는 근육의 구조를 알아야 해요.제가 먼저 온몸을 그려 볼게요."
      },
      {
        "answer": "やってみせますから",
        "word": "私がやってみせますから見ていてください。",
        "mean": "제가 해보일테니 보고 계세요."
      },
      {
        "answer": "見せましょうか",
        "word": "私, ムーンウォークできます！　やって見せましょうか。",
        "mean": "저 문워크 할 수 있어요! 해볼까요?"
      },
      {
        "answer": "踊って見せます",
        "word": "まず私が皆さんに踊って見せます。できる限りマネしてみてください。",
        "mean": "일단 제가 여러분들께 춤을 춰볼게요.최대한 따라해보세요."
      }
    ]
  },
  {
    "id": 25,
    "grammar": "ても差し支えない",
    "means": "~해도 괜찮다\n~해도 좋다\n~해도 문제 없다",
    "description":
        "소극적인 허가, 혀용을 나타낸다.\n\nても構わない 의 딱딱한 표현\n\nてもさしつかえない 라고 발음한다.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "差し支えない",
        "word": "年賀状などあってもなくても全く差し支えない。",
        "mean": "연하장 같은 건 있어도 전혀 문제 없어요."
      },
      {
        "answer": "ても差し支えない",
        "word": "副業しなくても差し支えないくらいの給料が欲しい。",
        "mean": "부업하지 않아도 지장 없을 정도의 급료를 받고 싶다."
      },
      {
        "answer": "ても差し支えない",
        "word": "楽器の演奏は, 手が覚えれば見えなくても差し支えない。",
        "mean": "악기 연주는 손이 익히면 보이지 않아도 괜찮다."
      },
      {
        "answer": "なくても差し支えない",
        "word": "死ぬ訳じゃないので, 絵は描けなくても差し支えない。",
        "mean": "죽는 것이 아니기 때문에 그림은 그릴 수 없어도 문제없다."
      },
      {
        "answer": "ても差し支えなく",
        "word": "最新作は前作を見ていなくても差し支えなく理解できるそうだ。",
        "mean": "최신작은 전작을 보지 않아도 문제 없이 이해할 수 있다고 한다."
      },
      {
        "answer": "ても差し支えない",
        "word": "私一人くらい行かなくても差し支えないだろう。",
        "mean": "나 혼자 정도는 안가도 괜찮겠지."
      },
      {
        "answer": "ても差し支えない",
        "word": "水商売は学歴がなくても差し支えない職業ではある。",
        "mean": "물장사는 학력이 없어도 무방한 직업이긴 하다."
      },
      {
        "answer": "ても差し支えのない",
        "word": "この会社にとっての私は, いてもいなくても差し支えのない存在だ。",
        "mean": "이 회사에 있어서의 나는, 있든 없든 상관없는 존재다."
      }
    ]
  },
  {
    "id": 26,
    "grammar": "てもともとだ",
    "means": "~해도 본전치기다",
    "description": "가능성이 희박한 것을 나타내는 경우나 도전해서 실패한 경우에 사용함",
    "connectionWays": "て형 접속",
    "examples": [
      {"answer": "元々だ", "word": "ダメで元々だ", "mean": "밑저야 본전이다"},
      {"answer": "もともとだ", "word": "負けてもともとだ", "mean": "져보 본전이다"},
      {"answer": "もともとだ", "word": "失敗してもともとだと思う", "mean": "실패해도 본전이라고 생각해"}
    ]
  },
  {
    "id": 28,
    "grammar": "~というか ~というか /~といおうか ~といおうか",
    "means": "~라고 할까 ~라고 할까",
    "description":
        "자신이 느끼고 있는 인상이나 판단을 서술하여 그것을 설명하거나 평가하는 표현.\n\n직접적으로 말하는 것을 피할 때 사용함.",
    "connectionWays": "な형용사 어간\n나머지는 보통형에 접속",
    "examples": [
      {
        "answer": "悲しいというか",
        "word": "よく一緒に遊んでいた友人が転校してしまい, 寂しいというか悲しいというか, この感情は誰にも説明できない。",
        "mean": "자주 같이 놀던 친구가 전학을 가서 외롭다고 할까 슬프다고 할까, 이 감정은 누구에게도 설명할 수 없다."
      },
      {
        "answer": "残念というか",
        "word": "この映画のオチには失望というか残念というか, 見なければ良かったと思う。",
        "mean": "이 영화의 만담에는 실망이랄까 아쉽다랄까, 안 봤으면 좋았을 것 같아."
      },
      {
        "answer": "無茶というか",
        "word": "あんなところに一人で行くなんて, 無謀というか無茶というか, とにかく私には理解できない。",
        "mean": "저런 곳에 혼자 가다니 무모하다고 할까, 터무니없다고 할까, 어쨌든 나는 이해할 수 없다."
      },
      {
        "answer": "嬉しいというか",
        "word": "たくさんお祝いをしていただき, 嬉しいというか感謝というか, 言葉になりません。",
        "mean": "축하를 많이 해 주셔서 기쁘다고 할까, 감사하다고 할까, 말이 되지 않습니다."
      },
      {
        "answer": "何というか",
        "word": "この質問には答えづらいというか何というか, 女性にする質問としては不適切だと思う。",
        "mean": "이 질문에는 대답하기 어렵다고 할까, 뭐랄까, 여성에게 하는 질문으로는 부적절하다고 생각한다."
      },
      {
        "answer": "面白いというか",
        "word": "彼は変というか面白いというか, どこか他の人と違う。",
        "mean": "그는 이상하다고 할까 재미있다고 할까, 어딘가 다른 사람과 다르다."
      },
      {
        "answer": "無神経というか",
        "word": "そんなことを言うなんて無神経というか何というか, 彼の人格を疑う。",
        "mean": "그런 말을 하다니 무신경하다고 할까, 뭐랄까, 그의 인격을 의심한다."
      },
      {
        "answer": "味が濃いというか",
        "word": "自分でチャーハン作ってみたけど食感が悪いというか味が濃いというか, 反省点がたくさんある。",
        "mean": "직접 볶음밥 해봤는데 식감이 안 좋다고 할까, 맛이 진하다고 할까 반성점이 많이 있다."
      }
    ]
  },
  {
    "id": 29,
    "grammar": "기간 / 시간 명사 + というもの",
    "means": "(최근) ~동안",
    "description": "그 기간에 어떤 큰 변화가 생긴것을 표현하는 문법",
    "connectionWays": "ここ / この + 시간 / 기간 명사 + というもの",
    "examples": [
      {
        "answer": "ここ３年というもの",
        "word": "ここ３年というもの, 毎日必死に仕事に打ち込んできた。",
        "mean": "최근 3년이라는 것은 매일 필사적으로 일에 몰두해 왔다."
      },
      {
        "answer": "この１週間というもの",
        "word": "引っ越ししてからのこの１週間というもの, ずっと荷物の整理をしている。",
        "mean": "이사하고 나서 지난 1주일이라는 것, 계속 짐 정리를 하고 있다."
      },
      {
        "answer": "ここ数日というもの",
        "word": "ここ数日というもの, カモメの鳴き声に起こされて眠れない夜が続いていた。",
        "mean": "요 며칠 동안 갈매기 울음소리에 잠 못 이루는 밤이 계속되고 있었다."
      },
      {
        "answer": "ここ数年というもの",
        "word": "ここ数年というもの, 手帳にはまっています。",
        "mean": "최근 몇 년 동안 수첩에 빠져 있습니다."
      },
      {
        "answer": "ここ１年というもの",
        "word": "ここ１年というものずっと引きこもっていたので四季というものを忘れていた。",
        "mean": "지난 1년이라는 것을 줄곧 외톨이였기 때문에 사계절이라는 것을 잊고 있었다."
      },
      {
        "answer": "ここ最近というもの",
        "word": "ここ最近というものカメラにハマっております。",
        "mean": "요즘이라는 게 카메라에 빠져있어요."
      },
      {
        "answer": "この数日というもの",
        "word": "この数日というもの, 湿度が高くて汗が止まらない。",
        "mean": "요 며칠이라는 것은 습도가 높아서 땀이 멈추지 않는다."
      },
      {
        "answer": "この数年というもの",
        "word": "この数年というもの, お祭りの空気感というものを味わってなかったので童心に帰ったような少し懐かしい気分になれた。",
        "mean":
            "지난 몇 년 동안 축제의 분위기라는 것을 맛보지 못했기 때문에 동심으로 돌아간 것 같은 조금 그리운 기분이 들었다."
      }
    ]
  },
  {
    "id": 30,
    "grammar": "~といわず ~といわず",
    "means": "~이며 ~이며 (할 것 없이)\n~이건 ~이건 (할 것 없이)",
    "description":
        "앞뒤로 두 가지 예를 들고 그 두 가지가 전부 그렇다\n\n뒤에는 평가, 상태, 동작 등 폭넓은 내용 (보통 안 좋은 내용)",
    "connectionWays": "명사에 접속",
    "examples": [
      {
        "answer": "就寝中といわず",
        "word": "入浴中といわず, 就寝中といわず, 片時もスマホを手放さない。",
        "mean": "입욕중이건 취침중이건 한시도 스마트폰을 놓지 않는다."
      },
      {
        "answer": "夜といわず",
        "word": "彼は昼といわず, 夜といわずいつもお菓子を食べている。",
        "mean": "그는 점심이든 밤이든 항상 과자를 먹고 있다."
      },
      {
        "answer": "手といわず",
        "word": "顔といわず, 手といわず泥まみれだ。",
        "mean": "얼굴이며 손이며 진흙투성이다."
      },
      {
        "answer": "床といわず",
        "word": "仕事から帰ってきたら, 壁といわず, 床といわず, 部屋中で飼い猫に滅茶苦茶にされていた。",
        "mean": "퇴근하고 돌아오니 벽이며 바닥이며 방 안에서 기르는 고양이에게 엉망이 되어 있었다."
      },
      {
        "answer": "週末といわず",
        "word": "私は平日といわず週末といわず, 毎日仕事している。",
        "mean": "나는 평일이든 주말이든 매일 일해."
      },
      {
        "answer": "犬といわず",
        "word": "猫といわず, 犬といわず, 動物なら何でも好きです。",
        "mean": "고양이든 개든 동물이든 다 좋아합니다."
      },
      {
        "answer": "女といわず",
        "word": "男といわず, 女といわず, 人は誰でも平等であるべきだ。",
        "mean": "남자든 여자든 사람이든 평등해야 한다."
      },
      {
        "answer": "趣味といわず",
        "word": "仕事といわず, 趣味といわず, 何でも全力でやりたい。",
        "mean": "일이든 취미든 뭐든 전력으로 하고 싶다."
      }
    ]
  },
  {
    "id": 32,
    "grammar": "とて",
    "means": "~도 역시,~라도",
    "description": "같은 분류의 다른 것과 비교해도 다를게 없다라고 주장할 때 사용하는 표현",
    "connectionWays": "명사에 접속",
    "examples": [
      {"answer": "とて", "word": "今日も今日とてバイト。", "mean": "오늘도 오늘도 역시 아르바이트."},
      {
        "answer": "とて",
        "word": "私も被害者だが, 彼とて被害者だ。",
        "mean": "나도 피해자지만 그 역시 피해자다."
      },
      {
        "answer": "とて",
        "word": "私とて人間だし, できないこともある。",
        "mean": "나도 역시 사람이고 못하는 것도 있어."
      },
      {"answer": "とて", "word": "学校の先生とて人間。", "mean": "학교 선생님이라고 인간."},
      {
        "answer": "とて",
        "word": "専門家とて[ 絶対にこうだ ]と断定することは難しい。",
        "mean": "전문가라도 절대 이렇다라고 단정하기는 어렵다."
      },
      {
        "answer": "とて",
        "word": "誰でも望んでこの世に生まれてきた。君とてそうだ。",
        "mean": "누구나 원하고 이 세상에 태어났다.너도 역시 그렇다."
      }
    ]
  },
  {
    "id": 33,
    "grammar": "とまでは言わないが / とまでは言わないとしても / とまでは言わないにしても",
    "means": "~라고까지는 할 수 없지만\n~라고까지는 할 수 없어도 ",
    "description": "다양한 모양으로 사용된다. 예시를 보면서 익히는 것이 좋음",
    "connectionWays": "な형용사 어간\n나머지는 보통형에 접속",
    "examples": [
      {
        "answer": "とまでは言わないが",
        "word": "昔は良かったとまでは言わないが, ふと懐かしくなることもある。",
        "mean": "옛날에는 좋았다고까지는 말하지 않지만 문득 그리워지기도 한다."
      },
      {
        "answer": "とまでは言わないが",
        "word": "[ 大人になれ ]とまでは言わないが, お前はもう子どもじゃないんだ。分かるか？",
        "mean": "어른이 되라는 말까지는 안 하지만 넌 이제 어린애가 아니야.알아?"
      },
      {
        "answer": "までは言わないにしても",
        "word": "お酒を飲むなとまでは言わないにしても, 意識が飛ぶほど飲むのは止めてほしい。",
        "mean": "술을 마시지 말라고까지는 말하지 않더라도 의식이 날아갈 정도로 마시는 것은 그만두었으면 한다."
      },
      {
        "answer": "とまでは言わなくとも",
        "word": "お金さえあれば幸せとまでは言わなくとも, ほとんどの事はお金で解決できる。",
        "mean": "돈만 있으면 행복하다고까지는 말할 수 없어만 대부분의 일은 돈으로 해결할 수 있다."
      },
      {
        "answer": "とは言わないまでも",
        "word": "絶対やるなとは言わないまでも, やるなら十分注意したほうがいい。",
        "mean": "절대 하지 말라고는 말하지 않아도 한다면 충분히 주의하는 편이 좋다."
      },
      {
        "answer": "とまでは言わないが",
        "word": "裕福とまでは言わないが, 週１で贅沢できるような生活がしたい。",
        "mean": "부유하다고까지는 말하지 않지만, 주 1로 사치할 수 있는 생활을 하고 싶다."
      },
      {
        "answer": "とは言わないにしても",
        "word": "腹筋を割るとは言わないにしても, お腹周りの贅肉は取り除きたい。",
        "mean": "복근을 깬다고는 하지 않더라도 뱃살은 빼고 싶다."
      },
      {
        "answer": "とは言わないまでも",
        "word": "[ 鬼滅の刃 ]は過去に見たアニメの中で一番とは言わないまでもかなり好き。",
        "mean": "귀멸의 칼날은 과거에 본 애니메이션 중에서 으뜸이라고는 할 수 없어도 꽤 좋아."
      }
    ]
  },
  {
    "id": 34,
    "grammar": "ない(もの)でもない / なくもない",
    "means": "~하지 않는 것도 아니다\n안 ~ 하는 건 아니다",
    "description":
        "1. 소극적인 단정을 나타낸다.\n사고[思考]나 감정 등에 관련된 말에 붙음\n\n2. 소극적인 가능성을 나타낸다\n가능성이 0 은 아니지만 원칙적으론 불가능 할 때 사용된다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "気がしないでもない",
        "word": "彼を見ていると, 過去の自分を見ている気がしないでもない。",
        "mean": "그를 보고 있으면 과거의 자신을 보는 기분이 들지 않는 것도 않는다."
      },
      {
        "answer": "分からないでもないが",
        "word": "マナーの悪い人に対して腹が立つのは分からないでもないが, 手を出すのは良くない。",
        "mean": "매너가 나쁜 사람에 대해 화가 나는 것은 모르는 것도 아니지만 손을 대는 것은 좋지 않다."
      },
      {
        "answer": "思わないものでもないが",
        "word": "彼女のことは可哀想とは思わないものでもないが, 結局自業自得だったと思う。",
        "mean": "그녀를 불쌍히 여기지 않는 것도 아니지만 결국 자업자득이었다고 생각한다."
      },
      {
        "answer": "ないものでもない",
        "word": "気温が35度を超えると命の危険を感じないものでもない。",
        "mean": "기온이 35도를 넘으면 생명의 위험을 느끼지 않는 것도 아니다."
      },
      {
        "answer": "ないものでもない",
        "word": "子どもの頃にそろばんを習ったので暗算が得意。そこだけは親に感謝しないものでもない。",
        "mean": "어렸을 때 주판을 배웠기 때문에 암산이 특기. 거기만은 부모에게 감사하지 않는 것도 아니다."
      },
      {
        "answer": "しないでもない",
        "word": "殺人はしてはいけないことだが, 犯人の境遇を考えると多少同情しないでもない。",
        "mean": "살인은 해서는 안 되는 일이지만 범인의 처지를 생각하면 다소 동정하지 않는 것도 않는다."
      },
      {
        "answer": "なくもない",
        "word": "謎の下痢。思い当たる節がなくもない。",
        "mean": "수수께끼의 설사. 짚이는 데가 없지 않은 것도 아니다."
      },
      {
        "answer": "しなくもない",
        "word": "痛烈な反論は歓迎しなくもない。",
        "mean": "통렬한 반론은 환영하지 않는 것도 아니다"
      },
      {
        "answer": "やらないでもない",
        "word": "今素直に謝ってくれるのであれば, 許してやらないでもない。",
        "mean": "지금 솔직하게 사과해준다면 용서해 주지 않는 것도 아니다."
      },
      {
        "answer": "行けないでもない",
        "word": "ここからは少し遠いが, 頑張れば歩いて行けないでもない。",
        "mean": "여기서는 좀 멀지만 열심히 하면 걸어갈 수 없는 것도 아니다."
      },
      {
        "answer": "作れないものでもない",
        "word": "レシピさえ見れれば, 私にも作れないものでもない。",
        "mean": "레시피만 보면 나도 못 만드는 것도 아니야."
      },
      {
        "answer": "出れないものでもない",
        "word": "骨折したが, 助けさえあれば部屋から出れないものでもない。",
        "mean": "골절상을 입었지만 도움만 있으면 방에서 나올 수 없는 것도 아니다."
      },
      {
        "answer": "ないものでもない",
        "word": "お金さえ積んでくれれば, 譲れないものでもない。",
        "mean": "돈만 쌓아주면 양보할 수 없는 것도 아니다."
      },
      {
        "answer": "ないものでもない",
        "word": "人間関係は学校でしか学べないものでもない。",
        "mean": "인간관계는 학교에서만 배울 수 없는 것도 아니다."
      },
      {
        "answer": "届かなくもない",
        "word": "あの車ちょっと高いが, 貯金すれば手が届かなくもない。",
        "mean": "저 차 좀 비싸지만 저금하면 손이 닿지 않는 것도 않이다."
      },
      {
        "answer": "決められなくもない",
        "word": "時間があればゆっくり考えるが, 決断しなければならないなら今すぐ決められなくもない。",
        "mean": "시간이 나면 천천히 생각하겠지만 결단을 내려야 한다면 당장 결정할 수 없는 것도 아니다."
      }
    ]
  },
  {
    "id": 35,
    "grammar": "~くらいでないと / くらいでなければ",
    "means": "~할 정도가 아니면",
    "description": "앞의 상황이나 역경 등을 충족시키거나 참아내지 못하면 뒤의 일이 실행될 수 없다는 것을 나타낸다",
    "connectionWays": "명사\n동사 보통형\nい형용사 보통형\nな형용사 어간",
    "examples": [
      {
        "answer": "くらいでないと",
        "word": "いざとなったら顔でも止めるくらいでないと, ゴールキーパーは務まらない。",
        "mean": "막상 그때가 되어 얼굴로라도 멈추게 할 거 정도가 아니면 골키퍼는 맞글 수 없다"
      },
      {
        "answer": "ぐらいでないと",
        "word": "ピンチをチャンスと思うぐらいでないと, この逆境は乗り越えられない。",
        "mean": "위기를 기회라고 생각하는 정도가 아니면 이 역경은 극복할 수 없다."
      },
      {
        "answer": "くらいでないと",
        "word": "都市を封鎖し, 外出した者に罰則を与えるくらいでないとコロナウイルスの感染拡大は防げない。",
        "mean": "도시를 봉쇄하고 외출한 사람에게 벌칙을 줄 정도가 아니면 코로나19 확산을 막을 수 없다."
      },
      {
        "answer": "ぐらいでないと",
        "word": "命を懸けるぐらいでないと, ビジネスで革命的なことは成し遂げられない。",
        "mean": "목숨을 거는 정도가 아니면 비즈니스에서 혁명적인 것을 이룰 수 없다."
      },
      {
        "answer": "くらいでないと",
        "word": "金銭感覚が同じくらいでないと恋愛は続かない。",
        "mean": "금전 감각이 비슷해야 연애가 지속된다."
      },
      {
        "answer": "ぐらいでないと",
        "word": "勉強も仕事もゲームも, 何でも毎日続けるぐらいでないと上達しない。",
        "mean": "공부도 일도 게임도 뭐든지 매일 계속하는 정도가 아니면 늘지 않는다."
      },
      {
        "answer": "くらいじゃないと",
        "word": "最低１万円くらいじゃないと, 良いイヤホンとは言えない。",
        "mean": "최소 1만엔 정도가 아니면 좋은 이어폰이라고 할 수 없다."
      },
      {
        "answer": "ぐらいでないと",
        "word": "この会社の採用試験は, 学歴が有名大学ぐらいでないと相手にされない。",
        "mean": "이 회사의 채용시험은 학력이 유명 대학 정도가 아니면 상대할 수 없다."
      }
    ]
  },
  {
    "id": 36,
    "grammar": "ないとも限らない",
    "means": "(어쩌면) ~할지도 모른다\n~가 아니라고도 단정 지을 수 없다",
    "description":
        "어느 상황에 발생하는 가능성이 희박하게 남아 있는 것을 나타낼 때 사용하는 표현\n\n화자의 걱정이 포함되어 있고, 앞 문장 혹은 뒷 문장에 그 가능성에 대한 대책을 취하려고 하는 내용이 나타나 있음.\n\n[いつ,どこ] 등 의문사가 동반할 경우 동사 사전형에도 접속 할 수 있다.",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "しないとも限らないから",
        "word": "災害で自分が被災しないとも限らないから食料等はちゃんと備蓄しておこうと思う。",
        "mean": "재해로 자신이 피해를 입지 않는다고도 할 수 없기 때문에 식량 등은 제대로 비축해 두려고 생각한다."
      },
      {
        "answer": "招かないとも限らない",
        "word": "曖昧な返事をすると誤解を招かないとも限らないので, はっきり言ったほうがいいと思う。",
        "mean": "애매한 대답을 하면 오해를 살수도 있으니 분명히 말하는 게 좋을 것 같아."
      },
      {
        "answer": "ないとも限らないから",
        "word": "早めに出発しよう。もしかしたら間に合わなくなることがないとも限らないから。",
        "mean": "빨리 출발하자. 혹시라도 제시간에 못 맞출 수도 있기 때문에"
      },
      {
        "answer": "ないとも限らない",
        "word": "美しい花には棘があると言うが, 美しくない花には棘がないとも限らない。",
        "mean": "아름다운 꽃에는 가시가 있다고 하지만 아름답지 않은 꽃에는 가시가 없다고도 할 수 없다."
      },
      {
        "answer": "ないとも限らない",
        "word": "努力すれば必ず夢が叶うというわけではないが, 叶わないとも限らない。",
        "mean": "노력하면 반드시 꿈이 이루어진다는 것은 아니지만 이루어지지 말라는 법도 없다."
      },
      {
        "answer": "とも限らない",
        "word": "災害はいつ襲ってくるとも限らない。",
        "mean": "재해는 언제 닥칠지도 모른다."
      },
      {
        "answer": "とも限らない",
        "word": "首都圏ではいつ巨大な地震が起こるとも限らないと言われている",
        "mean": "수도권에서는 언제 거대한 지진이 일어난다고 할 수 없다고 한다."
      }
    ]
  },
  {
    "id": 37,
    "grammar": "ならいざしらず",
    "means": "~라면 모를까",
    "description":
        "1. 앞 문장은 허용 할 수 있지만, 뒷 문장은 이해 하는 것도 받아 드리는 것도 불가능한 것을 나타낸다.\n\n2. 뒷 문장에는 앞 문장 보다 정도가 나쁜 것을 서술할 수 있다.\n\n3. 화자의 불평불만을 강하게 표현한다.\n\n4. 명사와 접속할 때는 はいざしらず 으로도 표현 할 수 있음.",
    "connectionWays": "명사 + ならいざしらず\n동사 보통형 + ならいざしらず",
    "examples": [
      {
        "answer": "ならいざしらず",
        "word": "数千円のウイスキーならいざしらず, 数万円台のを買うなら失敗したくない。",
        "mean": "몇 천엔짜리 위스키라면 몰라도 몇 만엔대짜리를 산다면 실패하고 싶지 않다."
      },
      {
        "answer": "ならいざしらず",
        "word": "このマスクの量は病院ならいざしらず, 家族みんなで使うくらいなら十分な量だ。",
        "mean": "이 마스크의 양은 병원이라면 몰라도 온 가족이 쓸 정도면 충분한 양이다."
      },
      {
        "answer": "ならいざしらず",
        "word": "このような詐欺手法は20年前ならいざしらず, 現代においては通用しない。",
        "mean": "이런 사기 수법은 20년 전이라면 몰라도 현대에는 통하지 않는다."
      },
      {
        "answer": "ならいざしらず",
        "word": "初めてとか２回目とかならいざしらず, 経験者が失敗するのは許されない。",
        "mean": "처음이라든지 두 번째라든지라면 몰라도 경험자가 실패하는 것은 허용되지 않는다."
      },
      {
        "answer": "ならいざしらず",
        "word": "登山という行為はパーティを組むならいざしらず, 単独で行うケースは少ない。",
        "mean": "등산은 파티를 한다면 몰라도 단독으로 하는 경우는 드물다."
      },
      {
        "answer": "ならいざしらず",
        "word": "他人ならいざしらず, 自分の嫁なら太っても太ったなりの魅力を感じれる。",
        "mean": "남들이라면 몰라도 자기 며느리라면 뚱뚱해도 살찐 나름의 매력을 느낄 수 있다."
      },
      {
        "answer": "ならいざしらず",
        "word": "広い場所ならいざしらず, 狭い空間ならこちらにも勝機がある。",
        "mean": "넓은 장소라면 몰라도 좁은 공간이라면 이쪽에도 승기가 있다."
      },
      {
        "answer": "はいざしらず",
        "word": "他人のことはいざしらず, 自分の事を他人に決められるのは嫌だ。",
        "mean": "남의 일은 몰라도 자신의 일을 남이 결정하는 것은 싫다."
      },
      {
        "answer": "ならいざしらず",
        "word": "子供が責任を持って世話をするならいざしらず, なんとなく飼いたいという軽い気持ちでは犬も猫も可哀そうです。",
        "mean": "아이가 책임지고 돌본다면 몰라도 왠지 모르게 키우고 싶은 가벼운 마음으로는 개나 고양이나 불쌍합니다."
      }
    ]
  },
  {
    "id": 38,
    "grammar": "ならともかく / ならまだしも",
    "means": "~라면 몰라도",
    "description":
        "1. 앞 문장은 허용 할 수 있지만, 뒷 문장은 이해 하는 것도 받아 드리는 것도 불가능한 것을 나타낸다. \n\n2. 뒷 문장에는 앞 문장 보다 정도가 나쁜 것을 서술할 수 있다.\n\n3. 화자의 불평물만을 강하게 표현한다.",
    "connectionWays": "な형용사 어간\n나머지는 보통형에 접속",
    "examples": [
      {
        "answer": "ならともかく",
        "word": "新入社員だから教えてくれるならともかく, 全て自分で学べというのには無理がある。",
        "mean": "신입사원이니 가르쳐 준다면 몰라도 다 알아서 배우라는 것은 무리가 있다."
      },
      {
        "answer": "ならともかく",
        "word": "現状維持ならともかく, 後退するのは言語道断だ。",
        "mean": "현상 유지라면 몰라도 후퇴하는 것은 언어도단이다."
      },
      {
        "answer": "ならともかく",
        "word": "子供のイタズラならともかく, 大人のしたことだったら許されない。",
        "mean": "아이의 장난이라면 몰라도 어른이 한 짓이라면 용서받을 수 없다."
      },
      {
        "answer": "ならともかく",
        "word": "雨の日に体調悪くて出かけられないのならともかく, 晴れの日にそうだったら残念極まりない。",
        "mean": "비 오는 날 몸이 안 좋아서 못 나가면 몰라도 맑은 날 그랬다면 안타깝기 짝이 없다."
      },
      {
        "answer": "ならまだしも",
        "word": "友達ならまだしも, 知り合ったばかりの人にはお金は貸せない。",
        "mean": "친구라면 몰라도 막 알게 된 사람에게는 돈을 빌려줄 수 없다."
      },
      {
        "answer": "ならまだしも",
        "word": "酒で失敗するのは若い頃ならまだしも, 大人になってからなら見苦しいだけだ。",
        "mean": "술로 실패하는 것은 젊었을 때라면 몰라도 어른이 되고 나면 볼썽사나울 뿐이다."
      },
      {
        "answer": "ならまだしも",
        "word": "長年付き合っていた人ならまだしも, ネットで出会って１ヶ月の人と結婚するなんて信じられないと思う。",
        "mean": "오랫동안 사귀었던 사람이라면 몰라도 인터넷에서 만난 지 한 달 된 사람과 결혼한다는 게 믿기지 않을 것 같아."
      },
      {
        "answer": "ならまだしも",
        "word": "その人が誰かに迷惑をかけているならまだしも, そうではないならわざわざ非難する必要もないだろう。",
        "mean": "그 사람이 누군가에게 폐를 끼치고 있다면 몰라도 그렇지 않다면 굳이 비난할 필요도 없을 것이다."
      },
      {
        "answer": "ならともかく",
        "word": "寿命で死ぬならともかく, 殺されるのだけは嫌だ。",
        "mean": "수명으로 죽는다면 몰라도 죽임당하는 것 만큼은 싫다."
      },
      {
        "answer": "ならともかく",
        "word": "子供ならともかく, 大人になって規律を守れないやつは問題外だ。",
        "mean": "어린애라면 몰라도 어른이 되어 규율을 지키지 못하는 놈은 문제 밖이다."
      },
      {
        "answer": "ならともかく",
        "word": "誕生日ならともかく, まだ結婚してない俺には, 結婚記念日の重要性がイマイチ理解できない。",
        "mean": "생일이라면 몰라도 아직 결혼하지 않은 나는 결혼기념일의 중요성을 별로 이해할 수 없어."
      },
      {
        "answer": "ならともかく",
        "word": "寒さならともかく暑さはホント苦手だ。",
        "mean": "추위라면 몰라도 더위는 정말 질색이다."
      },
      {
        "answer": "ならまだしも",
        "word": "電子タバコならまだしも, 子供いる身からすると歩きタバコはほんとにやめて欲しいです。",
        "mean": "전자담배라면 몰라도 아이가 있는 몸으로 볼 때 걸어다니는 담배는 정말 끊었으면 합니다."
      },
      {
        "answer": "ならまだしも",
        "word": "一度ならまだしも, 何回も注意されて恥ずかしくないのか。",
        "mean": "한 번이라면 몰라도 몇 번이고 주의를 받아서 부끄럽지 않은가."
      },
      {
        "answer": "ならまだしも",
        "word": "アニメならまだしも, こんな完璧な女性なんて現実に存在するわけないじゃん。",
        "mean": "애니메이션이라면 몰라도 이런 완벽한 여성이 현실에 존재할 리가 없잖아."
      },
      {
        "answer": "ならまだしも",
        "word": "欲しかったものを買うだけならまだしも, ついでの他のものも欲しくなって予算オーバー。",
        "mean": "갖고 싶었던 것을 사는 것 뿐이라면 몰라도, 내친김에 다른 것도 갖고 싶어져서 예산 오버."
      }
    ]
  },
  {
    "id": 39,
    "grammar": "にかこつけて",
    "means": "~을 구실로\n~을 핑계삼아",
    "description": "かこつける (핑계하다, 구실삼다)에서 파생된 문법\n\nを口実に 로도 사용된다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にかこつけて",
        "word": "人の誕生日にかこつけてケーキをたらふく食べる。",
        "mean": "남의 생일을 핑계삼아 케이크를 실컷 먹다."
      },
      {
        "answer": "にかこつけて",
        "word": "暴動にかこつけて店から金品を盗み取る。",
        "mean": "폭동을 핑계삼아 가게에서 금품을 훔치다."
      },
      {
        "answer": "にかこつけて",
        "word": "出張にかこつけて観光を楽しんできた。",
        "mean": "출장을 핑계삼아 관광을 즐기고 왔다."
      },
      {
        "answer": "にかこつけて",
        "word": "性差にかこつけて不当な権利を主張する。",
        "mean": "성차를 핑계삼아 부당한 권리를 주장하다."
      },
      {
        "answer": "にかこつけて",
        "word": "妻に内緒で, いつも出張にかこつけて各地の温泉旅館を巡っている。",
        "mean": "아내 몰래 출장을 핑계삼아 각지의 온천여관을 돌아다니고 있다."
      },
      {
        "answer": "にかこつけて",
        "word": "病気にかこつけて授業を欠席し, 家でずっとゲームしていた。",
        "mean": "병을 핑계로 수업에 결석하고 집에서 계속 게임하고 있었다."
      },
      {
        "answer": "にかこつけて",
        "word": "あの男は酒の勢いにかこつけて, やたらと触ってくるから気をつけて。",
        "mean": "저 남자는 술기운을 핑계삼아 마구 만지고 오니까 조심해."
      },
      {
        "answer": "にかこつけて",
        "word": "寒さにかこつけて欲しかった服をたくさん買った。",
        "mean": "추위를 핑계삼아 갖고 싶었던 옷을 많이 샀다."
      },
      {
        "answer": "を口実にして",
        "word": "緊急事態宣言を口実にしてデートの回数を減らし, 徐々にフェードアウトして自然消滅させたい。",
        "mean": "긴급사태 선포를 핑계삼아 데이트 횟수를 줄이고 서서히 페이드아웃해 자연 소멸시키고 싶다."
      }
    ]
  },
  {
    "id": 40,
    "grammar": "に越したことはない",
    "means": "~보다 나은 것은 없다\n~하는 편이 좋다\n~하는 것이 제일이다",
    "description":
        "생각할 수 있는 모든 방법 중에서 비교적 제일 좋음을 나타내는 표현\n\n가장 좋다는 것을 적극적으로 평가 하는 것보단 가능하면 이 방법이 좋다는 것을 소극적으로 평가할 때가 많다.",
    "connectionWays":
        "1. 동사 기본형 / ない형 + に越したことはない\n2. い형용사 사전형 + に越したことはない\n3. な형용사 어간 + である + の + に越したことはない\n4. 명사 + (である + の +) に越したことはない\n",
    "examples": [
      {
        "answer": "に越したことはない",
        "word": "健康のためには運動するに越したことはないが, 習慣化するのが難しい。",
        "mean": "건강을 위해서는 운동하는 것보다 더 좋은 것은 없지만 습관화하기가 어렵다."
      },
      {
        "answer": "に越したことはない",
        "word": "家まで近いからよく通ってるけど, この道は夜一人で歩かないに越したことはない。",
        "mean": "집까지 가까워서 자주 다니는데 이 길은 밤에 혼자 걷지 않는 편이 좋다."
      },
      {
        "answer": "に越したことはない",
        "word": "結婚相手はと聞かれれば, 当然金持ちであるに越したことはない。",
        "mean": "결혼 상대는 ? 라고 질문 받으면 당연히 부자인게 제일이다."
      },
      {
        "answer": "に越したことはない",
        "word": "たとえわずかでも, 宿題は早めに終わらせるに越したことはない。",
        "mean": "비록 얼마 되지 않더라도 숙제는 일찍 끝내는 것이 제일이다."
      },
      {
        "answer": "に越したことはないだろう",
        "word": "未来の選択肢は多いに越したことはないだろう。",
        "mean": "미래의 선택지는 많은 것보다 더 좋을 수 없을 것이다."
      },
      {
        "answer": "に越したことはない",
        "word": "お客様とのトラブルは無いに越したことはない。",
        "mean": "고객과의 트러블은 없는 것보다 더 좋은 것은 없다."
      },
      {
        "answer": "に越したことはない",
        "word": "何をされるか分からないので, 用心するに越したことはない。",
        "mean": "무엇을 하실지 모르기 때문에 조심하는 것보다 더 좋은 것은 없다."
      },
      {
        "answer": "であるのに越したことはない",
        "word": "パソコンは高性能であるのに越したことはない。",
        "mean": "PC는 고성능인 것이 제일이다."
      },
      {
        "answer": "に越したことはない",
        "word": "自分の好きな事をして生きていけるのならそれに越したことはない。",
        "mean": "내가 좋아하는 일을 하고 살 수 있다면 그보다 더 좋을 것이 없다."
      },
      {
        "answer": "に越したことはない",
        "word": "いつ故障するか分からないのだから, 定期的にバックアップを取るなどの備えは多いに越したことはない。",
        "mean": "언제 고장날지 모르니 정기적으로 백업을 하는 등의 대비는 더없이 좋은 것은 없다."
      }
    ]
  },
  {
    "id": 41,
    "grammar": "に足りない",
    "means": "~할 가치가 없다",
    "description":
        "주로 [信頼する, 信じる, 信用する, 恐れる, 取る] 등 동사와 함께 사용된다\n\nに足る, に足りる : 할 만하다\n\nに足らない, に足りない : ~할 가치가 없다",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "に足らない",
        "word": "根拠が乏しく信頼するに足らない。",
        "mean": "근거가 부족하고 신뢰할 가치가 없다"
      },
      {"answer": "に足らない話だ", "word": "それは取るに足らない話だ。", "mean": "그것은 하찮은 이야기다."},
      {
        "answer": "に足らない",
        "word": "3人いれば何事も恐れるに足らない。",
        "mean": "셋이 있으면 무슨 일이든 두려워할 가치가 없다."
      },
      {"answer": "に足る人だ", "word": "彼は信頼に足る人だ。", "mean": "그는 신뢰할 만한 사람이다."},
      {
        "answer": "にたる",
        "word": "私の考えを変えるにたる意見はありませんでしたので, この考えは今のところ変えるつもりはありません。",
        "mean": "제 생각을 바꿀만한 의견은 없었기 때문에 이 생각은 현재로서는 바꿀 생각이 없습니다."
      },
      {
        "answer": "に足りる",
        "word": "大きな口を叩くに足りるだけのものが今の自分にはない。",
        "mean": "큰소리칠 만한 것이 지금의 자신에게는 없다."
      },
      {
        "answer": "にたる人",
        "word": "彼女が一緒に働くにあたって信用にたる人物かどうかを面接で見極める。",
        "mean": "그녀가 함께 일하는 데 있어서 믿을 만한 인물인지 면접으로 판별한다."
      },
      {
        "answer": "にたる",
        "word": "世間から同情されるにたる理由があるならやり返せ。",
        "mean": "세상의 동정을 받을 만한 이유가 있다면 다시 시작하라."
      },
      {
        "answer": "にたる",
        "word": "生涯を預けるにたる伴侶が今目の前にいる。",
        "mean": "평생을 맡길 반려자가 지금 눈앞에 있다."
      },
      {"answer": "にたる", "word": "彼は信じるにたる人物だ。", "mean": "그는 믿을 만한 인물이다."},
      {
        "answer": "にたる",
        "word": "新兵器はまだまだ実用に足りない。",
        "mean": "신무기는 아직 실용에 부족하다."
      },
      {
        "answer": "に足りる",
        "word": "なぜ人は生きるのか。その答えは知るに足りることである。",
        "mean": "왜 사람은 사는가.그 대답은 알 만하다."
      },
      {
        "answer": "に足りる",
        "word": "尿検査に足りる分の尿を出せる気がしない。",
        "mean": "소변검사에 충분한 소변을 볼 수 있을 것 같지 않다."
      },
      {
        "answer": "にたる",
        "word": "死んだとき忘れられたくなかったら, 読まれるにたる物を書くか, 書かれるにたることをしろ。",
        "mean": "죽었을 때 잊혀지기 싫으면 읽힐 만한 것을 쓰거나 쓰여야 한다."
      }
    ]
  },
  {
    "id": 42,
    "grammar": "にとどまらず",
    "means": "~에 그치지 않고",
    "description": "시간이나 장소 등 범위를 표현하는 명사에 접속한다.\n\n그 범위 외에도 영향이 미친다는 것을 표현한다.",
    "connectionWays": "명사 + (だけ / のみ)\n동사 보통형 + (だけ)\nい형용사\nな형용사 어간 + な / である",
    "examples": [
      {
        "answer": "にとどまらず",
        "word": "彼女はアイドル活動だけにとどまらず, 作家活動までしている。",
        "mean": "그는 아이돌 활동에만 그치지 않고 작가 활동까지 하고 있다."
      },
      {
        "answer": "にとどまらず",
        "word": "癌の転移は肺にとどまらず, 全身に及んでいる。",
        "mean": "암 전이는 폐에 그치지 않고 온몸에 미치고 있다."
      },
      {
        "answer": "にとどまらず",
        "word": "津波の被害は海岸部だけにとどまらず, 内陸の広い地域にまで達した。",
        "mean": "쓰나미 피해는 해안가에만 그치지 않고 내륙 넓은 지역에까지 이르렀다."
      },
      {
        "answer": "にとどまらず",
        "word": "不審な飛行物体の目撃情報は, 市内にとどまらず, 数十キロ離れた街でも確認された。",
        "mean": "수상한 비행물체 목격 정보는 시내에 머물지 않고 수십 km 떨어진 거리에서도 확인됐다."
      },
      {
        "answer": "だけにとどまらず",
        "word": "雨だけにとどまらず, 雷まで鳴り始めている。",
        "mean": "비에만 그치지 않고 천둥까지 치기 시작했다."
      },
      {
        "answer": "にとどまらず",
        "word": "彼はアメリカ国内にとどまらず, 世界中で評価されている。",
        "mean": "그는 미국 내에 머무르지 않고 전 세계에서 평가받고 있다."
      },
      {
        "answer": "だけにとどまらず",
        "word": "彼女は可愛いだけにとどまらず, 愛嬌もある。",
        "mean": "그녀는 귀여운 데 그치지 않고 애교도 있다."
      },
      {
        "answer": "だけにとどまらず",
        "word": "夢や目標は思うだけにとどまらず, 口に出して言ってみると良い。",
        "mean": "꿈이나 목표는 생각에만 머물지 말고 입 밖에 내어 말하면 좋다."
      }
    ]
  },
  {
    "id": 44,
    "grammar": "のなんのって",
    "means": "매우~하다",
    "description":
        "\"말할 수 없이 심하다\", \"훌륭하다\" 등 정도를 강조하는 표현\n\n[おいしいのなんのって] 는 [とてもおいしい] 와 같은 말\n\n단지 강조하는 것 뿐아니라 말하는 사람의 놀라움을 표현",
    "connectionWays":
        "い형용사 보통형 + のなんのって\nな형용사 어간 + な + のなんのって\n동사 보통형 + のなんのって",
    "examples": [
      {
        "answer": "のなんのって",
        "word": "学校でスマホ見てたら気配もなく先生が後ろにいて焦ったのなんのって…",
        "mean": "학교에서 스마트폰을 보는데 기척도 없이 선생님이 뒤에 계셔서 매우 초조했다며.."
      },
      {"answer": "のなんのって", "word": "日焼け後が痛いのなんのって。", "mean": "선탠 후에 매우 아프다며."},
      {
        "answer": "のなんのって",
        "word": "今住んでるアパート, 直射日光で部屋が暑いのなんのって。",
        "mean": "지금 살고 있는 아파트, 직사광선 때문에 방이 매우 덥다며."
      },
      {
        "answer": "のなんのって",
        "word": "13年ぶりくらいにタバコ吸ったら, 美味しいのなんのって！",
        "mean": "13년 만에 담배 피웠는데 매우 맛있다며 !"
      },
      {
        "answer": "のなんのって",
        "word": "運動全くしてないけど食生活変えただけで体重が減るのなんのって。",
        "mean": "운동 하나도 안 했는데 식생활 바꾸는 것만으로 매우 살이 빠졌어!"
      },
      {
        "answer": "のなんのって",
        "word": "うちの猫たち昼でも真夜中でも大運動会。寝てると顔の上を通過され, 爪が痛いのなんのって。",
        "mean": "우리 고양이들 낮에도 한밤중에도 대운동회.자고 있으면 얼굴 위를 통과해서 손톱이 매우 아프다며!"
      },
      {
        "answer": "のなんのと",
        "word": "調理場はガス使うから暑いのなんのと。",
        "mean": "조리장은 가스를 쓰니까 매우 덥다며."
      },
      {
        "answer": "のなんのと",
        "word": "10年ぶりに初恋の人に会って驚いたのなんのと。",
        "mean": "10년 만에 첫사랑을 만나서 매우 놀랐다며."
      },
      {
        "answer": "のなんのと",
        "word": "彼は音痴過ぎて, 鼻歌でさえ下手くそなのなんのと。",
        "mean": "그는 음치가 너무 심해서 콧노래조차 매우 못 부른다며."
      }
    ]
  },
  {
    "id": 45,
    "grammar": "は言うに及ばず",
    "means": "~은 말할 것도 없고",
    "description": "말할 것도 없고 당연히 ~하다\n\nはいうにおよばず 로 발음한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "は言うに及ばず",
        "word": "彼女は英語は言うに及ばず, ドイツ語とフランス語も話します。",
        "mean": "그녀는 영어는 말할 것도 없고 독일어와 프랑스어도 합니다."
      },
      {
        "answer": "は言うに及ばず",
        "word": "彼女はフランス語は言うに及ばず母国語すらろくに話せない。",
        "mean": "그녀는 프랑스어는 말할 것도 없고 모국어조차 제대로 못한다."
      },
      {
        "answer": "は言うにおよばず",
        "word": "遺族は言うにおよばず, 参列者の大半も K 氏の言葉に涙を流した.",
        "mean": "유족들은 말할 것도 없고 참석자 대부분도 K씨의 말에 눈물을 흘렸다."
      }
    ]
  },
  {
    "id": 46,
    "grammar": "ばかりになっている",
    "means": "~하기만 하면 된다",
    "connectionWays": "동사 사전형 접속",
    "examples": [
      {
        "answer": "ばかりになっている",
        "word": "準備が整い, これからお客様を待つばかりになっている",
        "mean": "준비가 되어 이제부터 손님을 기다리기만 하면 된다."
      },
      {
        "answer": "ばかりになっている",
        "word": "旅行に行くばかりになっている",
        "mean": "여행을 가기만 하면 된다"
      },
      {
        "answer": "ばかりになっている",
        "word": "昼ご飯はいつでも食べられるばかりになっている",
        "mean": "점심 밥을 언제라도 먹을 수 있게 다 되어 있다."
      },
      {
        "answer": "ばかりになっている",
        "word": "料理は温めるばかりになっている",
        "mean": "음식은 데우기만 하면 된다."
      }
    ]
  },
  {
    "id": 47,
    "grammar": "(가정법) + きりがない",
    "means": "~하면 한이 없다",
    "description":
        "그 동작을 한 번 하면 그 이후로 끝없이 계속해서 행하게 된다, 계속 행하게 된다라는 것을 나타낸다\n\n단순히 [きりがない] 또는 동사て형에 [てきりがない] 에 접속 하기도 하는데, 이때는 \"한도가 없다\" 를 나타낸다",
    "connectionWays": "동사 가정법 (と, ば, たら)",
    "examples": [
      {
        "answer": "たらきりがない",
        "word": "彼の悪いところを挙げたらきりがない。",
        "mean": "그의 나쁜 점을 들면 끝이 없다."
      },
      {
        "answer": "たらきりがない",
        "word": "彼女との思い出は語り出したらきりがない。",
        "mean": "그녀와의 추억은 말하기 시작하면 끝이 없다."
      },
      {
        "answer": "たらきりがない",
        "word": "人の生きる意味について, 考え出したらきりがない。",
        "mean": "사람이 사는 의미에 대해 생각해 내기 시작하면 끝이 없다."
      },
      {
        "answer": "たらきりがない",
        "word": "悩み出したらきりがないので, 途中で吹っ切れることも重要だ。",
        "mean": "고민하기 시작하면 끝이 없기 때문에 중간에 털어내는 것도 중요하다."
      },
      {
        "answer": "ればきりがない",
        "word": "結婚相手の条件を挙げればきりがない。",
        "mean": "결혼 상대의 조건을 들면 끝이 없다."
      },
      {
        "answer": "ばきりがない",
        "word": "職場への不満を探せばきりがない。",
        "mean": "직장에 대한 불만을 찾으면 끝이 없다."
      },
      {
        "answer": "きりがないから",
        "word": "人間の欲望にはきりがないから, 現状で満足できなければ幸せにはなれない。",
        "mean": "인간의 욕망은 끝이 없기 때문에 현 상황에서 만족하지 못하면 행복해질 수 없다."
      },
      {
        "answer": "てきりがない",
        "word": "おもちゃを片付けても片付けても, しばらくするとまた散らかされてきりがない。",
        "mean": "장난감을 치워도 치워도 한참 후면 또 어지러워서 끝이 없다."
      }
    ]
  },
  {
    "id": 48,
    "grammar": "べくもない",
    "means": "~할 방도가 없다\n~할 수 없다\n~할 여지도 없다",
    "description":
        "불가능을 나타내는 표현\n\n실제는 그렇게 되는 것을 바라지만, 상황적으로 불가능한 것을 나타낸다\n\nする는 すべくない 혹은 するべくない 로 표현가능하다",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "べくもない",
        "word": "痩せたいけど, この体重では部分痩せなど望むべくもない。",
        "mean": "살을 빼고 싶지만, 이 체중으로는 부분 살을 빼는 것은 바랄 수 없다."
      },
      {
        "answer": "べくもない",
        "word": "文化財を後世まで保存する価値があることは疑うべくもない。",
        "mean": "문화재를 후세까지 보존할 가치가 있음은 의심할 여지도 없다."
      },
      {
        "answer": "べくもない",
        "word": "家で聴くのと生の演奏では比べるべくもない。",
        "mean": "집에서 듣는 것과 라이브 연주로는 비교할 수 없다."
      },
      {
        "answer": "べくもない",
        "word": "素人が何人集まろうとも, プロに適うべくもない。",
        "mean": "아마추어가 몇 명 모인다 해도 프로에 적합할 수 없다."
      },
      {
        "answer": "べくもなく",
        "word": "昔は将来のことを考えるべくもなく, 今を精一杯生きるだけだった。",
        "mean": "옛날에는 장래를 생각할 겨를도 없이 지금을 힘껏 살 뿐이었다."
      },
      {
        "answer": "べくもない",
        "word": "味は本物と比べるべくもないけど, 食感はかなり蟹に近いと思った。",
        "mean": "맛은 진짜랑 비교할 수 없지만 식감은 꽤 게에 가깝다고 생각했어."
      },
      {
        "answer": "べくもない",
        "word": "裏でどのようなやり取りがされていたかは私たちには知るべくもない。",
        "mean": "뒤에서 어떤 거래가 오갔는지는 우리가 알 길이 없다."
      },
      {
        "answer": "べくもない",
        "word": "職員の給料は子供の安全と天秤にかけるべくもない。",
        "mean": "직원 월급은 아이들의 안전을 저울질할 수도 없다."
      }
    ]
  },
  {
    "id": 49,
    "grammar": "ほど(のこと)ではない",
    "means": "~할 정도 인 것은 아니다",
    "description": "대단한 것이 아니기 때문에 ~할 필요는 없다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "ほどのことではない",
        "word": "この件は, 問題として取り上げるほどのことではない。",
        "mean": "이 건은 문제 삼을 정도 것은 아니다."
      },
      {
        "answer": "ほどのことではない",
        "word": "ちょっと転んで擦りむいただけだし, 病院へ行くほどのことではないよ。",
        "mean": "조금 넘어져서 긁힌 것 뿐이지 병원에 갈 정도는 아니야."
      },
      {
        "answer": "ほどのことではない",
        "word": "冗談なんだし, 怒るほどのことではないと思うけど。",
        "mean": "농담이고 화낼 정도는 아닌 것 같은데."
      },
      {
        "answer": "ほどのことではない",
        "word": "この問題は初級の内容だし, 説明するほどのことではないよね？",
        "mean": "이 문제는 초급 내용이지 설명할 만한 건 아니지?"
      },
      {
        "answer": "ほどのことではない",
        "word": "そんなに真剣に悩むほどのことではない。",
        "mean": "그렇게 진지하게 고민할 만한 일은 아니야."
      },
      {"answer": "ほどのことではない", "word": "騒ぐほどのことではない", "mean": "떠들어댈 정도의 일은 아니다"}
    ]
  },
  {
    "id": 50,
    "grammar": "までして /~まで(に)",
    "means": "~까지 해서 /~까지",
    "description":
        "최대의 희생이나 대가를 치러서 어떤 목표를 달성하는 것을 표현.\n\n목표를 달성하기 위해서는 수단을 가리지 않는 뉘양스가 있음.",
    "connectionWays": "명사 + までして(に)\n동사て형 + てして",
    "examples": [
      {
        "answer": "までして",
        "word": "どれだけ欲しくても, 借金までして買いたいとは思わない。",
        "mean": "아무리 갖고 싶어도 빚까지 내서 사고 싶은 생각은 없다."
      },
      {
        "answer": "してまで",
        "word": "どれだけ欲しくても, 借金してまで買いたいとは思わない。",
        "mean": "아무리 갖고 싶어도 빚을 내서까지 사고 싶은 생각은 없다."
      },
      {
        "answer": "てまで",
        "word": "直接本人に聞いてまで知りたいわけじゃない。",
        "mean": "직접 본인한테 물어보면서까지 알고 싶은 건 아니야."
      },
      {
        "answer": "並んでまで",
        "word": "わざわざ１時間も行列に並んでまで食べたくない。",
        "mean": "일부러 1시간이나 줄을 서서까지 해서 먹고 싶지 않아."
      },
      {
        "answer": "までして",
        "word": "なぜそうまでして嘘をつくのだろうか。",
        "mean": "왜 그렇게까지 해서 거짓말을 할까."
      },
      {
        "answer": "までして",
        "word": "結婚のために夜勤までして貯めたお金を使い込まれた。",
        "mean": "결혼하느라 야근까지 해서 모은 돈을 탕진했다."
      },
      {
        "answer": "までして",
        "word": "徹夜までして追い込んだのに, 試験では力を出し切れなかった。",
        "mean": "밤을 새며 까지 몰아붙였는데도 시험에서는 힘을 다 낼 수가 없었다."
      },
      {
        "answer": "してまで",
        "word": "徹夜してまで追い込んだのに, 試験では力を出し切れなかった。",
        "mean": "밤을 새며 까지 몰아붙였는데도 시험에서는 힘을 다 낼 수가 없었다."
      }
    ]
  },
  {
    "id": 51,
    "grammar": "も / をかえりみず",
    "means": "~은 / 도 생각하지 않고\n~은 / 도 무릅쓰고\n~은 / 도 아랑곳하지 않고",
    "description":
        "위험한 일에 맞서 나가는 것, 위험성을 개의치 않는 것을 나타낸다.\n뒷 내용은 좋은 내용, 나쁜 내용 둘 다 가능.\n\n顧みず 가 문법화 된 것",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {"answer": "を顧みず", "word": "危険を顧みず救助へ向かう。", "mean": "위험을 무릅쓰고 구조하러 가다."},
      {
        "answer": "も顧みず",
        "word": "自分の命も顧みず戦場へ向かった。",
        "mean": "자신의 목숨도 아랑곳하지 않고 전쟁터로 향했다."
      },
      {
        "answer": "を顧みず",
        "word": "医者の忠告を顧みず暴飲暴食を繰り返す。",
        "mean": "의사의 충고를 아랑곳하지 않고 폭음 폭식을 되풀이하다."
      },
      {
        "answer": "も顧みず",
        "word": "体調も顧みずがむしゃらに働く。",
        "mean": "몸 상태도 생각하지 않고 무작정 일하다."
      },
      {
        "answer": "も顧みず",
        "word": "自らの危険も顧みず, 見知らぬ親子の命を救おうとした。",
        "mean": "자신의 위험도 무릅쓰고 낯선 부자의 목숨을 구하려 했다."
      },
      {
        "answer": "も顧みず",
        "word": "彼は相手の気持ちも顧みず, 一方的に連絡先を教えたりする変な人だ。",
        "mean": "그는 상대방의 마음도 아랑곳하지 않고 일방적으로 연락처를 알려주곤 하는 이상한 사람이다."
      },
      {
        "answer": "も顧みずに",
        "word": "街中で周りの迷惑も顧みずに大声で笑ってる。",
        "mean": "거리에서 주위의 민폐도 아랑곳하지 않고 큰 소리로 웃고 있다."
      },
      {
        "answer": "も顧みずに",
        "word": "消防士の自分の危険も顧みずに任務を遂行するその姿は私の憧れだった。",
        "mean": "소방관인 자신의 위험도 무릅쓰고 임무를 수행하는 그 모습은 나의 동경이었다."
      }
    ]
  },
  {
    "id": 52,
    "grammar": "もがな",
    "means": "~해서는 안 될",
    "description": "주로 관용적으로 쓰이는 경우가 많다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "言わずもがな",
        "word": "言わずもがなのことを言ってしまった。",
        "mean": "말 해서는 안될 소리를 해 버렸다."
      },
      {"answer": "言わずもがな", "word": "言わずもがなだ。", "mean": "말 해서는 안된다."},
      {"answer": "言わずもがなだ", "word": "そんなことは言わずもがなだ。", "mean": "그런 말은 해서는 안된다."},
      {
        "answer": "あらずもがな",
        "word": "そんなことはあらずもがなと思う",
        "mean": "그런 일은 불필요한 것이라고 생각한다"
      },
      {"answer": "あらずもがな", "word": "あんな奴はあらずもがなだ", "mean": "저런 놈은 필요 없는 놈이다"}
    ]
  },
  {
    "id": 53,
    "grammar": "もしない / はしない",
    "means": "~하지도 않다. /~하지는 않다.",
    "description": "전혀 ~ 하지 않다\n\n화자의 불만을 표현한다.\n\n문어체로 ~もせず 로 사용한다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "もしない",
        "word": "[僕が悪かった]と考えているのに, 彼はこっちを見もしない。ますます腹が立って来た。",
        "mean": "[내가 잘못했다]고 생각하고 있었는데 그는 이쪽을 쳐다보지도 않는다.점점 화가 나기 시작했다."
      },
      {
        "answer": "もしない",
        "word": "調べもしないで, [先生, わからない]はダメです。まずは自分で調べましょう。",
        "mean": "알아보지도 않고 [선생님, 모르겠어] 라고 하면 안 돼요.우선 스스로 알아봅시다."
      },
      {
        "answer": "もしない",
        "word": "彼はスマホばかり触って, 私の話を聞きもしない。",
        "mean": "그는 스마트폰만 만지고 내 말을 듣지도 않는다."
      },
      {
        "answer": "もしない",
        "word": "食べもしないで, 美味しかどうかなんてわからない。",
        "mean": "먹지도 않고 맛있는지 없는지 모르겠어"
      },
      {
        "answer": "もしません",
        "word": "あの日の出来事は忘れもしません。",
        "mean": "그날 있었던 일은 잊지도 않아요."
      },
      {
        "answer": "もしなかった",
        "word": "こんな結果になるなんて, 思いもしなかった。",
        "mean": "이런 결과가 나오리라고는 생각지도 못했다."
      },
      {
        "answer": "もしない",
        "word": "プレゼントをあげたり, 優しくしたりしているのに彼女は僕に振り向きもしない。",
        "mean": "선물을 주고 상냥하게 대하는데 그녀는 나에게 돌아보지도 않는다."
      },
      {
        "answer": "もせず",
        "word": "トムさんは私の部屋に入ると, 何も言いもせず, 勝手に冷蔵庫を開けたり, エアコンをつけたりして, ちょっとムカついた。",
        "mean": "톰씨는 내 방에 들어오면 아무 말도 하지 않고 마음대로 냉장고를 열거나 에어컨을 켜서 약간 짜증이 났다."
      },
      {
        "answer": "もしない",
        "word": "できもしないのに, [任せてください！]と言う社員は正直迷惑だ。",
        "mean": "할 수도 없는데 [맡겨주세요!]라고 말하는 직원은 솔직히 민폐다."
      }
    ]
  },
  {
    "id": 54,
    "grammar": "も同然だ",
    "means": "~한것이나 다름없다",
    "description": "실제는 다르지만, 성질이나 상태로 보면 거의 같다는 것을 표현한다\n\nもどうぜんだ 라고 발음한다.",
    "connectionWays": "동사 과거형 (+の) + 同然だ\n명사 + (も) + 同然だ",
    "examples": [
      {
        "answer": "同然に",
        "word": "実の娘同然に育ててくれた母に感謝している。",
        "mean": "친딸이나 다름없이 키워준 엄마에게 감사하다."
      },
      {
        "answer": "も同然だろう",
        "word": "討論で何も言わないのはいないも同然だろう。",
        "mean": "토론에서 아무 말도 하지 않는 것은 없는 것이나 마찬가지일 것이다."
      },
      {
        "answer": "も同然だ",
        "word": "目標がないなら死んだも同然だ。",
        "mean": "목표가 없다면 죽은 것이나 다름없다."
      },
      {
        "answer": "どうぜんだ",
        "word": "彼女は自殺ではなく, 周囲の人に殺されたもどうぜんだ。",
        "mean": "그녀는 자살이 아니라 주위 사람들에게 살해당한 것이나 다름없다."
      },
      {
        "answer": "も同然の",
        "word": "相手チームに怪我人が多く, 我々が勝ったも同然の状況だ。",
        "mean": "상대팀에 부상자가 많아 우리가 이긴 것이나 다름없는 상황이다."
      },
      {
        "answer": "も同然だ",
        "word": "引きこもりは人生終わったも同然だ。",
        "mean": "은둔형 외톨이는 인생 끝난 것이나 다름없다."
      },
      {
        "answer": "同然です",
        "word": "少しばかり経験があるものの, 初心者同然です。",
        "mean": "조금 경험이 있지만 초보자나 다름없어요."
      },
      {
        "answer": "も同然だ",
        "word": "この薬を飲みさえすれば治ったも同然だ。",
        "mean": "이 약을 먹기만 하면 나은 거나 다름없다."
      }
    ]
  },
  {
    "id": 55,
    "grammar": "~といい ~といい",
    "means": "~도 ~도,\n~로 보나 ~로 보나",
    "description":
        "예시로 2두개를 들어, 그것들 두개에 대해서 주관적인 평가를 나타내는 표현\n\n예시 든 2개의 예시 예외의 존재도 암시함.\n\n좋은 평가든 나쁜 평가든 가능.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "といい",
        "word": "性能といい, デザインといい, この機種は素晴らしい。",
        "mean": "능력이라든가 디자인이라든가, 이 기종은 훌륭하다."
      },
      {
        "answer": "といい",
        "word": "部下のＡといい, Ｂといい, 私の指示を全く聞いてくれない。",
        "mean": "부하 A라든가, B라든가, 내 지시를 전혀 들어주지 않는다."
      },
      {
        "answer": "といい",
        "word": "政治家といい, 官僚といい, 最近汚職が多くてがっかりだ。",
        "mean": "정치인이라든가 관료라든가 요즘 부패가 많아서 실망이다."
      },
      {
        "answer": "といい",
        "word": "あの店員は服装といい, 態度といい, 接客態度が全くダメだ。",
        "mean": "저 점원은 복장도 태도도 접객 태도가 전혀 안 돼."
      },
      {
        "answer": "といい",
        "word": "彼は食べ方といい, 飲み方といい, 汚すぎて一緒に食事してると気分が悪くなる。",
        "mean": "그는 먹는 것으로 보나 마시는 것으로 보나 너무 지저분해서 같이 식사하면 기분이 나빠진다."
      },
      {
        "answer": "といい",
        "word": "最近はＡＩといい, ５Ｇといい, 技術の進歩が著しい。",
        "mean": "요즘은 AI이나 5G이나 해서 기술의 진보가 두드러진다."
      },
      {
        "answer": "といい",
        "word": "私の彼女は外見といい, 中身といい, 文句のつけようがない。",
        "mean": "내 여자친구는 외모으로 보나 인품으로 보나 뭐라 할 말이 없어."
      },
      {
        "answer": "といい",
        "word": "髪型といい, 髭といい, もうちょっと整えたら彼ももっとモテるようになると思う。",
        "mean": "헤어스타일도 수염도 좀 더 다듬으면 그도 더 인기가 많아질 것 같아."
      },
      {
        "answer": "といい",
        "word": "歌い方といい, 声といい, 私のタイプだ。",
        "mean": "창법도 그렇고 목소리도 그렇고 내 타입이다."
      },
      {
        "answer": "といい",
        "word": "見た目といい性格といい全てにおいて好き。",
        "mean": "보기으로 보나 성격으로 보나 모든 면이 좋아."
      }
    ]
  },
  {
    "id": 56,
    "grammar": "がてら",
    "means": "~하는 김에\n~하는 겸",
    "description": "行く, 歩く, 散歩する 등 이동 동사와 자주 사용,\n\nついでに 보다 딱딱한 표현",
    "connectionWays": "명사에 직접 접속\n동사 ます형",
    "examples": [
      {"answer": "がてら", "word": "勉強がてら音楽を聴く。", "mean": "공부 겸 음악을 듣다."},
      {"answer": "がてら", "word": "買い物がてら友人の家に立ち寄る。", "mean": "쇼핑 삼아 친구 집에 들르다."},
      {"answer": "がてら", "word": "帰省がてら故郷を満喫する。", "mean": "귀성길에 고향을 만끽하다."},
      {
        "answer": "がてら",
        "word": "週末にはドライブがてら, 新しい水族館に行ってみようと思う。",
        "mean": "주말에는 드라이브 겸 새로운 수족관에 가보려고 해."
      },
      {
        "answer": "がてら",
        "word": "お仕事がてら, 東京観光にいらして下さい。",
        "mean": "일 할 겸 도쿄 관광하러 오세요."
      },
      {"answer": "がてら", "word": "散歩がてら買い物してきました。", "mean": "산책겸 쇼핑하고 왔어요."},
      {"answer": "がてら", "word": "ダイエットがてら食費切り詰める。", "mean": "다이어트 겸 식비를 줄이다."},
      {"answer": "がてら", "word": "休憩がてら間食を取る。", "mean": "휴식 하는 김에 간식을 먹다."},
      {"answer": "がてら", "word": "シャワーしがてらお風呂掃除する。", "mean": "샤워할 겸 목욕 청소하다."},
      {
        "answer": "がてら",
        "word": "運動がてら電車使わずに自転車で通勤する。",
        "mean": "운동 삼아 전철을 사용하지 않고 자전거로 통근하다."
      },
      {
        "answer": "がてら",
        "word": "換気がてら窓を開けて外の空気を吸う。",
        "mean": "환기 겸 창문을 열고 바깥 공기를 마시다."
      },
      {"answer": "がてら", "word": "気分転換がてら豪遊する。", "mean": "기분 전환 겸 호유하다."}
    ]
  },
  {
    "id": 57,
    "grammar": "とあって",
    "means": "~이라서",
    "description":
        "특별한 상황이기 때문에 평소와는 다른 현상이 일어나는 것을 나타낼 때 사용.\n\n앞 문장에는 특수한 상황, 뒷 문장에는 그 상황하에서 일어나는 현상을 표현.\n\n객관적이고 사회적인 화제에 대해서 사용.\n개인적인 화제에는 사용하기 어려움.\n\n이미 발생한 일에만 사용 가능.",
    "connectionWays": "명사에 직접 접속\n다양한 동사",
    "examples": [
      {
        "answer": "とあって",
        "word": "ゴールデンウィークとあって, 高速道路は渋滞しているようだ。",
        "mean": "황금연휴이라서 고속도로는 막히는 것 같아."
      },
      {
        "answer": "とあって",
        "word": "韓国から人気のアイドルが来日するとあって, 空港には多くのファンが詰め寄せた。",
        "mean": "한국에서 인기 아이돌이 일본에 온다고 해서 공항에는 많은 팬들이 몰렸다."
      },
      {
        "answer": "とあって",
        "word": "新年とあって, 外は爆竹の音で賑やかだ。",
        "mean": "새해라고 밖은 폭죽 소리로 떠들썩하다."
      },
      {
        "answer": "とあって",
        "word": "今世紀最大の天文ショーとあって, 天文学者のみならず, 世界中の人々が空に注目している。",
        "mean": "금세기 최대 천문쇼이라서 천문학자뿐만 아니라 전 세계인들이 하늘에 주목하고 있다."
      },
      {
        "answer": "とあって",
        "word": "久しぶりの新曲とあって, 世間の注目度が高い。",
        "mean": "오랜만에 신곡이라 세간의 주목도가 높다."
      },
      {
        "answer": "とあって",
        "word": "海の日とあって​, 結構な人が海水浴を楽しんでいます。",
        "mean": "바다의 날이라 꽤 많은 사람들이 해수욕을 즐기고 있습니다."
      },
      {
        "answer": "とあって",
        "word": "京都の祇園は世界的に有名な観光地とあってとても綺麗だ。",
        "mean": "교토의 기온은 세계적으로 유명한 관광지여서 매우 아름답다."
      },
      {
        "answer": "とあって",
        "word": "ここは果物屋さんの直営店とあって, 取れたての果物がたくさん置いてある。",
        "mean": "여기는 과일가게 직영점이라 갓 딴 과일들이 많이 놓여있어."
      }
    ]
  },
  {
    "id": 58,
    "grammar": "てからというもの",
    "means": "~하고나서 (줄곧)\n~하고부터 (줄곧)\n~한 이후로 (줄곧)",
    "description":
        "어떤 동작이 계기가 되어 그 뒤에 어떠한 큰 변화가 생기는 것을 나타내는 표현.\n\n[それからというもの, そこからというもの(그 뒤로 줄곧)] 와 같이 관용적으로 쓰임.",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "てからというもの",
        "word": "良いライバルができてからというもの, 練習にも熱が入る。",
        "mean": "좋은 경쟁자가 생긴 뒤 (계속) 훈련에도 열이 들어간다."
      },
      {
        "answer": "てからというもの",
        "word": "結婚してからというもの, 趣味に費やす時間が減ってきている。",
        "mean": "결혼하고 나서부터 취미에 소비하는 시간이 줄어들고 있다."
      },
      {
        "answer": "てからというもの",
        "word": "あのホラー映画を見てからというもの, トイレにすら行けなくなった。",
        "mean": "그 공포영화 보고나서 화장실조차 못가게 됐어."
      },
      {
        "answer": "てからというもの",
        "word": "思いきってイメチェンしてからというもの, 知らない人からも褒められるようになった。",
        "mean": "마음껏 이미지를 바꾸고 나서부터 모르는 사람들로부터 칭찬을 받기 시작했다."
      },
      {
        "answer": "てからというもの",
        "word": "就職してからというもの, 社会の厳しさを痛感している。",
        "mean": "취직하고 나서부터 사회의 어려움을 통감하고 있다."
      },
      {
        "answer": "てからというもの",
        "word": "この番組は出演者が変わってからというもの, 本当につまらなくなった。",
        "mean": "이 프로그램은 출연자가 바뀌면서 정말 재미없어졌다."
      },
      {
        "answer": "てからというもの",
        "word": "友達を増やしたいけど社会人になってからというもの, 中々できない。",
        "mean": "친구를 늘리고 싶지만 사회인이 되고 나서는 좀처럼 할 수 없어."
      },
      {
        "answer": "てからというもの",
        "word": "ちょうど４年前にこの女性に出会ってからというもの, 私の人生大きく変わった。",
        "mean": "딱 4년 전에 이 여자를 만난 이후로 내 인생이 많이 바뀌었어."
      },
      {
        "answer": "からというもの",
        "word": "夜勤になってからというもの, 曜日感覚が完全に死んだ。",
        "mean": "야근하고 나서부터 요일감각이 완전히 죽었어."
      },
      {
        "answer": "てからというもの",
        "word": "子育てが始まってからというもの, 外食する機会が極端に減った。",
        "mean": "육아가 시작된 이후 외식할 기회가 극단적으로 줄었다."
      },
      {
        "answer": "てからというもの",
        "word": "転職で東京に来てからというものお友達もできず暇しています。",
        "mean": "이직으로 도쿄에 온 이후로 친구도 없고 한가합니다."
      },
      {
        "answer": "てからというもの",
        "word": "禁煙してからというもの, タバコの臭いがつらい。",
        "mean": "금연하고 나서 담배 낸다새가 괴롭다."
      },
      {
        "answer": "からというもの",
        "word": "元カレと数年ぶりに再会して, それからというもの, 彼のことばかり考えるようになってしまいました。",
        "mean": "전 남자친구와 몇 년 만에 재회하고, 그 이후로 (계속) 그를 생각하게 되어 버렸습니다."
      },
      {
        "answer": "からというもの",
        "word": "された料理に虫が入っていて, そこからというものあの店には一度も行ってない。",
        "mean": "하신 음식에 벌레가 들어가서 그 이후로 (계속) 저 가게는 한 번도 안 가봤어."
      }
    ]
  },
  {
    "id": 59,
    "grammar": "~ずには済まない / ずには済まされない",
    "means": "~반드시 해야 한다\n~하지 않으면 해결되지 않는다",
    "description":
        "일반 상식, 사회 통념, 상황 등을 감안할 때 \"반드시~해야 한다\" 을 나타낸다\n\n[する]는 [せずには済まない] 가 된다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "謝らないではすまない",
        "word": "君が悪いのなら謝らないではすまない。",
        "mean": "네가 잘못한 것이라면 사과 하지 않으면 해결되지 않는다."
      },
      {
        "answer": "せずには済まないですね",
        "word": "こんなものまで頂いたら, 今度お返しせずには済まないですね。",
        "mean": "이런 것까지 받으면 반드시 다음번에 답례 해야겠네요"
      },
      {
        "answer": "せずにはすまなくなるだろう",
        "word": "検査結果によっては手術せずにはすまなくなるだろう。",
        "mean": "검사 결과에 따라서는 반드시 수술을 해야 하겠지."
      },
      {
        "answer": "ずにはすまない",
        "word": "結婚に際しては相手の親に挨拶しに行かずにはすまない。",
        "mean": "결혼할 때는 반드시 상대방 부모에게 인사하러 가야한다."
      },
      {
        "answer": "ずには済まない",
        "word": "国民の命が脅かされている今, 議論ではなくもうやらずには済まない状況だ。",
        "mean": "국민의 생명이 위협받고 있는 지금 논의가 아니라 더 이상 하지 않으면 해결되지 않는 상황이다."
      },
      {
        "answer": "ないでは済まない",
        "word": "多くの人をないがしろにする政治判断。その行為の責任は問わないでは済まない。",
        "mean": "많은 사람을 소홀히 하는 정치 판단, 반드시 그 행위의 책임을 물어야한다."
      },
      {
        "answer": "済まされない",
        "word": "これらの犯罪行為は, 処罰されずには済まされない。",
        "mean": "이들 범죄행위는 처벌 받지 않으면 해결되지 않는다."
      },
      {
        "answer": "ないでは済まされない",
        "word": "この交差点は毎年交通事故による死者が出ているため, その原因を調査しないでは済まされない。",
        "mean": "이 사거리는 매년 교통사고로 인한 사망자가 발생하기 때문에 그 원인을 조사하지 않으면 해결되지 않는다."
      }
    ]
  },
  {
    "id": 60,
    "grammar": "ないまでも",
    "means": "~까지는 아니더라도",
    "description":
        "~정도까지는 아니더라도 그와 비슷한 정도이다\n\n앞 문장의 정도에 달성하지 못하지만, 적어도 뒷 문장의 정도에는 달성하는 것.\n\n또는 적어도 뒷 문장의 정도를 만족시킬 필요가 있다는 것을 표현한다.\n\n앞 문장은 뒷 문장보다 난이도가 높아야함.",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "ないまでも",
        "word": "死に物狂いで頑張れば, 天才の域に辿り着けないまでもそこに近づけるはずだ。",
        "mean": "죽기 살기로 노력하면 천재의 경지에 이르지는 못하더라도 그곳에 가까이 다가갈 수 있을 것이다."
      },
      {
        "answer": "ないまでも",
        "word": "この絵は細部は完璧ではないまでも, 実物の特徴をよく捉えて描けている。",
        "mean": "이 그림은 세부적으로 완벽까지는 않더라도 실물의 특징을 잘 포착해 그렸다."
      },
      {
        "answer": "ないまでも",
        "word": "この案なら全員の賛成は得られないまでも, 過半数の賛成は得られるだろう。",
        "mean": "이 방안이라면 전원의 찬성은 얻지 못하더라도 과반수의 찬성은 얻을 수 있을 것이다."
      },
      {
        "answer": "ないまでも",
        "word": "怪我は完治とは言えないまでも, ほぼ回復してきている。",
        "mean": "부상은 완치라고는 할 수 없지만 거의 회복되고 있다."
      },
      {
        "answer": "ないまでも",
        "word": "相手チームに勝てないまでも, 善戦できるように頑張る。",
        "mean": "상대팀을 이기지 못하더라도 선전할 수 있도록 노력하겠다."
      },
      {
        "answer": "ないまでも",
        "word": "毎日とは言わないまでも, 週１回くらいは掃除したほうがいい。",
        "mean": "매일이라고 말하지 못하지만 주 1회 정도는 청소하는 것이 좋다."
      },
      {
        "answer": "ないまでも",
        "word": "汚職や賄賂は完全に無くせないまでも減らすべきだ。",
        "mean": "부패나 뇌물은 완전히 없앨 수 없더라도 줄여야 한다."
      },
      {
        "answer": "ないまでも",
        "word": "人生は楽しめないまでも苦しまないようにしたい。",
        "mean": "인생은 즐기지 못할지라도 고통받지 않도록 하고 싶다."
      },
      {
        "answer": "ないまでも",
        "word": "土下座をしないまでも, 謝るぐらいはしたらどうですか？",
        "mean": "무릎 꿇지 않더라도 사과 정도는 하는 게 어때요?"
      },
      {
        "answer": "ないまでも",
        "word": "ムダ毛は綺麗に剃れとは言わないまでも, せめて清潔にはして欲しい。",
        "mean": "잔털은 깨끗이 깎으라고는 말하지는 않더라도, 적어도 청결하게는 했으면 좋겠다."
      }
    ]
  },
  {
    "id": 61,
    "grammar": "なくして(は)",
    "means": "~없이(는)",
    "description": "앞부분이 없으면 뒷부분은 성립되지 않는다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "なくしては",
        "word": "この作品は涙なくしては観れません。",
        "mean": "이 작품은 눈물 없이는 볼 수 없어요."
      },
      {
        "answer": "なくして",
        "word": "愛情なくして夫婦は務まらない。",
        "mean": "애정 없이는 부부는 지낼 수 없다."
      },
      {
        "answer": "なくして",
        "word": "人材の成長なくして, ビジネスの成功なし。",
        "mean": "인재의 성장 없이는 비즈니스의 성공이 없다."
      },
      {
        "answer": "なくして",
        "word": "行動と失敗なくして, 前進はありえない。",
        "mean": "행동과 실패 없이는 전진이 있을 수 없다."
      },
      {
        "answer": "なくして",
        "word": "正当な理由のあるときを除き, 当該個人の同意なくして, 個人情報を第三者へ開示いたしません。",
        "mean": "정당한 사유가 있는 경우를 제외하고는 해당 개인의 동의 없이 개인정보를 제3자에게 공개하지 않습니다."
      },
      {
        "answer": "なくしては",
        "word": "主人公の活躍なくしては物語は成り立たない。",
        "mean": "주인공의 활약 없이는 이야기가 성립할 수 없다."
      },
      {
        "answer": "なくしては",
        "word": "失敗なくしては成功もありません。",
        "mean": "실패 없이는 성공도 없어요."
      },
      {
        "answer": "なくして",
        "word": "いい休憩なくして, いい仕事はできません。",
        "mean": "좋은 휴식 없이는 좋은 일을 할 수 없어요."
      },
      {
        "answer": "なくして",
        "word": "勇気と度胸なくして, 大きなお金を動かすことはできない。",
        "mean": "용기와 배짱 없이는 큰 돈을 움직일 수 없다."
      },
      {
        "answer": "なくしては",
        "word": "労働なくしては, 人生はことごとく腐ってしまう。",
        "mean": "노동 없이는 인생은 모조리 썩어 버린다"
      }
    ]
  },
  {
    "id": 62,
    "grammar": "ならではの",
    "means": "~만의\n~아니면 안 되는",
    "description":
        "여기 아니면 볼 수 없는 이곳 만의~, 다른 사람은 불가능한 오직 이 사람만 가능한~\n\n인물이나 조직, 장소 등 명사에 접속.\n\n[명사 + ならではの + 명사] 가 붙을 경우 뒷 문장에는 반드시 고평가를 표현하는 말이 온다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ならではの",
        "word": "旅先ではその土地ならではの雰囲気を楽しみたい。",
        "mean": "여행지에서는 그 고장만의 분위기를 즐기고 싶다."
      },
      {
        "answer": "ならではの",
        "word": "古いものには昔ならではの良さがある。",
        "mean": "오래된 것에는 옛날만의 장점이 있다."
      },
      {"answer": "ならではの", "word": "この味はこの店ならではだ。", "mean": "이 맛은 이 집만의 맛이다."},
      {
        "answer": "ならではの",
        "word": "プロならではの技術に感動した。",
        "mean": "프로 특유의 기술에 감동했다."
      },
      {
        "answer": "ならではの",
        "word": "外国人には, 日本人には分からない外国人ならではの考え方がある。",
        "mean": "외국인에게는 일본인이 알 수 없는 외국인만의 사고방식이 있다."
      },
      {
        "answer": "ならではの",
        "word": "北海道に冬ならではの景色を見に行こう。",
        "mean": "홋카이도(北海道)에 겨울만의 경치를 보러 가자."
      },
      {
        "answer": "ならではの",
        "word": "少人数クラスならではのきめ細やかな教育が売りだ。",
        "mean": "소규모 학급만의 세심한 교육이 매물이다."
      },
      {
        "answer": "ならではの",
        "word": "この物件は中古ならではの独特な趣がある。",
        "mean": "이 물건은 중고만의 독특한 멋이 있다."
      }
    ]
  },
  {
    "id": 63,
    "grammar": "~ことなく / ことなしに / こともなく",
    "means": "하지 않고는",
    "description": "동작 / 상태의 부정 , 부대상황(付帯状況)을 표현한다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "ことなく",
        "word": "気温も湿度も下がることなく, 蒸し暑い１日でした。",
        "mean": "기온도 습도도 떨어지지 않고 무더운 하루였습니다."
      },
      {
        "answer": "ことなく",
        "word": "怒りとはダムのようなもので, 一度決壊が生じれば後は止まることなく流れ出す。",
        "mean": "분노란 댐과 같은 것으로, 한 번 붕괴가 생기면 나중에는 멈추지 않고 흘러나오기 시작한다."
      },
      {
        "answer": "ことなく",
        "word": "久しぶりに朝まで１度も起きることなく眠れた。",
        "mean": "오랜만에 아침까지 한 번도 일어나지 않고 잘 수 있었다."
      },
      {
        "answer": "ことなく",
        "word": "単位を落とすことなく無事に前期を終えた。",
        "mean": "학점을 떨어뜨리지 않고 무사히 전기를 마쳤다."
      },
      {
        "answer": "ことなしには",
        "word": "どんな実業家も, 人に応援してもらうことなしには, 成功することはできない。",
        "mean": "어떤 기업인도 다른 사람에게 응원을 받지 않고서는 성공할 수 없다."
      },
      {
        "answer": "ことなしに",
        "word": "ファッションとはあなたが身につけた何かです。着ることなしにファッションは意味を持ちません。",
        "mean": "패션이란 당신이 익힌 무언가입니다.입는 것 없이 패션은 의미가 없어요."
      },
      {
        "answer": "ことなしに",
        "word": "苦難に耐えることなしに, 成功など, 決してあり得ない。",
        "mean": "고난을 견디지 않고서는 성공이란 결코 있을 수 없다."
      },
      {
        "answer": "ことなしに",
        "word": "結婚の理想は互いに相手を束縛することなしに, しかも緊密に結びついていることだ。",
        "mean": "결혼의 이상은 서로를 속박하지 않고, 게다가 긴밀하게 연결되어 있는 것이다."
      },
      {
        "answer": "ことなしに",
        "word": "金額を意識することなしに豪遊する。",
        "mean": "금액을 의식하지 않고 호유하다."
      },
      {
        "answer": "こともなく",
        "word": "このサイトでは大人気マンガが一話から最新話までお金がかかることもなく読めます。",
        "mean": "이 사이트에서는 인기 만화를 한 편부터 최신화까지 돈이 들지 않고 읽을 수 있습니다."
      },
      {
        "answer": "こともなく",
        "word": "部下と呼ばれる人は自分の知恵を疑ったり心配することもなく, ただ上司から求められることをやればいい。",
        "mean": "부하라고 불리는 사람은 자신의 지혜를 의심하거나 걱정할 필요도 없고, 단지 상사가 요구하는 것을 하면 된다."
      },
      {
        "answer": "こともなく",
        "word": "難しいあれこれを考えることもなく, 心の赴くままにただ泣いたり笑ったりして生きたい。",
        "mean": "어려운 이것저것 생각할 것도 없이 마음 가는 대로 그냥 울고 웃고 살고 싶다."
      }
    ]
  },
  {
    "id": 64,
    "grammar": "なり",
    "means": "~하자 마자",
    "description":
        "앞 사건이 동작 후 바로 뒷 사건이이 발생했음을 나타낸다.\n\n원칙적으로 과거의 일에만 사용할 수 있다.\n\n후건에서는 화자에게 예상 밖의 것을 말할 수 있다.\n\n앞 건과 뒷 건은 동일 주어 이어야 하며 1인칭 주어를 사용할 수 없다.",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "なり",
        "word": "その男は私と目が合うなり, 追いかけてきた。",
        "mean": "그 남자는 나와 눈이 마주치자마자 쫓아왔어."
      },
      {
        "answer": "なり",
        "word": "ドアを開けるなり, 土足で入り込んできた。",
        "mean": "문을 열자마자 맨발로 들어왔다."
      },
      {
        "answer": "なり",
        "word": "会うなりビンタされるとは思わなかった。",
        "mean": "만나자마자 따귀 맞을 줄 몰랐어."
      },
      {
        "answer": "なり",
        "word": "バッグに商品を入れるなり, 店から立ち去って行った。",
        "mean": "가방에 상품을 넣자마자 가게를 떠났다."
      },
      {
        "answer": "なり",
        "word": "彼女はその教会に足を踏み入れるなり涙が止まらなくなったそうだ。",
        "mean": "그녀는 그 교회에 발을 들여놓자마자 눈물이 멈추지 않게 되었다고 한다."
      },
      {
        "answer": "なり",
        "word": "彼は家を出るなり, 母親に呼び止められた。",
        "mean": "그는 집을 나서자마자 어머니에게 불려갔다."
      },
      {
        "answer": "なり",
        "word": "席に座るなりすぐ本題に入った。",
        "mean": "자리에 앉자마자 바로 본론으로 들어갔다."
      },
      {
        "answer": "なり",
        "word": "水着に着替えるなり海に飛び込んでいった。",
        "mean": "수영복으로 갈아입자마자 바다로 뛰어들었다."
      }
    ]
  },
  {
    "id": 65,
    "grammar": "なり ~なり",
    "means": "~하든 ~하든\n~든지 ~든지",
    "description": "예시 중에 하나를 선택한다는 의미",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "なり",
        "word": "おにぎりなりパンなり, 何か食べてから行きなさい。",
        "mean": "주먹밥이든 빵이든 뭐 좀 먹고 가세요."
      },
      {
        "answer": "なり",
        "word": "分からないときは, 私に聞くなり, 辞書で調べるなりしてください。",
        "mean": "모르실 때는 저에게 물어보든지 사전에서 찾든지 하세요."
      },
      {
        "answer": "なり",
        "word": "疲れたら軽く運動するなり, 背伸びするなり, 自由にしてください。",
        "mean": "피곤하면 가볍게 운동하든 발돋움하든 자유롭게 하세요."
      },
      {
        "answer": "なり",
        "word": "熱があるなら病院に行くなり, なんなりすればよかったのに。",
        "mean": "열이 있으면 병원에 가든지 뭐든지 하지 그랬어."
      },
      {
        "answer": "なり",
        "word": "負けるのには理由がある。対策なり, なんなりしないなら一生そのままだ。",
        "mean": "지는 데는 이유가 있다.대책이든 아니든 평생 그대로다."
      },
      {
        "answer": "なり",
        "word": "時間があったら電話なりともしてください。",
        "mean": "시간 되시면 전화든 하세요."
      },
      {
        "answer": "何なり",
        "word": "お困りの際はお近くの店員へ何なりとお申しつけください。",
        "mean": "어려울 때는 가까운 점원에게 무엇이든 말씀해 주십시오."
      },
      {
        "answer": "何なり",
        "word": "世界では常にどこかで内戦なり何なり起きている。",
        "mean": "세계에서는 항상 어디선가 내전이든 무엇이든 일어나고 있다."
      },
      {
        "answer": "なり",
        "word": "文句があるなら直接言うなりしてください。",
        "mean": "불평이 있으면 직접 말하든 하세요."
      },
      {
        "answer": "何なり",
        "word": "まずは冷静に話し合うなり何なりしましょう。",
        "mean": "우선 냉정하게 대화하든 뭐든 합시다."
      }
    ]
  },
  {
    "id": 66,
    "grammar": "なりに, なりの",
    "means": "나름대로",
    "description":
        "그 인물이나 상황·성질에 적합한 정도나 상태임을 나타내는 표현\n\n뒷 문장에는 어떤 결과가 서술되지만, 그 성과는 완벽한 것은 아니지만 그 성과나 자세에 대한 긍정적인 평가를 나타낼 수 있는 점이 이 문법의 특징.",
    "connectionWays": "な형용사 어간\n나머지는 보통형",
    "examples": [
      {
        "answer": "なりに",
        "word": "自分のペースで, 自分なりに楽しみながら続けていきたい。",
        "mean": "자신의 페이스로, 나름대로 즐기면서 계속해 나가고 싶다."
      },
      {
        "answer": "なりに",
        "word": "今回得た知識について私なりにまとめてみた。",
        "mean": "이번에 얻은 지식에 대해서 나름대로 정리해봤어."
      },
      {
        "answer": "なりに",
        "word": "弱いなら, 弱いなりに頑張らないといけない。",
        "mean": "약하면 약한대로 열심히 해야지."
      },
      {
        "answer": "なりに",
        "word": "やる気が無くても, 無いなりに生きていける。",
        "mean": "의욕이 없어도, 없는 대로 살아갈 수 있다."
      },
      {
        "answer": "なりに",
        "word": "下手でも下手なりに頑張ってみよう。",
        "mean": "서툴러도 못하는 대로 열심히 해보자."
      },
      {
        "answer": "なりに",
        "word": "分からない事に対して自分なりに考えて答えを出す。",
        "mean": "모르는 일에 대해 나름대로 생각하고 답을 내다."
      },
      {
        "answer": "なりの",
        "word": "安いのには安いなりの理由があるものだ。",
        "mean": "싼 데는 싼 나름의 이유가 있기 마련이다."
      },
      {
        "answer": "なりの",
        "word": "人生とは何か, 私なりの答えに辿り着いた。",
        "mean": "인생이란 무엇인가, 나만의 대답에 도달했다."
      },
      {
        "answer": "なりの",
        "word": "金持ちには金持ちなりの心配事があるものだ。",
        "mean": "부자에게는 부자 나름의 걱정거리가 있기 마련이다."
      },
      {
        "answer": "なりに",
        "word": "未経験なら未経験なりに試行錯誤してやってみればいい。",
        "mean": "미경험이라면 미경험대로 시행착오를 겪어서 해보면 된다."
      },
      {
        "answer": "なりに",
        "word": "やったことはありませんが, 見たことはありますのでそれなりに自信はあります。",
        "mean": "해본 적은 없지만 본 적은 있기 때문에 나름대로 자신은 있습니다."
      },
      {
        "answer": "なりの",
        "word": "彼にそれなりのものをプレゼントしてるし, 彼からもそれなりのものを貰いたい。",
        "mean": "그에게 나름대로의 것을 선물하고 있고, 그에게서도 나름대로의 것을 받고 싶다."
      }
    ]
  },
  {
    "id": 67,
    "grammar": "に(は)当たらない",
    "means": "~할 만큼은 아니다\n~할 필요 없다",
    "description":
        "あたる(해당하다)에서 파생된 문법으로, ~에 해당하지 않는다 ~할 만큼은 아니다, ~할 필요 없다\n\n상대방의 과잉반응에 대해 [그렇게까지 할 필요는 없다] 라고 의견을 말하거나 타이를 때 사용하는 문법.\n\n특히 감정을 나타내는 단어에 연결되며, 앞 문장에는 [ ~からといって,~だから, なので ]을 동반하여 원인이나 이유가 서술되는 경우 많다.",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "にはあたらない",
        "word": "多少ミスしたくらいでは心配にはあたらない。",
        "mean": "다소 실수한 정도로는 그렇게 걱정할 필요가 없다."
      },
      {
        "answer": "にはあたらない",
        "word": "彼はバカげたことを言っているが, いつものことなので驚くにはあたらない。",
        "mean": "그는 바보 같은 말을 하고 있지만, 평소의 일이라 그렇게 놀랄 것까지는 없다."
      },
      {
        "answer": "にあたらない",
        "word": "誰がやっても難しいのだから, 逃げ出してしまったからといって非難するにあたらない。",
        "mean": "누가 해도 어려우니 도망쳐 버렸다고 비난할 필요는 없다."
      },
      {
        "answer": "にはあたらない",
        "word": "叱られたからといってそこまで悲しむにはあたらない。",
        "mean": "꾸중을 들었다고 그렇게까지 슬퍼할 필요는 없다."
      },
      {
        "answer": "にはあたらない",
        "word": "まだ挽回できるチャンスはあるし, そこまで悲観するにはあたらないはずだ。",
        "mean": "아직 만회할 수 있는 기회는 있고 그렇게까지 비관할 필요는 없을 것이다."
      }
    ]
  },
  {
    "id": 68,
    "grammar": "に堪えない",
    "means": "1. ~해 마지 않다 (너무나도~하다)\n2. (차마) ~할 수 없다",
    "description":
        "1 .명사 + にたえない : 감사, 감격, 기쁨, ~の念 등 명사에 붙고, 그 감정을 억누를 수 없음을 표현.\n\n2. 동사 사전형 + に堪えない : 상황이 심하기 때문에 계속 보거나 계속 들을 수 없음을 나타낸다.\n[見る, 読む] 등 한정된 단어에 접속한다.",
    "connectionWays": "1. 명사에 직접 접속\n2. 동사 사전형",
    "examples": [
      {
        "answer": "にたえません",
        "word": "重なお話を聴くことができて, 感謝にたえません。",
        "mean": "무거운 이야기를 들을 수 있어서 너무 감사합니다."
      },
      {
        "answer": "に堪えません",
        "word": "皇后陛下ご臨席の下, 表彰状を頂戴し, 感激に堪えません。",
        "mean": "황후 폐하께서 임석하신 후 표창장을 받아 감격스럽기 그지없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "お忙しいところを多くの方にお集まりいただき, 感激に堪えません。",
        "mean": "바쁘신 와중에도 많은 분들이 모여주셔서 감격스럽기 그지없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "誠に失礼なことを申し上げまして, 後悔に堪えません。",
        "mean": "정말 실례되는 말씀을 드려서 너무 후회가 됩니다."
      },
      {
        "answer": "に堪えません",
        "word": "外国へ行っているとあなたが恋しくなり, 一人で行ってしまったこと, 今では後悔に堪えません。",
        "mean": "외국에 가 있으면 당신이 그리워져서 혼자 가버린 것, 지금은 너무나도 후회합니다."
      },
      {
        "answer": "に堪えません",
        "word": "被害に遭われた方のお気持ちをお察ししますと, 心より悲しく遺憾に堪えません。",
        "mean": "피해를 입은 분들의 마음을 헤아려보면 진심으로 슬프고 유감스럽기 그지없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "このような結論に至り, 遺憾に堪えません。",
        "mean": "이러한 결론에 이르러 유감스럽기 그지없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "皆様のご心労をお察しすると, 同情に堪えません。",
        "mean": "여러분의 심로를 헤아리면 동정심을 금할 수 없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "全て私の不徳の致すところであり, 反省の念に堪えません。",
        "mean": "모두 제 부덕의 소치로 반성의 마음을 금할 수 없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "日々ご尽力されている医療従事者の皆様には尊敬の念に堪えません。",
        "mean": "날마다 힘쓰시는 의료인 여러분께 존경의 마음을 금할 수 없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "お客様への対応が遅れてしまったことには慙愧の念に堪えません。",
        "mean": "고객에 대한 대응이 늦어 버린 것은 부끄럽기 짝이 없습니다."
      },
      {
        "answer": "に堪えません",
        "word": "突然の訃報に接し, 悲しみの念に堪えません。",
        "mean": "갑작스런 부고를 접하고 슬픔을 금치 못합니다."
      },
      {
        "answer": "に堪えません",
        "word": "御遺族の皆様の深い悲しみに思いを致しますと, 誠に痛恨の極みであり, 哀惜の念に堪えません。",
        "mean": "유가족 여러분의 깊은 슬픔을 생각하면 참으로 뼈아픈 일이고 애석하기 짝이 없습니다."
      },
      {
        "answer": "にたえません",
        "word": "ご丁寧なアドバイスに感謝にたえません。",
        "mean": "정중한 조언에 감사드립니다."
      },
      {
        "answer": "に堪えない",
        "word": "最近のテレビ番組は見るに堪えない。",
        "mean": "요즘 TV 프로그램은 차마 볼 수 없다."
      },
      {
        "answer": "に堪えない",
        "word": "彼の歌声は聞くに堪えない。",
        "mean": "그의 노랫소리는 차마 들을 수 없다."
      },
      {
        "answer": "にたえない",
        "word": "友達が授業中に聞くにたえないような卑猥な冗談を言ってきた。",
        "mean": "친구가 수업 중에 차마 들을 수 없을 정도로 외설적인 농담을 해왔다."
      },
      {
        "answer": "にたえない",
        "word": "部屋が見るにたえないくらい散らかっている状態だ。",
        "mean": "방이 차마 볼 수 없을 정도로 어수선한 상태다."
      },
      {
        "answer": "に堪えない",
        "word": "この本の内容は稚拙で読むに堪えない。",
        "mean": "이 책의 내용은 치졸하여 읽을 수 없다."
      }
    ]
  },
  {
    "id": 69,
    "grammar": "に堪える",
    "means": "~할 만하다",
    "description":
        "[見る, 読む, 鑑賞する] 등 극히 일부의 단어에 대해서 그것을 할 만한 충분한 가치가 있음을 나타낸다.\n\nにたえる 라고 발음한다.",
    "examples": [
      {"answer": "にたえる", "word": "この映画は鑑賞するにたえる。", "mean": "이 영화는 감상할 만하다"},
      {
        "answer": "に堪える",
        "word": "彼女の能力は学校代表として推薦するに堪えるものだ。",
        "mean": "그녀의 능력은 학교 대표로 추천 할 만하다"
      },
      {
        "answer": "に堪える",
        "word": "国際的な評価に堪えるクオリティのワイン生産が始まったのは最近のことだ。",
        "mean": "국제적인 평가 할 만한 퀄리티의 와인 생산이 시작된 것은 최근의 일이다."
      },
      {
        "answer": "に堪える",
        "word": "今回写真をあげたのは, 久しぶりにネットに公開するに堪える料理を作れたからです。",
        "mean": "이번에 사진을 올린 것은 오랜만에 인터넷에 공개할 만한 요리를 만들 수 있었기 때문입니다."
      },
      {
        "answer": "にたえる",
        "word": "最近大人が見るにたえるテレビ番組が乏しい。",
        "mean": "요즘 어른들이 볼만한 TV 프로그램이 부족하다."
      },
      {
        "answer": "にたえる",
        "word": "来週から論文を形式的, 内容的に読むにたえるものに仕上げていくつもりだ。",
        "mean": "다음 주부터 논문을 형식적, 내용적으로 읽을 만 한 것으로 마무리해 나갈 생각이다."
      }
    ]
  },
  {
    "id": 70,
    "grammar": "にひきかえ",
    "means": "~와 반대로\n~와 대조적으로\n~와 달리\n~에 비해",
    "description":
        "주관적인 생각이 포함되어 있다\n\n대조적인 두 사물을 대비시킬 때 사용하는 문법.\n\n앞 문장과 뒷 문장은 대조적인 결과나 상태가 서술.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にひきかえ",
        "word": "昔は体力があったのに, それにひきかえ今は階段上っただけでも疲れる。",
        "mean": "예전에는 체력이 좋았는데 오히려 지금은 계단 오르기만 해도 피곤하다."
      },
      {
        "answer": "にひきかえ",
        "word": "兄にひきかえ, 弟はいつも無気力だ。",
        "mean": "형에 비해 동생은 항상 무기력하다."
      },
      {
        "answer": "にひきかえ",
        "word": "暖冬だった去年にひきかえ, 今年は厳冬になるらしい。",
        "mean": "따뜻한 겨울이었던 작년에 비해 올해는 엄동이 될 것 같다."
      },
      {
        "answer": "にひきかえ",
        "word": "私たちにひきかえ彼は遊び惚けていた。",
        "mean": "우리에 달리 그는 장난을 치고 있었다."
      },
      {
        "answer": "にひきかえ",
        "word": "昔は良かった。それにひきかえ今は。",
        "mean": "옛날에는 좋았어. 그것에 비해서 지금은."
      },
      {
        "answer": "に引き換え",
        "word": "女性用の水着は毎年新商品が出るのに, それに引き換え男性用水着は毎年似たようなものばかりだ。",
        "mean": "여성용 수영복은 매년 신상품이 나오는데 그 대조적으로 남성용 수영복은 매년 비슷한 것들뿐이다."
      },
      {
        "answer": "にひきかえ",
        "word": "長女は二重で目が大きいのにひきかえ, 次女は一重だ。",
        "mean": "큰딸은 쌍커풀로 눈이 큰데 반해 둘째딸은 무쌍이다."
      },
      {
        "answer": "にひきかえ",
        "word": "多くの若い選手がオリンピックという大舞台で活躍している。それにひきかえ俺は…。",
        "mean": "많은 젊은 선수들이 올림픽이라는 큰 무대에서 활약하고 있다.그거에 비해서 나는.."
      }
    ]
  },
  {
    "id": 71,
    "grammar": "にも増(も)して",
    "means": "~보다 더",
    "description":
        "과거 어느 시점의 상태와 비교해, 그 때 보다 정도가 높아진 것을 뒷문장에 서술하는 문법.\n\n대부분 앞 문장은 시간 표현 명사와 접속한다.\n\n관용적으로 [ 以前にも増して, いつにもまして ] 로 사용된다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "いつもにも増して",
        "word": "今日はいつもにも増して寒いし早く帰りたい。",
        "mean": "오늘은 그 어느 때보다 춥고 빨리 돌아가고 싶어."
      },
      {
        "answer": "にも増して",
        "word": "彼は酔うと, 普段にも増して素直になる。",
        "mean": "그는 취하면 평소보다 더 솔직해진다."
      },
      {
        "answer": "前にも増して",
        "word": "肌荒れが前にも増して酷くなってる。",
        "mean": "피부 트러블이 그 어느 때보다 더 심해지고 있어."
      },
      {
        "answer": "にも増して",
        "word": "今日の月は昨日にも増して本当に綺麗です。",
        "mean": "오늘 달은 어제보다 더 정말 예뻐요."
      },
      {
        "answer": "にも増して",
        "word": "熱は下がったが, 昨日にも増して喉が痛い。",
        "mean": "열은 내렸지만 더 어제보다 목이 아프다."
      },
      {
        "answer": "にも増して",
        "word": "今年は, 去年にも増してインフルエンザが猛威をふるっています。",
        "mean": "올해는 작년보다 더 독감이 기승을 부리고 있습니다."
      },
      {
        "answer": "にも増して",
        "word": "前回にも増して楽しい時間を過ごす事ができました。",
        "mean": "저번보다 더 즐거운 시간을 보낼 수 있었어요."
      },
      {
        "answer": "以前にも増して",
        "word": "仕事は以前にも増して忙しくなっている。",
        "mean": "일은 그 어느 때보다 바빠지고 있다."
      },
      {
        "answer": "にもまして",
        "word": "あんなにかっこよくて美しい。それにもまして人柄が素晴らしい。",
        "mean": "저렇게 멋있고 아름다워. 더구나 인품이 훌륭하다."
      },
      {
        "answer": "にもまして",
        "word": "天気また悪くなりそう それにもまして湿度が高い。",
        "mean": "날씨가 또 나빠질 것 같아 게다가 습도가 높아."
      }
    ]
  },
  {
    "id": 72,
    "grammar": "の至り",
    "means": "지극히 ~함",
    "description":
        "光栄の至り, 感激の至り, 幸甚 등 일부 단어에 대해 감정을 강조하는 표현.\n\n[ 若気の至り은 혈기왕성한 젊은이들이 하는 치졸한 행위, 실패를 나타내는 관용 표현.\n\nのいたり 라고 발음한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "の至りです",
        "word": "このような式典に参加でき, 光栄の至りです。",
        "mean": "이런 식전에 참석하게 되어 지극히 영광입니다."
      },
      {
        "answer": "の至りでございます",
        "word": "皆様のご声援に感激の至りでございます。",
        "mean": "여러분의 성원에 감격하기 그지없습니다."
      },
      {
        "answer": "の至りです",
        "word": "少しでもお役に立てば幸甚の至りです。",
        "mean": "조금이라도 도움이 된다면 지극히 다행입니다."
      },
      {
        "answer": "の至りでした",
        "word": "限られた時間でしたが, 大変貴重なお話しを伺え, その場にいられましたことが光栄の至りでした。",
        "mean": "한정된 시간이었지만 매우 귀중한 이야기를 들을 수 있었고, 그 자리에 있게 된 것이 지극히 영광이었습니다."
      },
      {
        "answer": "の至りです",
        "word": "多くの方に応援して頂いて感謝の至りです。",
        "mean": "많은 분들이 응원해 주셔서 감사하기 그지없습니다."
      },
      {
        "answer": "の至りです",
        "word": "褒めていただき恐縮の至りです。",
        "mean": "칭찬해 주셔서 황송하기 짝이 없습니다."
      },
      {
        "answer": "の至りを",
        "word": "若気の至りを経験してこそ本当の大人になれる。",
        "mean": "젊음의 극치를 겪어야 진정한 어른이 될 수 있다."
      },
      {
        "answer": "若気の至りで",
        "word": "学生時代はよく若気の至りで悪いことばかりした。",
        "mean": "학창시절에는 흔히 풋내기에 나쁜 짓만 했다."
      }
    ]
  },
  {
    "id": 73,
    "grammar": "の極みだ",
    "means": "~의 극치이다\n~하기 그지없다",
    "description":
        "정도가 심하다는 의미 \n\n[ 痛恨の極み, 疲労の極み, 贅沢の極み, 感激の極み ] 등 일부 단어에 대해 강조하는 문법 \n\nのきわみだ 라고 발음한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "の極みだ",
        "word": "交通事故で多くの人が亡くなり, 痛恨の極みだ。",
        "mean": "교통사고로 많은 사람이 사망해 뼈아픈 심정이다."
      },
      {"answer": "の極み", "word": "贅沢の極みを尽くした最高級料理", "mean": "사치의 극치를 다한 최고급 요리"},
      {
        "answer": "の極みだ",
        "word": "世界的に有名な彼と握手できて感激の極みだ。",
        "mean": "세계적으로 유명한 그와 악수할 수 있어 감격하기 그지없다."
      },
      {
        "answer": "の極み",
        "word": "アロママッサージで[ 癒しの極み ]を体験してみませんか。",
        "mean": "아로마 마사지로 '힐링의 극치'를 체험해 보세요."
      },
      {
        "answer": "の極みだ",
        "word": "一度しかない人生において, 自分の時間を他人のために使うのは無駄の極みだ。",
        "mean": "한 번밖에 없는 인생에서 자신의 시간을 남을 위해 쓰는 것은 헛수고의 극치이다."
      },
      {
        "answer": "の極みだ",
        "word": "会う女性みんなに片っ端から告白するのはゲスの極みだ。",
        "mean": "만나는 여자 모두에게 단번에 고백하는 것은 상놈의 극치다."
      },
      {
        "answer": "の極みだ",
        "word": "おかわり無料なのに気づかなかった。痛恨の極みだ。",
        "mean": "리필 무료인 줄 몰랐어.뼈아픈 심정이다."
      }
    ]
  },
  {
    "id": 77,
    "grammar": "ようによっては",
    "means": "하기에 따라서는",
    "description": "방법이나 상황이 다르면 결과도 달라질 수 있음을 말하는 문법",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "ようによっては",
        "word": "この選手は癖が強いが, 使いようによってはチームの中でうまく機能するはずだ。",
        "mean": "이 선수는 버릇이 강하지만, 사용하기에 따라서는 팀 안에서 잘 기능할 것이다."
      },
      {
        "answer": "ようによっては",
        "word": "圧倒的な戦力差があるものの, やりようによっては勝てるだろう。",
        "mean": "압도적인 전력차가 있지만 하기에 따라서는 이길 수 있을 것이다."
      },
      {
        "answer": "ようによっては",
        "word": "不運だと思われることも, 考えようによっては前向きに捉えられる。",
        "mean": "불운하다고 여겨지는 것도 생각하기에 따라서는 긍정적으로 받아들여진다."
      },
      {
        "answer": "ようによっては",
        "word": "ここから目的地まで, 道の混みようによっては１時間かかる場合もある。",
        "mean": "이곳에서 목적지까지 길이 막히기에 따라서는 1시간이 걸리는 경우도 있다."
      },
      {
        "answer": "ようによっては",
        "word": "やりようによってはどうにでもなる。",
        "mean": "하기에 따라서는 어쩔 수 없다."
      }
    ]
  },
  {
    "id": 78,
    "grammar": "よう",
    "means": "~하는 방법 / 상태",
    "description":
        "[ 悲しむ, 起こる, 驚く, 喜ぶ ] 등 의 감정을 나거나 [ 変わる, 似る ] 등의 상태를 표하는\n\n동사에 자주 접속하며 그 방법이나 상태를 표현한다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "ようは",
        "word": "その悲しみようは, 見ている人さえも悲しくさせた。",
        "mean": "그 슬픔은 보는 사람조차 슬프게 했다."
      },
      {
        "answer": "ようだ",
        "word": "突然声をかけられて, 尋常ではない驚きようだった。",
        "mean": "갑자기 말을 걸어 심상치 않은 놀라움이었다."
      },
      {
        "answer": "ようだ",
        "word": "何年も見ないうちに, 顔も雰囲気もすごい変わりようだった。",
        "mean": "몇 년이나 못본 사이에 얼굴도 분위기도 많이 변한 모습이었다."
      },
      {
        "answer": "ようだった",
        "word": "まるで少女のような喜びようだった。",
        "mean": "마치 소년 같은 웃음(방법) 이었다."
      },
      {
        "answer": "ようだ",
        "word": "部下がちょっとミスしただけでこの怒りようだ。",
        "mean": "부하가 조금 실수 한 것 만으로 이 화난(상태) 다"
      }
    ]
  },
  {
    "id": 79,
    "grammar": "を押して / 押し切って",
    "means": "~를 무릅쓰고",
    "description":
        "어떤 어려움을 극복하고 있음을 나타내는 문법.\n\n이 문형은 [病気を押して, 反対を押し切って] 등 접속할 수 있는 단어는 매우 한정되어 있다.\n\nをおして, をおしきって 라고 발음한다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "を押して",
        "word": "総理は病気を押して記者会見に現れた。",
        "mean": "총리는 병을 무릅쓰고 기자회견에 나타났다."
      },
      {
        "answer": "を押し切って",
        "word": "周囲の反対を押し切って結婚した。",
        "mean": "주위의 반대를 무릅쓰고 결혼했다."
      },
      {
        "answer": "を押して",
        "word": "風邪を引いたけど休めないから, 無理を押して出社した。",
        "mean": "감기에 걸렸는데 쉴 수가 없어서 무리를 무릅쓰고 (억지로) 출근했다."
      },
      {
        "answer": "を押して",
        "word": "不調を押して面接へ向かった。",
        "mean": "부진(상태가 나쁨)을 무릅쓰고 면접을 보러 갔다."
      },
      {
        "answer": "を押し切って",
        "word": "目の前には多くの困難が待ち受けているが, その困難を押し切ってはねのけるだけの能力が彼にはある。",
        "mean": "눈앞에는 많은 어려움이 기다리고 있지만 그 어려움을 무릅쓰고 물리칠 만한 능력이 그에게는 있다."
      },
      {
        "answer": "を押して",
        "word": "風邪を押して歌を歌って喉を痛めた。",
        "mean": "감기를 무릅쓰고 노래를 불러서 목을 다쳤다."
      }
    ]
  },
  {
    "id": 81,
    "grammar": "を経て",
    "means": "~을 거쳐",
    "description": "장소 (경유지) 나 시간, 수단 등의 경유를 표현한다.\n\nをへて 라고 발음한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {"answer": "を経て", "word": "韓国を経て日本に行く。", "mean": "한국을 거쳐 일본으로 간다."},
      {
        "answer": "を経て",
        "word": "２年という長い道のりを経て司法試験にようやく合格することができた。",
        "mean": "2년이라는 긴 여정을 거쳐 사법시험에 겨우 합격할 수 있었다."
      },
      {
        "answer": "を経て",
        "word": "たくさんの別れと出会いを経て, 今の私がある。",
        "mean": "많은 이별과 만남을 거쳐 지금의 내가 있다."
      },
      {
        "answer": "を経て",
        "word": "彼女とは紆余曲折を経てよりを戻すことになった。",
        "mean": "그녀와는 우여곡절을 거쳐 다시 만나게 되었다."
      },
      {
        "answer": "を経て",
        "word": "こうした体験を経て, 人は成長していく。",
        "mean": "이러한 체험을 거쳐 사람은 성장해 간다."
      },
      {
        "answer": "を経て",
        "word": "わずらわしい手続きや申請を経て, ようやく認可が下りた。",
        "mean": "번거로운 절차와 신청을 거쳐 겨우 인가가 났다."
      },
      {"answer": "を経て", "word": "数々の失敗を経て気づいた。", "mean": "숱한 실패를 거쳐 깨달았다."},
      {
        "answer": "を経て",
        "word": "国民投票を経て得られた民意を蔑ろにしてはいけない。",
        "mean": "국민투표를 거쳐 얻은 민의를 무시해서는 안 된다."
      }
    ]
  },
  {
    "id": 82,
    "grammar": "あっての",
    "means": "~A가 이 있어야 성립하는 B,~이 아니고서는 불가능한",
    "description":
        "앞 부분이 있어야 뒷부분이 성립할 수 있음\n\n[命あっての物種] 는 관용구로 모든 것은 생명이 없으면 할 수 없음으로 \"생명은 소중히 해야한다\" 라는 뜻",
    "connectionWays": "1. 명사A + あっての + 명사B\n2. 명사 + あってのことだ\n3. 명사 + があってのことだ",
    "examples": [
      {"answer": "あっての", "word": "過去があっての現在", "mean": "과거가 있어야 성립하는 현재"},
      {
        "answer": "あっての",
        "word": "ここまで成果を上げられたのは, 周囲の協力があってのこと。",
        "mean": "여기까지 성과를 거둘 수 있었던 것은 주위의 협력이 아니고서는 불가능했습니다"
      },
      {
        "answer": "あっての",
        "word": "彼があんなことをしたのも, 事情があってのことだろうと思う。",
        "mean": "그가 그런 짓을 한 것도 사정이 있어서였을 거라고 생각한다."
      },
      {
        "answer": "あっての",
        "word": "あのドラマの面白さは演者の演技力あってのものだ。",
        "mean": "그 드라마의 재미는 연기자의 연기력이 잇어야 성립한다"
      },
      {"answer": "あっての", "word": "命あっての物種", "mean": "생명은 소중하다"},
      {
        "answer": "あっての",
        "word": "今の私があるのも, 先生あってのことです。",
        "mean": "지금의 제가 있는 것도 선생님이 아니고서는 불가능합니다."
      },
      {
        "answer": "あっての",
        "word": "選手たちは頑張った。色んな思いあっての涙なんだろう。",
        "mean": "선수들은 열심히 했다.여러 가지 추억이 있어야 성립하는 눈물이겠지."
      },
      {
        "answer": "あっての",
        "word": "動物あっての動物園。お客さんよりも動物を大切にしなければいけない。",
        "mean": "동물이 있어야 성립하는 동물원.손님보다 동물을 소중히 여겨야 한다."
      },
      {
        "answer": "あっての",
        "word": "すべては偶然で起こっているものではなく, 原因があってのことだ。",
        "mean": "모든 것은 우연으로 일어나는 것이 아니라 원인이 \b있어야 성립하는 것이다."
      }
    ]
  },
  {
    "id": 83,
    "grammar": "いかんでは, いかんによっては",
    "means": "~여하에 따라서는",
    "description":
        "앞 조건에 따라 결과가 달라지는 것을 표현한다.\n\n한자로는 如何 \n\n[ 次第で(は), 次第によっては ] 와 거의 비슷하다",
    "connectionWays":
        "1. 명사 + (の) + いかんで\n2. 명사 + (の) + いかんでは\n3. 명사 + (の) + いかんによっては",
    "examples": [
      {
        "answer": "いかんでは",
        "word": "自分の行動いかんでは人生はそんな悪くない。",
        "mean": "자신의 행동 여하에서는 인생은 그렇게 나쁘지 않다."
      },
      {
        "answer": "いかんでは",
        "word": "現段階では開催する方向になっていますが, 台風の状況いかんでは変更する可能性があります。",
        "mean": "현 단계에서는 개최하는 방향으로 되어 있습니다만, 태풍의 상황 여하에 따라 변경될 가능성이 있습니다."
      },
      {
        "answer": "いかんによっては",
        "word": "今後の君の態度いかんによっては考えないこともない。",
        "mean": "앞으로의 너의 태도 여하에 따라서는 생각하지 않을 것도 없다."
      },
      {
        "answer": "いかんによっては",
        "word": "占いの結果いかんによっては今後の身の振り方を考えたい。",
        "mean": "점을 본 결과 여하에 따라서는 앞으로의 처신 방법을 생각하고 싶다."
      },
      {
        "answer": "いかんで",
        "word": "自分の行動いかんで周囲に影響が出たらと思うと, 怖くて何もできなくなる。",
        "mean": "자신의 행동 여하에 주위에 영향을 주었으면 하고 생각하면 무서워서 아무것도 할 수 없게 된다."
      },
      {
        "answer": "いかんでは",
        "word": "今年の結果いかんでは引退も辞さないつもりらしい。",
        "mean": "금년 결과 여하튼 은퇴도 불사할 작정인 모양이다."
      },
      {
        "answer": "いかんでは",
        "word": "上司からは明日の診察の結果いかんでは出勤してほしいと言われている。",
        "mean": "상사는 내일 진찰 결과 여하튼 출근해 달라고 한다."
      },
      {
        "answer": "いかんでは",
        "word": "今後の治療方針いかんではどうなるか心配です。",
        "mean": "앞으로의 치료 방침 여하에서는 어떻게 될지 걱정입니다."
      },
      {
        "answer": "いかんでは",
        "word": "状況いかんでは当初の作戦を変えることも考えられる。",
        "mean": "상황 여하에서는 당초 작전을 바꿀 수도 있다."
      },
      {
        "answer": "いかんでは",
        "word": "対戦相手のプレースタイルいかんではそのまま負けてしまうこともある。",
        "mean": "대전 상대의 플레이 스타일 여하에서는 그대로 져 버릴 수도 있다."
      }
    ]
  },
  {
    "id": 84,
    "grammar": "~いかんにかかわらず / いかんによらず / いかんを問わず",
    "means": "~여하에 관계없이",
    "description":
        "앞 조건의 결과나 상태에 좌우되지 않음을 나타낸다.\n\n[かかわらず, よらず] 에는 조사 [に] 와 사용되며 [問わず] 는 조사 [を] 를 사용하는 것에 주의",
    "connectionWays":
        "1. 명사 + (の) + いかんにかかわらず\n2. 명사 + (の) + いかんによらず\n3. 명사 + (の) + いかんを問わず",
    "examples": [
      {
        "answer": "のいかんにかかわらず",
        "word": "成績のいかんにかかわらず, 地元クラブを応援したい。",
        "mean": "성적 여하에 관계없이 현지 클럽을 응원하고 싶다."
      },
      {
        "answer": "いかんにかかわらず",
        "word": "理由いかんにかかわらず不快にさせた部分については謝罪が必要。",
        "mean": "이유 여하를 막론하고 불쾌하게 한 부분에 대해서는 사과가 필요하다."
      },
      {
        "answer": "いかんにかかわらず",
        "word": "影響力いかんにかかわらず感想を呟く自由は各々ある。",
        "mean": "영향력 여하에 관계없이 감상을 중얼거릴 자유는 각자 있다."
      },
      {
        "answer": "いかんによらず",
        "word": "試合の勝敗いかんによらず, 反省するところは反省すべき。",
        "mean": "경기 승패와 상관없이 반성할 부분은 반성해야 한다."
      },
      {
        "answer": "のいかんを問わず",
        "word": "目的のいかんを問わず, これらの国々への渡航は自粛してください。",
        "mean": "목적 여하를 막론하고 이들 국가로의 도항은 자제해 주세요."
      },
      {
        "answer": "のいかんにかかわらず",
        "word": "犯罪は理由のいかんにかかわらず絶対してはいけない。",
        "mean": "범죄는 이유 여하에 관계없이 절대 해서는 안 된다."
      },
      {
        "answer": "いかんにかかわらず",
        "word": "スーパーで試食をすると, その味いかんにかかわらず商品を買わなければいけないという気持ちになってしまう。",
        "mean": "마트에서 시식을 하면 그 맛 여하에 상관없이 상품을 사야겠다는 생각이 든다."
      },
      {
        "answer": "のいかんを問わず",
        "word": "組織の行動指針に適さない場合, 理由のいかんを問わず是正いたします。",
        "mean": "조직의 행동 지침에 적합하지 않을 경우, 이유 여하를 불문하고 시정하겠습니다."
      }
    ]
  },
  {
    "id": 85,
    "grammar": "(よ)うが / (よ)うと",
    "means": "(설령) ~하더라도",
    "description":
        "앞 부분과 관계없이 뒷부분을 하겠다는 강한 의지의 표현\n\n가정 조건의 역접을 나타낸다.\n\n어떤 상황에서도 변하지 않는 것을 뒷 내용에서 말함.\n\n[たとえ, どれだけ, どんなに, いくら] 등과 자주 호흥함.",
    "connectionWays":
        "1. 동사 의지형 + が / と / とも\n2. 명사 + だろうが / であろうが / だろうと / であろうと\n3. い형용사 어간 + くても / くとも / かろうと / かろうが\n4. な형용사 어간 + だろうが / であろうが / だろうと / であろうと",
    "examples": [
      {
        "answer": "買おうと",
        "word": "たくさん本を買おうと, 読まないなら無駄だ。",
        "mean": "책을 많이 사더라도 읽지 않는다면 소용없어."
      },
      {
        "answer": "されようが",
        "word": "たとえ反対されようが, 自分のことは自分で決める。",
        "mean": "비록 반대를 받더라도, 자신의 일은 스스로 결정한다."
      },
      {
        "answer": "いようと",
        "word": "今どんなに晴れていようと, 登山中はいつ天気が急変するか分からないので注意しなければならない。",
        "mean": "지금 아무리 맑더라도 등산 중에는 언제 날씨가 급변할지 모르기 때문에 주의해야 한다."
      }
    ]
  },
  {
    "id": 86,
    "grammar": "~(よ)うが~まいが / ~(よ)うと~まいと",
    "means": "~하든~하지 않든",
    "description": "어느쪽이든 같다는 의미",
    "connectionWays": "1. 동사 의지형 + が + 동사 まい형 + が\n2. 동사 의지형 + と + 동사 まい형 + と",
    "examples": [
      {
        "answer": "しまいと",
        "word": "歴史はめちゃくちゃ得意なので, 勉強しようとしまいと問題ない。",
        "mean": "역사는 엄청 잘해서 공부하든 안하든 문제없다."
      },
      {
        "answer": "いまいが",
        "word": "彼がいようがいまいが, どっちでもいい。",
        "mean": "그가 있든 없든 어느 쪽이든 좋다."
      },
      {
        "answer": "降ろうが",
        "word": "雨が降ろうが降るまいが, 運動会は決行します。",
        "mean": "비가 오든 말든 운동회는 결행합니다."
      }
    ]
  },
  {
    "id": 87,
    "grammar": "~だろうが ~だろうが / ~だろうと ~だろうと",
    "means": "~이든 ~이든",
    "description": "앞 부분과 관계없이 뒷부분을 하겠다는 강한 의지의 표현",
    "connectionWays": "だろう 같이 접속",
    "examples": [
      {
        "answer": "だろうが",
        "word": "どんなにイケメンだろうがお金持ちだろうが, 性格に問題がある人とは付き合えない。",
        "mean": "아무리 잘생겼더라도 부자든 성격에 문제가 있는 사람과는 사귈 수 없다."
      },
      {
        "answer": "低かろうと",
        "word": "他人の私に対する評価が高かろうと低かろうと, 別に気にしたことではない。",
        "mean": "남들의 나에 대한 평가가 높든 낮든 별로 신경쓸 일이 아니다."
      },
      {
        "answer": "だろうと",
        "word": "風邪だろうと熱だろうと, 明日の会議は休まないでください。",
        "mean": "감기든 열이든 내일 회의는 쉬지 마세요."
      },
      {
        "answer": "寂しかろうが",
        "word": "一人が寂しかろうが, 猫がいれば大丈夫。",
        "mean": "한 사람이 외로워도 고양이가 있으면 괜찮아."
      },
      {
        "answer": "かろうと",
        "word": "値段が高かろうと何だろうと, 欲しいものは欲しい。",
        "mean": "가격이 비싸든 뭐든 원하는 건 갖고 싶어."
      },
      {
        "answer": "だろうが",
        "word": "犬だろうが, 猫だろうが, 母はペットを飼うのを許してくれない。",
        "mean": "개든 고양이든 엄마는 애완동물을 키우는 것을 허락하지 않는다."
      }
    ]
  },
  {
    "id": 88,
    "grammar": "(よ)うにも ~ (でき)ない",
    "means": "~하려고 해도~할 수 없다",
    "description":
        "하고 싶지만 어떤 이유로 할 수 없다는 것을 나타낸다.\n\n물리적인 이유의 경우에 사용하기 쉽다.\n\n[(よ)うにも~ない] : 물리적 이유로 할 수 없다\n\n[~に~ない] : 심리적인 이유로 할 수 없다.",
    "connectionWays": "동사 의지형 + 동사 가능형",
    "examples": [
      {
        "answer": "話しかけられない",
        "word": "緊張して話しかけようにも話しかけられない。",
        "mean": "긴장해서 말을 걸려고 해도 말을 걸지 못한다."
      },
      {"answer": "寝られない", "word": "暑くて寝ようにも寝られない。", "mean": "더워서 잠도 못 자겠어."},
      {
        "answer": "帰られない",
        "word": "仕事が終わらず帰ろうにも帰られない。",
        "mean": "일이 끝나지 않아 돌아갈 수도 없다."
      },
      {
        "answer": "言うに",
        "word": "深い事情があって言うに言えない。",
        "mean": "깊은 사정이 있어서 말할 수 없다."
      },
      {
        "answer": "忘れられない",
        "word": "私の目の前で人が津波に飲み込まれていった光景は忘れようにも忘れられない。",
        "mean": "내 눈앞에서 사람이 쓰나미에 휩쓸려 간 광경은 잊어도 잊을 수 없다."
      },
      {
        "answer": "上がれない",
        "word": "全身筋肉痛でベッドから起き上がろうにも起き上がれない。",
        "mean": "전신 근육통으로 침대에서 일어나려고 해도 일어날 수가 없어."
      },
      {
        "answer": "歌おうにも",
        "word": "好きな歌なのに, サビの音が高すぎて歌おうにも歌えない。",
        "mean": "좋아하는 노래인데 후렴구 소리가 너무 높아서 부르려고도 못 불러."
      },
      {
        "answer": "聞こうにも",
        "word": "彼の寝癖がずっと気になって, 真面目に聞こうにも話が頭に入ってこない。",
        "mean": "그의 잠버릇이 계속 신경 쓰여서 진지하게 들어도 이야기가 머리에 들어오지 않는다."
      }
    ]
  },
  {
    "id": 89,
    "grammar": "동사 기본형 + に + (가능형)ない",
    "means": "하고 싶어도 할 수 가 없다",
    "description":
        "하고 싶지만 어떤 이유로 할 수 없다는 것을 나타낸다.\n\n심리적인 이유일 경우에 사용하기 쉽다.\n\n[(よ)うにも ~ない] : 물리적 이유로 할 수 없다\n\n[~に ~ない] : 심리적인 이유로 할 수 없다.",
    "connectionWays": "동사 기본형 + にも + 동사 가능 부정형",
    "examples": [
      {
        "answer": "笑えなかった",
        "word": "彼の仕草がとても面白かったが, 周囲は真剣に聞いているので私は笑うに笑えなかった。",
        "mean": "그의 몸짓이 너무 재미있었지만 주위는 진지하게 듣고 있어서 나는 웃고 싶어도 웃지 못했다."
      },
      {
        "answer": "れなかった",
        "word": "赤ちゃんが夜通し泣いて, 私は寝るに寝れなかった。",
        "mean": "아기가 밤새 울어서 나는 자고 싶어도 잘 수 없었다."
      },
      {
        "answer": "休めない",
        "word": "今職場は深刻な人手不足に陥っていて, 休日ですら休むに休めない状況だ。",
        "mean": "지금 직장은 극심한 인력난에 빠져 있어 휴일조차 쉬고 싶어도 쉴 수 없는 상황이다."
      },
      {
        "answer": "引けない",
        "word": "彼らは喧嘩でヒートアップしてしまい, お互いに引くに引けない状況になってしまっている。",
        "mean": "그들은 싸움에서 열을 올려 서로 물러나고 싶어도 물러설 수 없는 상황이 되어 버렸다."
      },
      {
        "answer": "帰れない",
        "word": "連日の大雨で市内は冠水し, 帰るに帰れない。",
        "mean": "연일 계속되는 폭우로 시내는 침수되어 돌아가고 싶어도 돌아갈 수 없다."
      },
      {
        "answer": "言えない",
        "word": "経営には, 理屈でない, 目に見えない, 言うに言えない要因が働いて, 想像もできないような成果を生みだすことがある。",
        "mean":
            "경영에는 말도 안 되는, 눈에 보이지 않는, 말하고 싶어도 말할 수 없는 요인이 작용하여 상상도 할 수 없는 성과를 만들어 낼 수 있다."
      },
      {
        "answer": "断れなくなった",
        "word": "土下座までしてお願いされたために, 断るに断れなくなった。",
        "mean": "무릎까지 꿇고 부탁을 받았기 때문에 거절하고 싶어도 거절할 수 없게 되었다."
      },
      {
        "answer": "逃げられない",
        "word": "敵に四方を囲まれて, 逃げるに逃げられない。",
        "mean": "적에게 사방이 둘러싸여 도망가고 싶어도 도망갈 수 없다."
      }
    ]
  },
  {
    "id": 90,
    "grammar": "限りだ",
    "means": "너무~하다\n따름이다\n짝이 없다\n그지없다",
    "description": "감정을 나타내는 단어에 접속하는 경우에는 그 정도를 강조",
    "connectionWays": "주로 감정을 나타내는 형용사의 사전형",
    "examples": [
      {"answer": "限りだ", "word": "嬉しい限りだ", "mean": "너무 기쁘다"},
      {"answer": "限りだ", "word": "うっとうしい限りだ", "mean": "너무 울적하다"},
      {
        "answer": "限りだ",
        "word": "彼, 宝くじが当たるなんて羨ましい限りだ。",
        "mean": "그 사람 복권에 당첨되다니 부러울 따름이다."
      },
      {
        "answer": "限りだ",
        "word": "信頼していた人に裏切られ, 悲しい限りだ。",
        "mean": "믿었던 사람에게 배신당하고 슬플 따름이다."
      },
      {
        "answer": "限りだ",
        "word": "一人こんなところで待たされ, 心細い限りだ。",
        "mean": "혼자 이런 곳에서 기다리게 되어 불안하기 짝이 없다."
      },
      {
        "answer": "限りです",
        "word": "わざわざ来ていただいて嬉しい限りです。",
        "mean": "일부러 와 주셔서 기쁘기 그지없습니다."
      },
      {
        "answer": "限りだ",
        "word": "この街に再び活気が戻ってきたことは喜ばしい限りだ。",
        "mean": "이 거리에 다시 활기가 돌아온 것은 기쁘기 그지없다."
      },
      {
        "answer": "限りだ",
        "word": "日米首脳会談のため街中が警察に溢れ, 鬱陶しい限りだ。",
        "mean": "미일 정상회담 때문에 거리가 경찰로 넘쳐 울적하기 짝이 없다."
      },
      {
        "answer": "限りです",
        "word": "誤字があって恥ずかしい限りです。",
        "mean": "오타가 있어서 창피할 따름입니다."
      },
      {
        "answer": "限りです",
        "word": "多くの人に私の作品を評価していただき, 本当にありがたい限りです。",
        "mean": "많은 사람들이 제 작품을 평가해 주셔서 정말 감사할 따름입니다."
      }
    ]
  },
  {
    "id": 91,
    "grammar": "숫자 + 限りだ",
    "means": "~뿐이다",
    "description": "수량이 한정적임을 나타낸다.\n\n수량이 0이 되면 일이 끝날 때 자주 사용된다.",
    "connectionWays": "숫자 + 조수사 + 限りだ",
    "examples": [
      {
        "answer": "限りです",
        "word": "この商品はお一人様おひとつ限りです。",
        "mean": "이 상품은 1인당 하나뿐입니다."
      },
      {
        "answer": "限り",
        "word": "ただいま特売中で, 先着１００個限りとなっております。",
        "mean": "지금 특매중이라 선착순 100개 한정입니다."
      },
      {"answer": "限り", "word": "在庫限り販売終了といたします。", "mean": "재고에 한해 단종하겠습니다."},
      {
        "answer": "限りです",
        "word": "数に限りがございますのでお一人様１つ限りです。",
        "mean": "수량이 한정되어 있기 때문에 1인당 1개 한정입니다."
      },
      {
        "answer": "限り",
        "word": "この花の可憐さもあと３日限りの命かな。",
        "mean": "이 꽃의 가련함도 앞으로 3일 남은 생명일까."
      },
      {
        "answer": "限り",
        "word": "お一人様１点限りの商品を入退店を繰り返し何個も買う。",
        "mean": "1인당 1개 한정의 상품을 입퇴점을 반복해서 여러 개 산다."
      },
      {
        "answer": "限り",
        "word": "２０個限定, お一人様１個限りなので早い者勝ちです。",
        "mean": "20개 한정, 1인당 1개 한정이므로 빠른 사람이 승리합니다."
      },
      {"answer": "限り", "word": "人生はたった１回限りだ。", "mean": "인생은 단 한 번뿐이다."}
    ]
  },
  {
    "id": 92,
    "grammar": "~たが最後 / ~たら最後",
    "means": "일단 ~했다 하면 (만약 ~와 같은 것을 하면)",
    "description":
        "했다가는 안 좋은 상황이 지속된다.\n\n앞 내용이 발생하면 반드시 뒷 내용이 발생함을 나타내는 가정의 문법.\n\n뒷 내용은 원칙적으로 나쁜 것으로 비극적, 절망적인 것이 서술된다.",
    "connectionWays": "동사 과거형\n동사 가정법 (たら)",
    "examples": [
      {
        "answer": "たら最後",
        "word": "何も分かってないくせに意見を言うなど差し出がましい行為は慎むべきだ。",
        "mean": "일단 갔다 하면 마지막 최소 3년은 못 돌아올 거야."
      },
      {
        "answer": "たが最後",
        "word": "自宅まで来る宗教勧誘の人は基本押しつけがましい。",
        "mean": "그것은 닿으면 온몸에 심한 통증이 엄습해 올 정도로 위험한 식물이다."
      },
      {
        "answer": "たら最後",
        "word": "彼は自分からお礼を求めてくる恩着せがましいやつだ。",
        "mean": "그는 게임을 일단 시작하면 마지막, 밥도 화장실도 가지 않을 정도로 몰두하고 만다."
      },
      {
        "answer": "たが最後",
        "word": "いつまでも元カノのことを引きずる男は未練がましくて男らしくない。",
        "mean": "신뢰관계는 잃게 되면 끝내 되찾기는 어렵다."
      },
      {
        "answer": "たら最後",
        "word": "浮気も不倫もバレたら最後だ。",
        "mean": "바람도 불륜도 들키면 마지막이다."
      },
      {
        "answer": "たら最後",
        "word": "この曲は一度聴いたら最後, 忘れる事ができなくなるくらい中毒性が高い。",
        "mean": "이 곡은 한 번 듣게 되면, 잊을 수 없을 정도로 중독성이 높다."
      },
      {
        "answer": "たら最後",
        "word": "このアニメは見たら最後, 終わりまで見ないと気が済まなくなる。",
        "mean": "이 애니메이션은 보면 끝, 끝까지 봐야 직성이 풀린다."
      },
      {"answer": "たら最後", "word": "二度寝したら最後。", "mean": "일단 두 번 잤다 하면"},
      {
        "answer": "たが最後",
        "word": "人生は山登りのようなもの。上に着いたが最後, たちまち下りが見える。",
        "mean": "인생은 등산과 같다.위에 도착하면 금세 내리막길이 보인다."
      },
      {
        "answer": "たが最後",
        "word": "この映画は見たが最後, 虚無感に苛まれる。",
        "mean": "이 영화는 봤지만 마지막 허무감에 시달린다."
      },
      {
        "answer": "たが最後",
        "word": "道を見失ったが最後, 死ぬまで彷徨うはめになるかもしれない。",
        "mean": "길을 잃었다 하면 죽을 때까지 방황해야 할지도 모른다."
      },
      {
        "answer": "たが最後",
        "word": "週末帰宅して鍵をかけたが最後, 仕事に出かける日まで部屋を出ない。",
        "mean": "주말 귀가해 자물쇠를 잠구기 했다 하면, 일하러 나가는 날까지 방을 나가지 않는다."
      },
      {
        "answer": "たら最後",
        "word": "ちょっと一息つこうと思って横になったら最後, 爆睡して気づいたら翌日だった。",
        "mean": "한숨 돌리려고 누었더니 폭잠을 자고 정신을 차려보니 다음날이었다."
      },
      {
        "answer": "たら最後",
        "word": "生まれたら最後。必ず誰かに迷惑がかかる。",
        "mean": "일단 태어났다 하면 반드시 누군가에게 폐가 된다."
      },
      {
        "answer": "たら最後",
        "word": "ケツが痛すぎてトイレに深く腰掛けたら最後, 立ち上がることができない。",
        "mean": "양동이가 너무 아파서 화장실에 깊숙이 걸터 앉았다 하면 마지막에 일어날 수 없다."
      }
    ]
  },
  {
    "id": 93,
    "grammar": "かたがた",
    "means": "~할 겸",
    "description":
        "두 가지 목적을 나타내는 문법.\n\n뒷 내용이 주된 목적이고, 앞 내용은 후건에 부수되는 부차적인 목적\n\n딱딱한 표현으로 윗사람에게 인사, 편지, 감사, 문안, 보고, 사과 등에 사용함",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "かたがた",
        "word": "まず始めに書状にて, お礼かたがたご挨拶申し上げます。",
        "mean": "먼저 서장으로 감사 겸 인사를 드립니다."
      },
      {
        "answer": "かたがた",
        "word": "結婚の報告かたがた, 一度お伺い致します。",
        "mean": "결혼 보고 겸 한번 찾아뵙겠습니다."
      },
      {
        "answer": "かたがた",
        "word": "お仕事かたがた, 東京観光にいらして下さい。",
        "mean": "일하시는 겸 도쿄 관광하러 오세요."
      },
      {
        "answer": "かたがた",
        "word": "まずはお詫びかたがた, お願い申し上げます。",
        "mean": "우선 사과 드리는 겸 부탁드립니다."
      },
      {
        "answer": "かたがた",
        "word": "共同募金のご報告かたがた厚くお礼申し上げます。",
        "mean": "공동 모금을 보고 겸 깊은 감사의 말씀을 드립니다."
      }
    ]
  },
  {
    "id": 94,
    "grammar": "かたわら (1)",
    "means": "~하는 한편",
    "description":
        "직업적으로 어떤 일을 하면서 다른 일도 병행한다는 뜻\n\n일이나 학교 등 사회적 활동을 하면서 다른 것도 하고 있다는 것을 나타낸다\n\n[ついでに, ながら] 단기간에 두 가지 동작이 이루어지는 반면 [かたわら]는 장기간",
    "connectionWays": "동사 사전형\n명사 + の",
    "examples": [
      {
        "answer": "のかたわら",
        "word": "彼女はモデルのかたわら, 歌手でも活躍している。",
        "mean": "그녀는 모델이지만 가수로도 활약하고 있다."
      },
      {
        "answer": "かたわら",
        "word": "大学に通うかたわら, 会社の社長をしている。",
        "mean": "대학에 다니면서 회사 사장을 하고 있다."
      },
      {
        "answer": "のかたわら",
        "word": "母は家事のかたわら, ピアノを教えている。",
        "mean": "어머니는 집안일을 하면서 피아노를 가르치신다."
      },
      {
        "answer": "かたわら",
        "word": "会社に勤めるかたわら, 夜は家でも副業をしている。",
        "mean": "회사에 근무하면서 밤에는 집에서도 부업을 하고 있다."
      },
      {
        "answer": "かたわら",
        "word": "彼は小説家のかたわら, ボランティアなどの慈善活動にも熱心だ。",
        "mean": "그는 소설가인 반면 자원봉사 등 자선활동에도 열심이다."
      },
      {
        "answer": "かたわら",
        "word": "私は本業のかたわらブログを書いています。",
        "mean": "저는 본업인 한편 블로그를 쓰고 있습니다."
      },
      {
        "answer": "かたわら",
        "word": "就職してからは勤務するかたわら, 小説を書いていました。",
        "mean": "취직하고 나서는 근무하면서 소설을 쓰고 있었어요."
      },
      {
        "answer": "かたわら",
        "word": "農業のかたわらバンド活動しています。",
        "mean": "농사를 짓는 한편 밴드 활동을 하고 있습니다."
      }
    ]
  },
  {
    "id": 95,
    "grammar": "かたわら (2)",
    "means": "~하면서 한편으론",
    "description":
        "두 사물을 대비시키는 문법\n\n[かたわら]는 원래 공간의 [そば, 近く]를 뜻하는 말인데, 이 용법은 공간적으로 인접해 있는 것뿐만 아니라 시간적으로 인접해 있는 것에도 사용할 수 있다",
    "connectionWays": "동사 사전형\n명사 + の",
    "examples": [
      {
        "answer": "かたわら",
        "word": "富裕層が高級マンションで贅沢な暮らしをするかたわら, その目下には明日の住む場所や食べるものに困る貧困層もいる。",
        "mean": "부유층이 고급 아파트에서 호화롭게 사는 반면 그 아랫목에는 내일 살 곳이나 먹을 것이 곤란한 빈곤층도 있다."
      },
      {
        "answer": "かたわら",
        "word": "オリンピックのかたわら緊急事態宣言って変だと思いませんか。",
        "mean": "올림픽 때 비상사태 선포가 이상하다고 생각하지 않나요?"
      },
      {
        "answer": "かたわら",
        "word": "私が夜９時くらいに帰宅するかたわら, 夫は家でゴロゴロテレビを見ている。",
        "mean": "내가 밤 9시쯤 귀가하는 한편 남편은 집에서 뒹굴뒹굴 TV를 보고 있다."
      },
      {
        "answer": "かたわら",
        "word": "友達が海で遊んでいるかたわら, 私は砂浜のベンチでビールを飲んでそれを見ていた。",
        "mean": "친구가 바다에서 놀고 있는 한편 나는 모래사장 벤치에서 맥주를 마시고 그것을 보고 있었다."
      },
      {
        "answer": "かたわら",
        "word": "父が頑張って仕事をしているかたわら, 私たちはこっそり焼肉に行っていました。",
        "mean": "아버지가 열심히 일하시는 한편 우리는 몰래 불고기를 하러 갔습니다."
      },
      {
        "answer": "かたわら",
        "word": "スマホの普及はその利便性のかたわら, 健康被害も実際に出ている。",
        "mean": "스마트폰의 보급은 그 편리성의 한편, 건강 피해도 실제로 나오고 있다."
      },
      {
        "answer": "かたわら",
        "word": "日本の学校教育は個性を大切にするかたわらで, 標準と異なることを戒める。",
        "mean": "일본의 학교 교육은 개성을 중요시 하는 한편 표준과 다름을 훈계한다."
      },
      {
        "answer": "かたわら",
        "word": "彼女は猫を可愛がるかたわら, 犬に対してはなぜか冷たい。",
        "mean": "그녀는 고양이를 귀여워하는 한편 개에 대해서는 왠지 차갑다."
      }
    ]
  },
  {
    "id": 96,
    "grammar": "が早いか",
    "means": "하자마자",
    "description": "화자의 의지가 들어가 있지 않음\n\n앞뒤 동작이 거의 동시에 발생하고 있음을 강조",
    "connectionWays": "동사 사전형\n동사 과거형",
    "examples": [
      {
        "answer": "が早いか",
        "word": "チャイムが鳴るが早いか, 生徒たちは教室を飛び出していった。",
        "mean": "초인종이 울리지마자 학생들은 교실을 뛰쳐나갔다."
      },
      {
        "answer": "が早いか",
        "word": "電話が来るが早いか, 緊張で手が震え出した。",
        "mean": "전화가 오자 마자 긴장으로 손이 떨리기 시작했다."
      },
      {
        "answer": "が早いか",
        "word": "お金を手にするが早いか, どこかへ遊びに行った。",
        "mean": "돈을 벌자마자 어디론가 놀러갔다."
      },
      {
        "answer": "が早いか",
        "word": "あの鷹は獲物を捕まえるが早いか, すぐ飛び立っていった。",
        "mean": "저 매는 사냥감을 잡자마자 금방 날아올랐다."
      },
      {
        "answer": "が早いか",
        "word": "その言葉を聞くが早いか, 嬉しさのあまり泣き出してしまった。",
        "mean": "그 말을 듣자마자 기쁜 나머지 울음을 터뜨리고 말았다."
      },
      {
        "answer": "が早いか",
        "word": "極度の疲れからか, ベッドに入るが早いか, すぐ寝付いてしまった。",
        "mean": "극도의 피로 때문인지 침대에 들어가자마자 잠이 들었다."
      },
      {
        "answer": "が早いか",
        "word": "帰宅してカバンを玄関に置くが早いか, また飛び出して行った。",
        "mean": "귀가해서 가방을 현관에 두자마자 다시 뛰쳐나갔다."
      },
      {
        "answer": "が早いか",
        "word": "出会うが早いか, すぐお互いを抱き締め合った。",
        "mean": "만나자마자 서로를 부둥켜안았다."
      }
    ]
  },
  {
    "id": 97,
    "grammar": "~からある / からいる / からする / からの",
    "means": "이나 되는",
    "description":
        "금액, 인원, 크기, 길이, 높이, 무게, 넓이, 거리 등이 대략 그 정도이거나 그 이상임을 나타낸다\n\n[~以上の] 거의 같은 의미\n\n[ からする ] : 금액의 크기나 가치를 나타내는 경우\n\n[ からの, からいる ] : 인원수를 나타내는 경우\n\n[ からある ] 그 이외의 수량을 나타내는 경우 ※예외도 다소 있음\n\n비슷한 표현으로 [ もの ] 가 있는데 [ もの ] 는 수량의 많음을 강조함.\n\n1. ３０万からするパソコンを買った。 (30만 이상) \n\n2.３０万のパソコンを買った。 (30만원 정도) \n\n3. ３０万ものパソコンを買った。 (”30만” 이라는 금액의 높이에 강조) \n\n비슷한 표현으로 [~からなる / からできている] 가 있는데 이는 량을 표현하는것이 아니라 그 구성재료를 표현하는것",
    "connectionWays": "숫자 (+조수사)",
    "examples": [
      {"answer": "からする", "word": "200万からする車を買った。", "mean": "200만이나 하는 차를 샀다."},
      {
        "answer": "からの",
        "word": "玉突き事故で20人からの人が怪我を負った。",
        "mean": "연쇄 추돌 사고로 20명 이상의 사람이 다쳤다."
      },
      {
        "answer": "からあ",
        "word": "500ｋｍからある距離を車で移動するのは疲れる。",
        "mean": "500km이나 되는 나는 거리를 차로 이동하는 것은 피곤해."
      },
      {
        "answer": "からある",
        "word": "連日の大雨で地盤が緩み, 5トンからある岩が山から落ちてきた。",
        "mean": "연일 계속되는 폭우로 지반이 느슨해지면서 5t이나 되는 나온 바위가 산에서 떨어져 나왔다."
      },
      {
        "answer": "からある",
        "word": "ここの原住民は１０ｍからある樹の上で生活している。",
        "mean": "이곳 원주민들은 10m 이나 되는 나무 위에서 생활하고 있다."
      },
      {
        "answer": "からする",
        "word": "この辺りは立地条件が良いので, 最も安いものでも家賃は１０万円からする。",
        "mean": "이 근처는 입지 조건이 좋아 가장 싼 것이라도 월세는 10만엔부터 한다"
      }
    ]
  },
  {
    "id": 98,
    "grammar": "きらいがある",
    "means": "하는 경향이 있다",
    "description":
        "부정적인 경향이 있다는 의미로 많이 쓰임\n대부분의 경우 사람의 성격이나 내면적인 특징에 대해 말할 때 사용된다.\n비슷한 문형 [がち] 는 그 횟수가 많은 것에 사용할 수 있지만, [きらいがある] 는 사용할 수 없다",
    "connectionWays": "명사 + の\n동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "きらいがある",
        "word": "彼は物事を独断で考えるきらいがある。",
        "mean": "그는 일을 독단적으로 생각하는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "現実を甘く見るきらいがある。",
        "mean": "현실을 우습게 보는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "今の子供は野菜をあまり食べないきらいがある。",
        "mean": "요즘 아이들은 야채를 잘 먹지 않는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "苦労知らずな人ほど, 他人を見下すきらいがある。",
        "mean": "고생 모르는 사람일수록 남을 깔보는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "小さいことからでも深く考えすぎるきらいがある。",
        "mean": "작은 것부터라도 너무 깊이 생각하는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "彼は人の言うことを何でも信じてしまうきらいがある。",
        "mean": "그는 남의 말을 무엇이든지 믿어 버리는 경향이 있다."
      },
      {
        "answer": "きらいがある",
        "word": "君は何でも頑張りすぎるきらいがあるから, そんな時は周りの人に頼ったらいい。",
        "mean": "너는 뭐든지 너무 열심히 하는 경향이 있으니까 그럴 때는 주변 사람에게 의지하면 돼."
      },
      {
        "answer": "きらいがある",
        "word": "自己評価が低すぎるきらいがあるが, それが彼の謙虚さに繋がっている。",
        "mean": "자기평가가 너무 낮은 경향이 있지만 그것이 그의 겸손으로 이어지고 있다."
      },
      {
        "answer": "きらいがある",
        "word": "Ａさんは他人の言葉に過剰に反応するきらいがある。",
        "mean": "A씨는 남의 말에 지나치게 반응하는 경향이 있다."
      }
    ]
  },
  {
    "id": 99,
    "grammar": "極まりない / 極まる",
    "means": "하기 짝이 없다\n너무~하다",
    "description":
        "극한의 정도를 나타내며 부정적인 느낌에서 자주 사용\n\n[感極まる] 는 매우 감동하는 것을 나타내는 관용 표현\n\nきわまりない / きわまる 라고 발음한다",
    "connectionWays":
        "な형용사 어간 + (なこと) + 極まりない / 極まる\n\nな형용사 어간 + (であること) + 極まりない / 極まる\n\nい형용사 보통형 + こと + 極まりない / 極まる",
    "examples": [
      {
        "answer": "極まりない",
        "word": "一日何時間もゲームをするのは不健全なこと極まりない。",
        "mean": "하루에 몇 시간씩 게임을 하는 것은 불건전하기 짝이 없다."
      },
      {
        "answer": "極まりない",
        "word": "彼の失礼極まりない態度に我慢できなかった。",
        "mean": "그의 무례하기 짝이 없는 태도를 참을 수가 없었다."
      },
      {"answer": "感極まって", "word": "感極まって泣き出した。", "mean": "너무 감격해서 울기 시작했다."},
      {
        "answer": "極まる",
        "word": "法定速度を守らないのは危険極まる行動だ。",
        "mean": "법정 속도를 지키지 않는 것은 위험천만한 행동이다."
      },
      {
        "answer": "極まりない",
        "word": "初対面なのにあの態度は失礼極まりない。",
        "mean": "초면인데 저 태도는 무례하기 짝이 없다."
      },
      {
        "answer": "極まりない",
        "word": "迷惑極まりない路上駐車を早く取り締まってほしい。",
        "mean": "민폐기 짝이 없기는 노상주차를 빨리 단속했으면 좋겠다."
      },
      {
        "answer": "極まりない",
        "word": "あの人, ずっと下ネタ言ってて不愉快極まりない。",
        "mean": "저 사람 계속 뒷담화해서 불쾌하기 짝이 없어."
      },
      {
        "answer": "極まりない",
        "word": "高層ビルなのにエレベーターが故障していて不便極まりない。",
        "mean": "고층 빌딩인데 엘리베이터가 고장나서 불편하기 짝이 없다."
      },
      {
        "answer": "極まりない",
        "word": "ドーナツにチョコレート, そしてコーラ。不健康極まりないけど不健康なものほど美味しい。",
        "mean": "도넛에 초콜릿 그리고 콜라.건강에는 매우 좋지 않지만 건강에 좋지 않은 것일수록 맛있어."
      },
      {
        "answer": "極まりない",
        "word": "社会とは理不尽極まりないものだ。",
        "mean": "사회란 불합리하기 짝이 없는 것이다."
      },
      {
        "answer": "極まりない",
        "word": "部員のうちたった一人が感染しただけでチーム全体が棄権しなければならないなんて残念極まりない。",
        "mean": "부원 중 단 한 명만 감염됐을 뿐 팀 전체가 기권해야 하다니 안타깝기 짝이 없다."
      },
      {
        "answer": "極まりない",
        "word": "恥ずかしいこと極まりない。穴があったら入りたい。",
        "mean": "부끄럽기 짝이 없다.구멍이 있으면 들어가고 싶다."
      },
      {
        "answer": "極まりない",
        "word": "彼の主張を一通り確認したが, 幼稚なこと極まりないものだった。",
        "mean": "그의 주장을 대충 확인했지만 유치하기 짝이 없었다."
      },
      {
        "answer": "極まりない",
        "word": "遅刻の理由を聞いたら, 彼は[ 自転車に乗り遅れたので遅刻しました ]などと意味不明で異常極まりない言い訳をしてきた。",
        "mean": "지각 이유를 묻자 그는 자전거를 놓쳐서 지각했다는 등 의미가 불분명하고 비정상적이기 짝이 없는 변명을 해왔다."
      },
      {
        "answer": "極まりない",
        "word": "本質を知ろうとせずに表面的に批判する行為は愚かであること極まりない。",
        "mean": "본질을 알려고 하지 않고 표면적으로 비판하는 행위는 어리석기 짝이 없다."
      },
      {
        "answer": "極まりない",
        "word": "無能極まりない上司の下では部下は育たない。",
        "mean": "무능하기 짝이 없는 상사 밑에서는 부하가 자라지 않는다."
      }
    ]
  },
  {
    "id": 100,
    "grammar": "~ごとき / ごときに / ごときが / ごときで",
    "means": "고작~따위\n고작~같은게",
    "description":
        "사람이나 사물을 나타내는 명사에 대해 대상을 폄하하는 말을 강조.\n\n자신을 나타내는 말에 붙으면 겸손의 의미가 된다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ごときが",
        "word": "お前ごときが私に勝てるわけがない。",
        "mean": "네놈 같은게 나를 이길 리가 없어."
      },
      {
        "answer": "ごときに",
        "word": "なぜ１杯の水ごときに１０００円も払わなければいけないのか。",
        "mean": "왜 겨우 물 한 잔에 1000엔이나 내야 할까."
      },
      {
        "answer": "ごときが",
        "word": "神殿の中は私ごときが立ち入ってはいけない場所だ。",
        "mean": "신전 안은 사사로운 사람이 들어서서는 안 되는 곳이다."
      },
      {
        "answer": "ごときに",
        "word": "ここ数日, 口内炎ごときにこんなにも苦しめられている。",
        "mean": "요 며칠 동안 구내염 같은게 있을 때 이렇게 고통받고 있다."
      },
      {
        "answer": "ごときに",
        "word": "AIごときに人類の未来は託せない。",
        "mean": "AI 같은것에 인류의 미래는 맡길 수 없다."
      },
      {
        "answer": "ごときに",
        "word": "俺の気持ちがお前ごときに分かるものか。",
        "mean": "내 마음을 네놈 따위가 어떻게 알아."
      },
      {
        "answer": "ごときに",
        "word": "大人が小学生ごときにムキになるな。",
        "mean": "어른이 초등학생 따위에게 짜증나지 마라."
      },
      {
        "answer": "ごときで",
        "word": "彼女とラーメン屋に来たんだけど, ラーメンごときですごい喜んでくれて私も嬉しくなった。",
        "mean": "여자친구랑 라면집에 왔는데 라면 같은 것으로 너무 좋아해줘서 나도 기뻐졌어."
      },
      {
        "answer": "ごときに",
        "word": "たかがゲームごときにムキになるな。",
        "mean": "고작 게임 같은거에 기분 나빠지지 마라."
      },
      {
        "answer": "ごときで",
        "word": "皿洗いごときでお湯を無駄使いするな。",
        "mean": "고작 설거지 할 때 뜨거운 물을 낭비하지 마라."
      },
      {
        "answer": "ごときに",
        "word": "こんな広い世界で自分ごときに何ができる？",
        "mean": "이렇게 넓은 세상에서 나 같은게 할 수 있는 일은 무엇인가?"
      },
      {
        "answer": "ごときに",
        "word": "そんな事言われても俺ら一般市民ごときに何が出来るんだ。",
        "mean": "그런 말을 들어도 고작 우리 같은 일반 시민이 뭘 할 수 있어."
      },
      {
        "answer": "ごときに",
        "word": "そんな発想, 私ごときにできませんよ！",
        "mean": "그런 발상은 저 같은게 할 수 없어요!"
      }
    ]
  },
  {
    "id": 101,
    "grammar": "~如き / 如く / 如し",
    "means": "~같은 /~같게 /~같다",
    "description": "고어 비유의 문법\n\n如 는 ごと 로 읽으며 현대체의 비유의 よう와 비슷하다",
    "connectionWays":
        "동사 사전형 + が + 如き + 명사\n동사 사전형 + かの + 如き + 명사\n동사 과거형 + が + 如き + 명사\n동사 과거형 + かの + 如き + 명사\n명사 + の + 如き + 명사",
    "examples": [
      {"answer": "ごとく", "word": "汗が滝のごとく流れ出す。", "mean": "땀이 폭포수처럼 흐르기 시작하다."},
      {
        "answer": "ごとく",
        "word": "何事もないかのごとく振る舞った。",
        "mean": "아무 일도 없는 것처럼 행동했다."
      },
      {
        "answer": "如く",
        "word": "至福の時間は夢の如く早く過ぎる。",
        "mean": "행복한 시간은 꿈처럼 빨리 지나간다."
      },
      {"answer": "如し", "word": "光陰矢の如し", "mean": "광음 화살과 같다."},
      {
        "answer": "如く",
        "word": "疾きこと風の如く, 徐かなること林の如く, 侵掠すること火の如く, 動かざること山の如し",
        "mean": "벌써 바람과 같이, 서린 것과 같이, 침습하는 것은 불처럼, 움직이지 않는 것은 산과 같다."
      },
      {"answer": "如し", "word": "過ぎたるは及ばざるが如し。", "mean": "지나침은 미치지 못하는 것과 같다."},
      {"answer": "如き", "word": "業火の如き猛攻。", "mean": "업화 같은 맹공"},
      {"answer": "如き", "word": "疾風が如き速さで走り去る。", "mean": "질풍이 같은 속도로 달려가다."}
    ]
  },
  {
    "id": 102,
    "grammar": "こととて",
    "means": "~이라서",
    "description":
        "이유를 나타내는 문법.\n\n의미는 [~だから] 같지만 좀 더 약간 딱딱한 표현.\n\n[急なこととて]는 관용 표현\n\n동사의 부정형은 [~ぬ] 를 사용하는 경우도 있다.\n\n사과나 허가를 받는 것과 같은 상황에서 자주 사용된다",
    "connectionWays": "동사 ない형\n명사 + の",
    "examples": [
      {
        "answer": "こととて",
        "word": "７年前のこととて, 何も憶えてない。",
        "mean": "7년 전 일이라서 아무것도 기억나지 않아."
      },
      {
        "answer": "こととて",
        "word": "戦時中のこととて少年は甘いものに飢えていた。",
        "mean": "전쟁 중의 일이라서 소년은 단 것에 굶주려 있었다."
      },
      {
        "answer": "こととて",
        "word": "小さい地震なら日本人はいつものこととて全く動じない。",
        "mean": "작은 지진이라면 일본인은 평소의 일이라 전혀 동요하지 않는다."
      },
      {
        "answer": "こととて",
        "word": "急なこととて何のおもてなしもできず申し訳ありません。",
        "mean": "급한 일이라서 아무 대접도 못해 죄송합니다."
      },
      {
        "answer": "こととて",
        "word": "週末のこととて, 幹線道路は渋滞が始まっていた。",
        "mean": "주말이라서 간선도로는 정체가 시작되고 있었다."
      },
      {
        "answer": "こととて",
        "word": "深夜のこととて, 昼間はうるさい蟬も静まりかえっている。",
        "mean": "심야의 일이라서 해서 낮에는 시끄럽다 해도 조용하다."
      },
      {
        "answer": "こととて",
        "word": "当時のこととて新幹線もなく, 青森から東京へは丸一日かかった。",
        "mean": "당일의 일이라서 신칸센도 없었고 아오모리에서 도쿄까지는 꼬박 하루가 걸렸다."
      },
      {
        "answer": "こととて",
        "word": "普段話すことはないが, 隣人のこととて放ってはおけない。",
        "mean": "평소 할 말은 없지만 이웃 이라서 내버려둘 수는 없다."
      },
      {
        "answer": "こととて",
        "word": "慣れないこととて, レシピを見ても上手には作れなかった。",
        "mean": "익숙하지 않다고 레시피를 보고도 잘 만들지 못했다."
      },
      {
        "answer": "こととて",
        "word": "こちらが知らぬこととて, ご迷惑おかけいたしました。",
        "mean": "저희가 모르는 일이라 폐를 끼쳤습니다."
      }
    ]
  },
  {
    "id": 103,
    "grammar": "始末だ",
    "means": "~형편이다\n~꼴이다\n~모양이다",
    "description":
        "안 좋은 일이 계속되고 결국 안 좋은 결과가 되었음을 나타낸다.\n화자의 안타까운 마음이 포함된다.\n\n[あげく ~始末だ, 挙句の果てに~始末だ] 등 문형이 되는 경우가 있다.\nしまつだ 라고 발음한다",
    "connectionWays":
        "동사 사전형 + 始末だ\n동사 ない형 + 始末だ\nこの + 始末だ\nその + 始末だ\nあの + 始末だ",
    "examples": [
      {
        "answer": "始末だ",
        "word": "昨晩飲み過ぎたせいでこの始末だ。",
        "mean": "어젯밤 과음하는 바람에 이 꼴이다."
      },
      {
        "answer": "始末だ",
        "word": "遅刻した上にペンすら持ってこず, 更に居眠りまでする始末だ。",
        "mean": "지각한 데다 펜조차 가져오지 않고 심지어 졸기까지 하는 형편이다."
      },
      {
        "answer": "始末だ",
        "word": "自分で不倫をしておきながら謝りもせず開き直る始末だ。",
        "mean": "스스로 불륜을 저질러 놓고 사과도 하지 않고 다시 화를 내는 형편이다."
      },
      {
        "answer": "始末だ",
        "word": "眠くて眠くて授業もほとんど寝ちゃう始末だ。",
        "mean": "졸리고 졸려서 수업도 거의 다 자버릴 지경이다."
      },
      {
        "answer": "始末だ",
        "word": "誰一人覚えておらず, みんな忘れる始末だ。",
        "mean": "누구 하나 기억하지 못하고 모두 잊어버릴 지경이다."
      },
      {
        "answer": "始末だ",
        "word": "今の４０代５０代は驕り高ぶっていて, 何かあればすぐ若者の文句を言う始末だ。",
        "mean": "요즘 40대 50대는 교만하고 무슨 일이 생기면 바로 젊은이들의 불평을 늘어놓기 마련이다."
      },
      {
        "answer": "始末だ",
        "word": "私がやったものだと勘違いされ, 最後は謝れとまで言われる始末だ。",
        "mean": "내가 한 것으로 착각해 마지막에는 사과하라는 말까지 들을 지경이다."
      },
      {
        "answer": "始末だ",
        "word": "あれほど忘れるなと言ったのに, 結局忘れてくる始末だ。",
        "mean": "그토록 잊지 말라고 했는데 결국 잊어버리고 오는 형편이다."
      },
      {
        "answer": "始末",
        "word": "早く涼しくなるのを願っていたが, 今度は雨で洗濯物が乾かない始末。",
        "mean": "빨리 시원해지길 바랐지만 이번에는 비로 빨래가 마르지 않을 지경."
      },
      {
        "answer": "始末",
        "word": "あそこの医者はこっちがあれこれ聞かないと検査の結果も教えてくれない始末。患者を舐めてる。",
        "mean": "저기 의사는 이쪽이 이것저것 물어봐야 검사 결과도 알려주는 형편이야.환자를 핥고 있어."
      },
      {
        "answer": "始末だ",
        "word": "デッサン能力がなくて筋肉も関節も不自然。何を描いてもその始末だ。",
        "mean": "데생 능력이 없어서 근육도 관절도 부자연스러워.뭘 그려도 그 지경이다."
      },
      {
        "answer": "始末",
        "word": "多額の税金を使ってあの始末。もう現政権には何も期待しない。",
        "mean": "많은 세금을 써서 저 지경.이제 현 정부에는 아무것도 기대하지 않는다."
      }
    ]
  },
  {
    "id": 104,
    "grammar": "ずくめ",
    "means": "~일색\n~투성이\n~이 계속해서 생김",
    "description":
        "전체적으로 [そればかりであること] 를 표현\n\n[ いいとこずくめ, 悪いことずくめ, 黒ずくめ ] 등 관용적으로 사용 된다\n\n한자는 [尽くめ]",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ずくめ",
        "word": "防犯カメラに写っている黒ずくめの男が犯人だ。",
        "mean": "CCTV에 찍힌 거무스름한 남자가 범인이다."
      },
      {
        "answer": "ずくめ",
        "word": "今年は幸せずくめの一年だった。",
        "mean": "올해는 행복이 가득한 한 해였다."
      },
      {
        "answer": "ずくめ",
        "word": "しかし人生は良いことずくめではない。",
        "mean": "그러나 인생은 좋은 것뿐이 아니다."
      },
      {"answer": "ずくめ", "word": "ご馳走ずくめの晩ご飯。", "mean": "진수성찬 저녁밥"},
      {"answer": "ずくめ", "word": "仕事ずくめで休む暇がない。", "mean": "일로 쉴 틈이 없다."},
      {
        "answer": "ずくめ",
        "word": "来週は３連休だしその次はお盆休みだし８月は良い事ずくめだ！",
        "mean": "다음주는 3일 연휴고 그다음은 추석이고 8월은 좋은 일만 가득해!"
      },
      {
        "answer": "ずくめ",
        "word": "2021年は記録ずくめのオリンピックだった。",
        "mean": "2021년은 기록이 가득한 올림픽이었다."
      },
      {"answer": "ずくめ", "word": "昼も夜も働きずくめ。", "mean": "밤낮으로 일 투성이"},
      {
        "answer": "ずくめ",
        "word": "全身ブランドずくめの人は品がないと思う。",
        "mean": "전신 명품만 있는 사람은 품위가 없는 것 같아."
      }
    ]
  },
  {
    "id": 105,
    "grammar": "ずにはおかない / ないではおかない (1)",
    "means": "~하게 된다\n~하지 않을 수 없다",
    "description":
        "본인의 의지와 상관없이 자연스럽게 그 감정이나 행동이 야기된다을 나타낸다.\n\n감정, 심리를 나타내는 동사에 붙을 때는 사역형이 되는 경우많다.\n\n[する]는 [せずにはおかない, しないではおかない] 가 된다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "ずにはおかない",
        "word": "私たちの劇団には人を引き付けずにはおかない魅力的な演技ができる俳優がたくさんいます。",
        "mean": "우리 극단에는 사람을 끌어당기는 매력적인 연기를 할 수 있는 배우들이 많이 있습니다."
      },
      {
        "answer": "ずにはおかない",
        "word": "実話に基づいた親子の愛を描くこの物語は人を感動させずにはおかないだろう。",
        "mean": "실화를 바탕으로 부모와 자식의 사랑을 그리는 이 이야기는 사람을 감동시키지 않을 수 없을 것이다."
      },
      {
        "answer": "ずにはおかない",
        "word": "近年の異常気象は, 環境問題の深刻さについて考えさせずにはおかない。",
        "mean": "최근의 이상기후는 환경문제의 심각성에 대해 생각하게 하지 않을 수 없다."
      },
      {
        "answer": "ずにはおかない",
        "word": "その見た目から漂う高級感と精巧に作られたフォルム。腕時計好きを魅了せずにはおかない。",
        "mean": "그 외형에서 풍기는 고급스러움과 정교하게 만들어진 형태.손목시계 좋아하는 사람을 매료시키지 않을 수 없다."
      },
      {
        "answer": "ずにはおかない",
        "word": "スポーツは見る者に驚嘆や感銘を与えずにはおかない。",
        "mean": "스포츠는 보는 사람에게 경탄이나 감명을 주지 않을 수 없다."
      },
      {
        "answer": "ずにはおかない",
        "word": "戦ったもの同士が健闘を讃え抱き合う姿は人の涙を誘わずにはおかないものだ。",
        "mean": "싸운 사람들끼리 건투를 찬양하고 서로 껴안는 모습은 남의 눈물을 자아내지 않을 수 없는 법이다."
      },
      {
        "answer": "ずにはおかない",
        "word": "そのピアニズムは聴く者を感動させずにはおかない。",
        "mean": "그 피아니스트는 듣는 사람을 감동시키지 않을 수 없다."
      },
      {
        "answer": "ずにはおかない",
        "word": "癌とは, 誰もに死を意識させずにはおかない病だ。",
        "mean": "암은 누구나 죽음을 의식하지 않을 수 없는 병이다."
      }
    ]
  },
  {
    "id": 106,
    "grammar": "ずにはおかない / ないではおかない (2)",
    "means": "반드시 ~하고야 말겠다",
    "description":
        "동작을 나타내는 동사에 대해 화자의 강한 의지를 나타낸다.\n\n[する]는 [せずにはおかない, しないではおかない] 가 된다",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "ずにはおかない",
        "word": "石油価格の高騰は今後の国民生活に影響を及ぼさずにはおかないだろう。",
        "mean": "유가 급등은 향후 민생에 영향을 미치지 않을 수 없을 것이다."
      },
      {
        "answer": "ずにはおかない",
        "word": "うちのチームは守備に弱点があるので, 相手はそこを攻めずにはおかないはずだ。",
        "mean": "우리 팀은 수비에 약점이 있기 때문에 상대는 반드시 거기를 공격할 것이다"
      },
      {
        "answer": "ないではおかない",
        "word": "こんなに酷いことをされたのだから, 絶対に謝らせないではおかない。",
        "mean": "이렇게 심한 일을 당했으니 반드시 사과 시키겠어"
      },
      {
        "answer": "ずにはおかない",
        "word": "やられたらやり返せずにはおかない。",
        "mean": "당하면 반드시 되받아치고 말겠다"
      },
      {
        "answer": "ずにはおかない",
        "word": "不正は罰せずにはおかない。",
        "mean": "부정은 반드시 벌하고야 말겠다"
      },
      {
        "answer": "ずにはおかない",
        "word": "私はあいつらに仕返しせずにはおかない。",
        "mean": "나는 반드시 그들에게 복수하고 말겠어 "
      },
      {
        "answer": "ずにはおかない",
        "word": "彼女は人の笑顔の裏にあるものを見通さずにはおかない鋭い観察力を持っている。",
        "mean": "그녀는 남의 웃는 얼굴 뒤에 있는 것을 내다보게 하는 날카로운 관찰력을 가지고 있다."
      },
      {
        "answer": "ずにはおかない",
        "word": "限定品だから何としても手に入れずにはおかない。",
        "mean": "한정품이라 어떻게든 반드시 구하고 말겠다"
      }
    ]
  },
  {
    "id": 107,
    "grammar": "すら",
    "means": "조차",
    "description":
        "최소한을 나타내는 문법.\n\n대부분의 경우 좋지 않은 일에 사용.\n\n최소한의 일을 할 수 없는 등 대상에 대한 멸시나 경시의 감정이 포함되는 것이 특징\n\n뒷 문장에는 부정형이 호응한다.",
    "connectionWays": "명사 + (조사) + すら~ない\n동사 て형 + すら ~ ない\n",
    "examples": [
      {
        "answer": "すら",
        "word": "体調が悪くて水すら喉を通らない。",
        "mean": "몸이 안 좋아서 물조차 목구멍을 통과하지 않는다."
      },
      {
        "answer": "すら",
        "word": "謝りたいけど会ってすらくれなくなった。",
        "mean": "사과하고 싶지만 만나주지도 않았다."
      },
      {
        "answer": "すら",
        "word": "残業続きで寝る時間すら確保できない。",
        "mean": "잔업이 계속되어 잘 시간조차 확보할 수 없다."
      },
      {
        "answer": "すら",
        "word": "本当に嫌いな奴には[ 嫌い ]という言葉すら出ない。",
        "mean": "정말 싫어하는 놈에겐 싫다는 말조차 안 나온다."
      },
      {"answer": "すら", "word": "眠くて足し算すらできない。", "mean": "졸려서 덧셈조차 못하다."},
      {
        "answer": "すら",
        "word": "起きてからまだ着替えてもないし, 顔も洗ってすらない。",
        "mean": "일어나서 아직 옷 갈아입지도 않았고 세수 조차 안 해."
      },
      {
        "answer": "すら",
        "word": "笑ってるところも可愛いが, 怒っているところすら可愛い。",
        "mean": "웃는 것도 귀엽지만 화난 것조차 귀여워."
      },
      {
        "answer": "すら",
        "word": "私はスマホすら満足に使えない機械音痴だ。",
        "mean": "나는 스마트폰조차 만족스럽게 사용할 수 없는 기계치야."
      },
      {
        "answer": "すら",
        "word": "料理したことはないし, 包丁すらも持ったことがない。",
        "mean": "요리해본 적도 없고 칼조차 들어본 적이 없어."
      },
      {
        "answer": "すら",
        "word": "冷静に話し合いすらできないようなら, 交渉はできません。",
        "mean": "냉정하게 대화조차 못할 것 같으면 협상은 할 수 없습니다."
      },
      {"answer": "すら", "word": "夢ですらモテない。", "mean": "꿈에서조차 인기가 없다."},
      {
        "answer": "すら",
        "word": "真面目にやっている人が損をするこの社会は, 正直おかしいとすら思っている。",
        "mean": "성실하게 하는 사람이 손해를 보는 이 사회는 솔직히 이상하다고까지 생각한다."
      }
    ]
  },
  {
    "id": 108,
    "grammar": "そばから",
    "means": "하는 족족\n하기 무섭게",
    "description":
        "앞 내용 뒤에 바로 뒷 내용이 발생함을 나타낸다.\n\n뒷 내용에는 안 좋은 말이 나올 때가 많다.\n\n또한 뒷 내용의 현상이 과거에 여러 번 반복적으로 발생했음을 나타낼 수 있는 것이 이 문형의 특징",
    "connectionWays": "동사 사전형\n동사 과거형",
    "examples": [
      {
        "answer": "そばから",
        "word": "食事したそばから食事したことを忘れる。",
        "mean": "식사하기 무섭게 식사한 것을 잊다."
      },
      {
        "answer": "そばから",
        "word": "[ 気をつけてね ]と言ったそばから怪我をした。",
        "mean": "조심하라고 말하기 무섭게 다쳤다."
      },
      {
        "answer": "そばから",
        "word": "教わったそばから忘れないようにちゃんとメモを取ろう。",
        "mean": "배운자 마자 잊지 않도록 잘 메모하자."
      },
      {"answer": "そばから", "word": "覚えたそばから忘れていく。", "mean": "외우는 족족 잊어가다."},
      {
        "answer": "そばから",
        "word": "注意してくださいと言われたそばから痴漢に遭った。",
        "mean": "주의하라는 말을 듣자마자 치한을 당했다."
      },
      {"answer": "そばから", "word": "作ったそばからつまみ食いされた。", "mean": "만드는 족족 잡아먹혔다."},
      {
        "answer": "そばから",
        "word": "痩せたいと言ったそばから焼きそばとラーメンを食べている。",
        "mean": "살을 빼고 싶다고 말하기 무섭게 야끼소바와 라면을 먹고 있다."
      },
      {
        "answer": "そばから",
        "word": "雪かきをするそばから雪が積もり始めている。",
        "mean": "눈을 치우는 족족 눈이 쌓이기 시작하고 있다."
      },
      {
        "answer": "そばから",
        "word": "私は飽きるスピードが速くて, 始めたそばからすぐ飽きてくる。",
        "mean": "나는 질리는 속도가 빨라서 시작하자마자 금방 질려."
      },
      {"answer": "そばから", "word": "読んだそばから忘れる。", "mean": "읽는 족족 잊다."},
      {
        "answer": "そばから",
        "word": "食べたそばからトイレ駆け込んで全部出ていく。",
        "mean": "먹은 족족 화장실 뛰어 들어가서 전부 배출한다."
      },
      {
        "answer": "そばから",
        "word": "アイスがあまりの暑さで買ったそばから溶けていく。",
        "mean": "아이스가 너무 더워서 사자 마자 녹아간다."
      },
      {
        "answer": "そばから",
        "word": "ワクチン打ったそばから腕が重くなった。",
        "mean": "백신 맞자 마자 팔이 무거워졌다."
      },
      {
        "answer": "そばから",
        "word": "膀胱炎つらい。トイレ行ったそばからもうトイレ行きたい。",
        "mean": "방광염 괴로워. 화장실 가자마자 벌써 화장실 가고 싶어."
      },
      {"answer": "そばから", "word": "洗車したそばから鳥の糞。", "mean": "세차하기 무섭게 새똥."}
    ]
  },
  {
    "id": 109,
    "grammar": "ただ~あるのみ / ただ~のみ",
    "means": "오직 ~할 뿐임",
    "description":
        "한정 문법. 해야 할 일이 하나밖에 없음을 나타낸다.\n\n[~するしかない] 로 바꿔 말할 수 있는데, [しかない] 는 화자의 비관적 뉘앙스가 포함되는 반면 [~あるのみだ] 는 화자의 적극적인 강한 의지를 나타낸다.\n\n앞에 [ただ] 가 호응하기도 함.\n\n[のみ] 는 약간 딱딱한 표현이기 때문에 대화에서는 [だけ] 가 자주 사용된다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {"answer": "あるのみだ", "word": "ただ前進あるのみだ。", "mean": "단지 전진할 뿐이다."},
      {"answer": "あるのみ", "word": "何事も練習あるのみ。", "mean": "무슨 일이든 연습할 뿐이야."},
      {
        "answer": "あるのみ",
        "word": "成功するためにはひたすら努力あるのみ。",
        "mean": "성공하기 위해서는 오로지 노력할 뿐이다."
      },
      {
        "answer": "あるのみだ",
        "word": "今は耐え時。我慢あるのみだ。",
        "mean": "지금은 견딜 때. 참을 뿐이다."
      },
      {
        "answer": "あるのみ",
        "word": "私が相手。つまりお前は死あるのみ。",
        "mean": "내가 상대. 즉 너는 죽음 뿐이다."
      },
      {
        "answer": "あるのみ",
        "word": "先ずは行動あるのみ。結果は後からついてくる。",
        "mean": "우선 행동할 뿐이야.결과는 뒤따라온다."
      },
      {"answer": "あるのみ", "word": "今は辛抱あるのみ。", "mean": "지금은 참을 뿐이야."},
      {"answer": "あるのみ", "word": "日々鍛錬あるのみ。", "mean": "날마다 단련할 뿐."},
      {
        "answer": "のみだ",
        "word": "自分には何もできない。ただ嵐が過ぎ去るのを待つのみだ。",
        "mean": "자신은 아무것도 할 수 없다.단지 폭풍이 지나가길 기다릴 뿐이다."
      },
      {
        "answer": "のみ",
        "word": "他人の評価など関係ない。ただ突っ走るのみ。",
        "mean": "남의 평가 따위는 상관없다.그냥 뜀박질만 할 뿐이야."
      },
      {
        "answer": "のみ",
        "word": "神とは, ただ想像のなかにのみ存在する。",
        "mean": "신은 오직 상상 속에서만 존재한다."
      },
      {
        "answer": "のみ",
        "word": "幸福とはただ遠方からのみ見えるものだ。",
        "mean": "행복이란 그저 먼 곳에서만 보이는 것이다."
      },
      {"answer": "のみ", "word": "今はただ祈るのみ。", "mean": "지금은 그냥 기도할 뿐이야."},
      {
        "answer": "のみ",
        "word": "連日の大雨。ただ家に引きこもるのみ。",
        "mean": "연일 계속되는 폭우. 단지 집에 틀어박힐 뿐."
      },
      {
        "answer": "のみだ",
        "word": "考えているヒマはない。ただ動くのみだ。",
        "mean": "생각할 겨를이 없다.그저 움직일 뿐이다."
      },
      {"answer": "のみ", "word": "老兵はただ死にゆくのみ。", "mean": "노병은 그저 죽을 뿐이다."},
      {
        "answer": "のみ",
        "word": "人間は呼吸をして生きるだけ。人間に許された生き方はこの一択のみ。",
        "mean": "인간은 숨을 쉬고 살 뿐이다.인간에게 허락된 삶의 방식은 이 한 가지 선택뿐이다."
      },
      {"answer": "のみ", "word": "頭痛のみで熱は全くない。", "mean": "두통뿐, 열은 전혀 없다."}
    ]
  },
  {
    "id": 110,
    "grammar": "いざ ~となると",
    "means": "막상 ~하다 보면, 정작 ~하게 되면",
    "description": "생각만 해서는 별 생각이 없는데 막상 그 행동을 하게 됐을 때 비로소 그 어려움을 깨닫는 것을 나타낸다.",
    "connectionWays": "いざ ~となると\nいざ + 동사 사전형 + となると\nいざ + 명사 + となると",
    "examples": [
      {
        "answer": "いざ",
        "word": "いざ話したり書くとなると簡単な言葉しか使えなくなっちゃう。",
        "mean": "막상 말을 하거나 쓰게 되면 간단한 말밖에 사용할 수 없게 돼."
      },
      {
        "answer": "となると",
        "word": "いつも強気だがいざ戦いとなるとそうはいられないだろう。",
        "mean": "항상 강세지만 막상 싸움이 벌어지면 그럴 수는 없을 것이다."
      },
      {
        "answer": "いざ",
        "word": "いざ自分が当事者となるとどの選択が正しいのかもう分からなくなってしまう。",
        "mean": "막상 자신이 당사자가 되면 어떤 선택이 옳은지 더 이상 알 수 없게 된다."
      },
      {
        "answer": "となると",
        "word": "いつも一緒で, いざお別れとなると名残惜しく感じる。",
        "mean": "항상 함께여서 막상 헤어지면 서운하다."
      },
      {
        "answer": "いざ",
        "word": "生きるのは辛いけどいざ死ぬとなると勇気が出ない。",
        "mean": "살기는 힘들지만 막상 죽으려 하니 용기가 나지 않는다."
      },
      {
        "answer": "となると",
        "word": "告白しようとしてたのにいざその時となると何も言えなかった。",
        "mean": "고백하려고 했는데 막상 그때가 되니 아무 말도 못했어."
      }
    ]
  },
  {
    "id": 111,
    "grammar": "以外の何ものでもない",
    "means": "다름이 아니라 바로 ~이다.\n틀림없이 ~이다.",
    "description":
        "앞에 오는 명사를 강조하고 그것 이외가 아닌 틀림없이 그것이라는 의미를 표현 \n\n[~は~以外の何ものでもない]의 문형으로 자주 사용된다. \n\n의미 비슷한 문형인 [ ~でなくてなんだろう ]가 있으나, 그 앞에 사용되는 격조사에 따라 구별할 수 있다 \n\nこれ[は]悪夢以外の何ものでもない。\n\nこれ[が]悪夢でなくてなんだろうか。",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "以外の何ものでもない",
        "word": "タバコを吸うのは害以外の何ものでもない。",
        "mean": "담배를 피우는 것은 해 이외의 아무것도 아니다. (틀림없이 해가 된다)"
      },
      {
        "answer": "以外の何ものでもない",
        "word": "深夜の騒音は迷惑以外の何ものでもない。",
        "mean": "심야의 소음은 민폐 이외의 아무것도 아니다. (틀림없이 민폐이다.)"
      },
      {
        "answer": "以外の何ものでもない",
        "word": "これは悪夢以外の何ものでもない。",
        "mean": "이것은 악몽 이외의 아무것도 아니다. (틀림없이 악몽이다)"
      },
      {
        "answer": "以外の何ものでもない",
        "word": "生まれながらにして能力が高いのは才能以外の何ものでもない。",
        "mean": "태어나면서부터 능력이 있는 것은 재능 이외의 아무것도 아니다. (틀림없이 재능이다)"
      },
      {
        "answer": "以外の何ものでもない",
        "word": "あなたの人生は, あなたのもの以外の何ものでもない。",
        "mean": "너의 인생은 너의 것 이외에 아무것도 아니다. (틀림없이 너의 것이다)"
      }
    ]
  },
  {
    "id": 112,
    "grammar": "いざとなると~ / いざとなれば~ / いざとなったら~",
    "means": "여차하면, 하마터면, 유사시에는, 막상 그때가 되면",
    "description":
        "[いざ] 란 이제 무엇인가 시작하려고 할 때나 중요한 때를 표현한다.\n\n[万が一の時は, その時になったら]이라는 뜻을 나타낸다.\n\n뒷 내용에서는 일이 진전되는 모습을 말하고 화자의 대상에 대한 놀라움이나 의외성을 나타낸다.",
    "connectionWays": "단독 사용",
    "examples": [
      {
        "answer": "いざとなったら",
        "word": "傘はいざとなったら武器にもなる。",
        "mean": "우산은 여차하면 무기가 된다."
      },
      {
        "answer": "いざとなったら",
        "word": "いざとなったら腕ずくで止めればいい。",
        "mean": "여차하면 완력으로 멈추면 된다."
      },
      {
        "answer": "いざとなると",
        "word": "服とか整理してしまいたいのにいざとなるとどれを処分しようか迷ってしまう。",
        "mean": "옷이라든가 정리해 버리고 싶은데 여차하면 어느 것을 처분할지 망설이게 된다."
      },
      {
        "answer": "いざとなると",
        "word": "彼はいざとなるとやってくれる, 頼りになる存在。",
        "mean": "그는 여차하면 해주는 의지가 되는 존재."
      },
      {
        "answer": "いざとなれば",
        "word": "本当に普段はふざけてるけど いざとなれば本当に頼りになる。",
        "mean": "진짜 평소에는 장난치는데 여차하면 정말 의지가 된다."
      }
    ]
  },
  {
    "id": 113,
    "grammar": "いずれにしても~ / いずれにしろ~ / いずれにせよ~ / どっちみち~",
    "means": "어느 쪽이든, 어쨌건, 이러나저러나, 어차피, 결국 ",
    "description":
        "앞 내용에서 다양한 가능성이나 선택지가 있음을 언급하고, 그 어느 쪽을 선택하더라도 결과나 취해야 할 행동은 변하지 않으며, 뒷 내용 이야기의 중점임을 나타낸다.\n\n[ いずれ ]는 [ どれ ] 와 같은 의미.\n\n[どっちみち]는 회화체이며 [いずれにしても] 는 회화체, 문어체 둘 다 사용\n\n[いずれにしろ, いずれにせよ] 는 주로 문어체",
    "examples": [
      {
        "answer": "どっちみち",
        "word": "今会社を出ても, どっちみち終電には間に合わない。",
        "mean": "지금 회사를 나와도 어차피 막차 시간에는 맞출 수 없다."
      },
      {
        "answer": "どっちみち",
        "word": "日曜日雪かあ。どっちみち外出ないから私に関係ないけど。",
        "mean": "일요일 눈인가? 어차피 외출 없으니까 나랑 상관없지만."
      },
      {
        "answer": "いずれにしても",
        "word": "交通事故に遭ったが, いずれにしても大事に至らなくてよかった。",
        "mean": "교통사고를 당했지만 어쨌든 큰일이 나지 않아서 다행이다."
      },
      {
        "answer": "いずれにしても",
        "word": "リスクは低いが, いずれにしても気を付けるに越したことはない。",
        "mean": "리스크는 낮지만 어쨌든 조심하는 것보다 더 좋은 것은 없다."
      },
      {
        "answer": "いずれにしろ",
        "word": "いずれにしろ現状は非常に深刻だ。",
        "mean": "어쨌든 현 상황은 매우 심각하다."
      },
      {
        "answer": "いずれにしろ",
        "word": "主人公が死ぬとかそういう噂を聞くが, いずれにしろこの先の展開が楽しみだ。",
        "mean": "주인공이 죽는다든가 그런 소문을 듣는데 어쨌든 앞으로의 전개가 기대된다."
      },
      {
        "answer": "いずれにせよ",
        "word": "このまま続行するかどうか, いずれにせよ今日中に決めなければならない。",
        "mean": "이대로 계속할지 어떨지, 어쨌든 오늘 중으로 결정해야 한다."
      },
      {
        "answer": "いずれにせよ",
        "word":
            "この作品の良さをどのように表現すればいいか悩むところではあるが, いずれにせよ何度も見たくなるような魅力を持った作品であることは間違いない。",
        "mean":
            "이 작품의 장점을 어떻게 표현해야 할지 고민되는 대목이긴 하지만 어쨌든 자꾸 보고 싶은 매력을 지닌 작품임에는 틀림없다."
      }
    ]
  },
  {
    "id": 114,
    "grammar": "一概に(は)~ない",
    "means": "일률적으로~하지 않다, 싸잡아~하지 않다, 모두 한결같이~하지 않는다. ",
    "description":
        "여러 관점에서 사물을 본 결과, 여러 가지 평가나 여러 가지 받아들이는 방법이 존재하기 때문에 그것들을 하나로 묶을 수 없다는 것을 나타낸다. \n\n[ ~とは一概に言えない / 言い切れない ], [ 一概に~とは言えない / 言い切れない ]의 형태로 빈번하게 출제된다",
    "connectionWays": "문장 + とは一概に~ない\n一概に + 문장 + とは~ない",
    "examples": [
      {
        "answer": "一概には",
        "word": "Ａ案とＢ案に対する賛否が分かれていて, どっちが良いかは一概には決められない。",
        "mean": "A 안과 B 안에 대한 찬반이 갈리고 있어 어느 쪽이 좋을지는 일률적으로 결정할 수 없다."
      },
      {
        "answer": "一概には",
        "word": "今自分が何をしたいのか一概には答えられない。",
        "mean": "지금 자신이 무엇을 하고 싶은지 일률적으로 대답할 수 없다."
      },
      {
        "answer": "一概にどうと",
        "word": "諦めない方がいい事もあるが, 諦めた方がいい事もある。一概にどうとは言えない。",
        "mean": "포기하지 않는 것이 좋을 수도 있지만 포기하는 것이 좋을 수도 있다.일률적으로 어떻다고는 말할 수 없다."
      },
      {
        "answer": "一概に",
        "word": "多くの証言があることから, 幽霊の存在も一概に否定はできないだろう。",
        "mean": "많은 증언이 있는 만큼 유령의 존재도 싸잡아 부정할 수는 없을 것이다."
      },
      {
        "answer": "一概に",
        "word": "人それぞれ考え方が違うので, 普通か普通ではないかは一概に断言できるものではない。",
        "mean": "사람마다 생각이 다르기 때문에 보통인지 보통인지 아닌지는 일률적으로 단언할 수 있는 것이 아니다."
      },
      {
        "answer": "一概に",
        "word": "この２つの病気は初期症状が非常に似ているので, 一概に判断することが難しい。",
        "mean": "이 두 병은 초기 증상이 매우 비슷해 일률적으로 판단하기 어렵다."
      },
      {
        "answer": "に言えない",
        "word": "どちらが正しいとは一概に言えない。",
        "mean": "어느 쪽이 옳다고는 일률적으로 말할 수 없다."
      },
      {
        "answer": "言えないはずだ",
        "word": "この消毒液は人体には無害と書いてあったけど, アルコールが使われている以上一概にそうとは言えないはずだ。",
        "mean":
            "이 소독액은 인체에는 무해하다고 쓰여 있었지만 알코올이 사용되고 있는 이상 일률적으로 그렇다고는 할 수 없을 것이다."
      }
    ]
  },
  {
    "id": 115,
    "grammar": "今一~ない / 今一つ~ない",
    "means": "아직 ~멀었다\n아직 ~부족하다\n별로 ~하지 않다",
    "description":
        "뒷 문장에 부정형을 동반하고, 무언가가 부족하고 부족함을 나타낸다\n\n[今一 , 今一つ] 는 な형용사이기 때문에 단독으로도 사용할 수 있다\n\n[今一]는 [イマイチ] 카타카나 로도 쓰임",
    "connectionWays":
        "今一 (いまいち) + ~ない\n今一つ (いまひとつ) + ~ない\n今一 / 今一つ + な + 名詞\n~が今一だ\n~が今一つだ",
    "examples": [
      {
        "answer": "今一",
        "word": "このアプリ今一使い方が分からない。",
        "mean": "이 앱 아직 사용법을 잘 모르겠어."
      },
      {
        "answer": "イマイチ",
        "word": "景気は良くなっているというが, 正直イマイチ実感が湧かない。",
        "mean": "경기는 좋아지고 있다고는 하지만 솔직히 별로 실감이 나지 않는다."
      },
      {"answer": "いまいち", "word": "この漫画いまいち面白くない。", "mean": "이 만화 별로 재미없다."},
      {
        "answer": "今一つ",
        "word": "朝から今一つ体調が優れない。",
        "mean": "아침부터 컨디션이 별로 좋지 않다."
      },
      {
        "answer": "今一つ",
        "word": "周りがうるさくて今一つ集中できない。",
        "mean": "주위가 시끄러워서 별로 집중할 수가 없다."
      },
      {
        "answer": "今一つ",
        "word": "美味しいは美味しいけど, 塩加減が今一つ足りない。",
        "mean": "맛있기는 맛있지만 간이 좀 부족하다."
      },
      {"answer": "今一つ", "word": "母の作るカレーは今一つだ。", "mean": "어머니가 만드는 카레는 별로다."},
      {"answer": "今一な", "word": "今日は今一な天気だ。", "mean": "오늘은 별로인 날씨다."}
    ]
  },
  {
    "id": 116,
    "grammar": "~うちに入らない / うちには入らない",
    "means": "~범위(범주)에는 들어가지 않는다\n~라고 할 수 없다",
    "description": "그 정도로는 충분하지 않은 것을 표현합니다. \n\n[~だとは言えない] 와 거의 같은 표현",
    "connectionWays":
        "명사 + のうちに(は)入らない\nい형용사 + うちに(は)入らない\nな형용사 + な + うちに(は)入らない\n동사 보통형 + うちに(は)入らない",
    "examples": [
      {
        "answer": "うちに入らない",
        "word": "お酒に強くなったつもりだったが, 友人からは[ ビール２, ３本くらいじゃ飲んだうちに入らない ]と言われた。",
        "mean": "술이 세졌다고 생각했는데 친구가 [ 맥주 2, 3병 정도로는 많이 마신 거라고 할 수 없다 라고 했다."
      },
      {
        "answer": "うちには入らない",
        "word": "仮に自分が頑張っていると思っていても, 結果を出せなければ頑張っているうちには入らないと思う。",
        "mean": "만일 자신이 노력하고 있다고 생각하고 있어도 결과를 내지 못하면 노력하고 있다고 할 수 없다 고 생각해."
      },
      {
        "answer": "うちに入らない",
        "word": "私の地元の人たちは大らかな人が多くて, １０分２０分くらい遅れても遅れたうちに入らないって言う人もいる。",
        "mean":
            "저의 현지인들은 대범한 사람이 많아서 10분 20분 정도 늦어도 늦은 범주에 들어가지 않는다고 말하는 사람도 있다."
      },
      {
        "answer": "うちには入らない",
        "word": "３日うんちが出ないなんて便秘のうちには入らない。私なんて１週間出てない。",
        "mean": "3일 변이 안 나온 거로는 변비의 범주에 들어가지 않는다. 나는 일주일 동안 안 나왔다."
      },
      {
        "answer": "うちに入らない",
        "word": "得意料理がインスタントラーメンなんて, そんなの料理のうちに入らないだろう。",
        "mean": "잘하는 요리가 인스턴트 라면이라니, 그런 것은 요리의 범주에 들어가지 않을 것이다."
      },
      {
        "answer": "うちに入らない",
        "word": "異性と二人で食事に行くくらいじゃ浮気のうちに入らない。",
        "mean": "이성과 둘이서 식사하러 간 정도로는 바람피웠다고 볼 수 없다"
      },
      {
        "answer": "うちには入らない",
        "word": "睡眠３時間は寝たうちには入らない。私は８時間くらい寝ないと翌日辛い。",
        "mean": "수면 3시간은 수면의 범주에 들어가지 않는다. 나는 8시간 정도 자지 않으면 다음날 힘들다."
      },
      {
        "answer": "うちに入らない",
        "word": "気持ちを伝える覚悟もない。その程度の行為なら[ 好き ]のうちに入らない。",
        "mean": "마음을 전할 각오도 없다. 그 정도 행위라면 좋아한다고 할 수 없다"
      }
    ]
  },
  {
    "id": 117,
    "grammar": "か否か",
    "means": "~인지 아닌지\n~인지 여부",
    "description": "의문이나 판단이 어렵다는 것을 나타낸다.\n[~かどうか] 같은 뜻.",
    "connectionWays":
        "동사 사전형 / 동사 과거형 + か否か\nい형용사 + (の) + か否か\nな형용사 어간 + (である / なの) + か否か\n명사 + (である / なの) + か否か",
    "examples": [
      {
        "answer": "か否か",
        "word": "人生楽しむか否か。結局は自分次第。",
        "mean": "인생을 즐기느냐 마냐.결국은 자기 하기 나름."
      },
      {
        "answer": "か否か",
        "word": "ダイエット中だけどケーキを食べるか否かで迷ってる。",
        "mean": "다이어트 중인데 케이크를 먹을지 말지 고민이야."
      },
      {
        "answer": "か否か",
        "word": "この服似合ってるか否かは自分ではちょっとわからない。",
        "mean": "이 옷 잘 어울리는지 아닌지는 내가 좀 모르겠어."
      },
      {
        "answer": "か否か",
        "word": "どこでも寝れるのは長所に含まれるか否か。",
        "mean": "어디서나 잘 수 있는 것은 장점에 포함되는지 아닌지."
      },
      {"answer": "か否か", "word": "契約を更新するのか否か悩む。", "mean": "계약을 갱신할지 말지 고민하다."},
      {
        "answer": "か否か",
        "word": "遠慮なくと言われて遠慮せずに質問し続けるのは失礼であるか否か。",
        "mean": "사양하지 말라고 해서 사양하지 않고 계속 질문하는 것은 실례인가 아닌가."
      }
    ]
  },
  {
    "id": 118,
    "grammar": "がましい",
    "means": "마치 (~하는 것) 같다",
    "description":
        "명사나 동사연용형에 붙어 형용사를 만든다.\n\n접속한 명사의 모습에 가깝다는 의미를 나타낸다.\n\n보통은 좋지 않은 일에 사용된다.\n\n言い訳がましい(변명하는 것 같다), 差し出がましい(시건방지다), 押しつけがましい(생색내다, 강요하는 것같다), 恩着せがましい(자못 은혜라도 베풀듯 생색내는 듯 굴다), 未練がましい(연연해하다, 아쉬워하다) 등, 접속가능한 명사는 한정되어 있음\n\n이 표현은 모두 억지, 강제하는 듯한 뉘앙스를 가짐 ",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "がましい",
        "word": "言い訳がましいことは言わないほうがカッコいい。",
        "mean": "변명하는 듯한 말은 하지 않는 게 멋있어."
      },
      {
        "answer": "がましい",
        "word": "何も分かってないくせに意見を言うなど差し出がましい行為は慎むべきだ。",
        "mean": "아무것도 모르면서 의견을 말하는 등 주제넘는 행동은 삼가야 한다."
      },
      {
        "answer": "がましい",
        "word": "自宅まで来る宗教勧誘の人は基本押しつけがましい。",
        "mean": "집에까지 찾아오는 종교 권유하는 사람은 기본적으로 강요하는 듯하다."
      },
      {
        "answer": "がましい",
        "word": "彼は自分からお礼を求めてくる恩着せがましいやつだ。",
        "mean": "그는 자기가 답례를 요구하는 생색내는 녀석이다."
      },
      {
        "answer": "がましくて",
        "word": "いつまでも元カノのことを引きずる男は未練がましくて男らしくない。",
        "mean": "언제까지고 전 여자친구에 대해 질질 끄는 남자는 미련이 있는 듯해서 남자답지 않다."
      },
      {"answer": "がましい", "word": "晴れがましい場所は苦手だ。", "mean": "드러나게 화려한 곳은 질색이다."},
      {
        "answer": "がましい",
        "word": "勝手がましいことを申し上げるようですが。",
        "mean": "외람된 말씀을 드리는 것 같습니다만."
      },
      {
        "answer": "がましい",
        "word": "託言がましい声を出すとは見下げ果てたやつだ。",
        "mean": "핑계 삼아 푸념하듯 말하다니 정말 비열한 놈이다."
      }
    ]
  },
  {
    "id": 119,
    "grammar": "~かれ ~かれ",
    "means": "~라도 ~라도\n정도의 차가 있어도 ~다.",
    "description":
        "정도의 차이가 있어도, 어떤 상황에 놓여 있어도 바뀌지 않는 것을 나타내는 문법\n\n[遅かれ早かれ, 多かれ少なかれ] 등의 관용표현이 자주 사용된다",
    "connectionWays": "い형용사 어간 + かれ + い형용사 어간 + かれ",
    "examples": [
      {
        "answer": "かれ",
        "word": "正しい努力を続ければ, 遅かれ早かれ芽は出る。",
        "mean": "올바른 노력을 계속하면 조만간 싹을 틔울 것이다."
      },
      {
        "answer": "かれ",
        "word": "ギャンブルに明け暮れる夫は, 遅かれ早かれいずれ離婚することになる。",
        "mean": "도박을 일삼는 남편은 조만간 이혼하게 될 것이다."
      },
      {
        "answer": "かれ",
        "word": "どんな人でも多かれ少なかれ, 個々の中に闇は持ってるものだ。",
        "mean": "어떤 사람이든 많든 적든 각각의 안에 어둠은 가지고 있는 법이다."
      },
      {
        "answer": "かれ",
        "word": "生きる限り, 多かれ少なかれ多くの人に迷惑を掛けている。",
        "mean": "살아가는 한, 많든 적든 많은 사람에게 폐를 끼치고 있다."
      },
      {
        "answer": "かれ",
        "word": "恋愛では, 多かれ少なかれ相手に対して理想を抱いてしまう。",
        "mean": "연애에서는 많든 적든 상대에 대해서 이상을 품게 됩니다."
      }
    ]
  },
  {
    "id": 120,
    "grammar": "きっての",
    "means": "~중에서 최고의 ",
    "description":
        "장소, 집단, 조직, 시대 등의 명사에 접속한다.\n\n그 범위 안에서 가장 우수한 것, 첫번째로 좋은 것을 표현한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "きっての",
        "word": "京都きっての観光地[ 清水寺 ]",
        "mean": "교토 최고의 관광지 기요미즈데라"
      },
      {"answer": "きっての", "word": "野球界きってのスラッガー", "mean": "야구계 최고의 슬러거"},
      {"answer": "きっての", "word": "彼女は会社きっての切れ者だ", "mean": "그녀는 회사에서 으뜸가는 불량배다"},
      {
        "answer": "きっての",
        "word": "我が空軍きってのエースパイロットが彼です。",
        "mean": "우리 공군 최고의 에이스 파일럿이 그입니다."
      },
      {
        "answer": "きっての",
        "word": "彼はクラスきってのゲーム好きだ。",
        "mean": "그는 학급 최고의 게임을 좋아한다."
      }
    ]
  },
  {
    "id": 121,
    "grammar": "~気取り (きどり) ",
    "means": "(짐짓) ~체함, 자처함.",
    "description":
        "원래 그렇지 않은데 그런 듯한 소질이나 성질을 가지고 있음을 다른 사람에게 보여주듯이 행동하는 것을 나타낸다. \n\n중립적인 평가에도 사용하기는 하지만 마이너스 평가로 사용하는 경우가 비교적 많다. \n\n비슷한 [~ぶる] 가 있지만 이쪽은 마이너스의 평가만 표현한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "気取りで",
        "word": "女優気取りで歩くと女性らしさがより際立つ。",
        "mean": "여배우 행세를 하며 걸으면 여성스러움이 더 돋보인다."
      },
      {
        "answer": "気取りで",
        "word": "彼女はどこに行ってもいつもモデル気取りで自撮りしている。",
        "mean": "그녀는 어디를 가든 항상 모델인 체하며 셀카를 찍는다."
      },
      {
        "answer": "気取りの",
        "word": "小悪魔気取りの女の子を可愛いと思う男もいるし, 毛嫌いする男もいる。",
        "mean": "작은 악마인 체하는 여자를 귀엽다고 생각하는 남자도 있고, 혐오하는 남자도 있다."
      },
      {
        "answer": "気取りな",
        "word": "彼の芸能人気取りな態度が鼻に付く。",
        "mean": "그의 예능인인 척하는 태도가 진절머리 난다."
      },
      {
        "answer": "気取り",
        "word": "他人に理解されないことを[ 私の個性だ ]と言い張り, 芸術家気取りするのは芸術でもなんでもない。",
        "mean": "타인에게 이해받지 못하는 것을 [ 내 개성이다 ]라고 우겨, 예술가인 체하는 것은 예술도 뭐도 아니다."
      },
      {
        "answer": "気取りの",
        "word": "モデル気取りの女性にはイライラさせられる。",
        "mean": "모델인 척하는 여성에게는 짜증이 난다."
      },
      {
        "answer": "気取りの",
        "word": "美食家気取りの夫にこっそり冷凍食品食べさせたら美味しいと言ってくれた。",
        "mean": "미식가인 체하는 남편에게 몰래 냉동식품 먹였더니 맛있다고 말해 주었다."
      },
      {
        "answer": "気取り",
        "word": "川で溺れている子どもを助けて, それ以来彼は英雄気取りになっている。",
        "mean": "강에서 물에 빠진 어린이를 구하고 그 이후 그는 영웅인 체하고 있다."
      }
    ]
  },
  {
    "id": 122,
    "grammar": "~ことこの上ない / この上ない~",
    "means": "~하기 이를 데 없다\n~하기 그지없다\n너무 ~하다",
    "description":
        "일종의 강조 표현. \n그보다 더할 것이 없다는 것, 보다 좋은 상태가 없다는 것, 이미 극한임을 나타낸다.\n좋은 것에도 좋지 않은 것에도 사용할 수 있다.\nことこのうえない 라고 발음한다",
    "connectionWays":
        "な형용사 + な / である + ことこの上ない\nい형용사 + ことこの上ない\nこの上ない + 명사\nこの上なく + な형용사 / い형용사",
    "examples": [
      {
        "answer": "ことこの上ない",
        "word": "勝負に負け, 悔しいことこの上ない。",
        "mean": "승부에 져 분하기 짝이 없다."
      },
      {
        "answer": "ことこの上ない",
        "word": "彼がいると安心させられる。頼もしいことこの上ない。",
        "mean": "그가 있으면 안심 시킬 수 잇다.믿음직스럽기 짝이 없다."
      },
      {
        "answer": "ことこの上ありません",
        "word": "こんなにも良くして頂いて, 嬉しいことこの上ありません。",
        "mean": "이렇게 잘해주시니 기쁘기 짝이 없습니다."
      },
      {
        "answer": "ことこの上なかった",
        "word": "息子が初めて料理に挑戦しているところを見ていたが, 危なっかしいことこの上なかった。",
        "mean": "아들이 처음 요리에 도전하는 것을 보고 있었지만 위태롭기 짝이 없었다."
      },
      {
        "answer": "ことこの上ない",
        "word": "Ａさんの書いた字は読みにくいことこの上ない。",
        "mean": "A씨가 쓴 글씨는 읽기 힘들기 짝이 없다."
      },
      {
        "answer": "この上ない",
        "word": "おばあちゃんが亡くなって, この上ない悲しさを味わった。",
        "mean": "할머니가 돌아가셔서 더없는 슬픔을 느꼈다."
      },
      {
        "answer": "ことこの上ない",
        "word": "弁明ばかりを繰り返し, 見苦しいことこの上ない。",
        "mean": "변명만 되풀이해 볼썽사납기 짝이 없다."
      },
      {
        "answer": "この上なく",
        "word": "人生一度はこの上なく愛されてみたい。",
        "mean": "인생 한번은 더할 나위 없이 사랑받고 싶어."
      }
    ]
  },
  {
    "id": 123,
    "grammar": "ことなしに",
    "means": "~하지 않고",
    "description":
        "1.가정 조건\n만약 앞 내용이 없다면, 뒷 내용은 성립되지 않음을 나타낸다.\n뒷 내용은 대부분 부정형을 동반함.\n\n2. 부대 상황\n앞 내용의 동작이 없는 상태에서 뒷 내용을 수행하는 것을 나타낸다.\n\n[言うことなし]은 이 문법과 무관한 관용구입니다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "ことなしに",
        "word": "この世界は, 傷つくことなしに生きることは不可能だ。",
        "mean": "이 세상은 상처받지 않고는 살 수 없다."
      },
      {
        "answer": "ことなしには",
        "word": "他人に迷惑をかけることなしには, 生きてはいけない。",
        "mean": "남에게 폐를 끼치는 일 없이는 살 수 없다."
      },
      {
        "answer": "ことなしに",
        "word": "挫折を経験することなしに成果は出せない。",
        "mean": "좌절을 겪지 않고는 성과를 낼 수 없다."
      },
      {
        "answer": "ことなしに",
        "word": "人は何かを失うことなしに何かを得ることはできない。",
        "mean": "사람은 무언가를 잃지 않고는 무언가를 얻을 수 없다."
      },
      {
        "answer": "ことなしに",
        "word": "いつも深く考えることなしに行動を起こしてしまう。",
        "mean": "항상 깊이 생각하지 않고 행동을 하게 된다."
      },
      {
        "answer": "ことなしに",
        "word": "数学とか物理は学生時代頑張ることなしに諦めた。",
        "mean": "수학이나 물리는 학창시절 열심히 하지 않고 포기했다."
      },
      {
        "answer": "ことなしに",
        "word": "結婚の理想は互いに相手を束縛することなしに, しかも緊密に結びついていることだ。",
        "mean": "결혼의 이상은 서로를 속박하지 않고, 게다가 긴밀하게 연결되어 있는 것이다."
      },
      {
        "answer": "ことなしに",
        "word": "成功とは, 情熱を失うことなしに失敗を繰り返すことで出来上がっているものだ。",
        "mean": "성공은 열정을 잃지 않고 실패를 반복함으로써 이루어진다."
      }
    ]
  },
  {
    "id": 124,
    "grammar": "こともあって",
    "means": "~고 해서\n~까지 해서\n~한 것도 있어",
    "description":
        "이유를 나타내는 문법이지만 여러 원인 중에 한 가지만 든다는 점이 특징.\n\n다른 원인도 있다는 것을 암시.\n\n대부분의 경우 뒤에 나오는 내용에서 어떠한 현상에 대한 설명 온다.",
    "connectionWays": "동사 보통형\nい형용사 명사 수식형\nな형용사 명사 수식형\n명사 +という",
    "examples": [
      {
        "answer": "ということもあって",
        "word": "深夜ということもあって, みんな変なテンションだった。",
        "mean": "심야 이기도 하고 다들 이상한 텐션이었어."
      },
      {
        "answer": "ということもあって",
        "word": "まだ１年目ということもあって, 全然分かっていない。",
        "mean": "아직 1년째이기도 하고 전혀 모른다."
      },
      {
        "answer": "こともあって",
        "word": "気付くのが遅かったこともあって, 随分損をさせられた。",
        "mean": "늦게 알아차린 것도 있어서 손해를 많이 봤다."
      },
      {
        "answer": "こともあって",
        "word": "お互い酒が回っていたこともあって, 秘密を色々打ち明けてしまった。",
        "mean": "서로 술이 취하기도 했기 때문에 비밀을 여러 가지 털어놓았다."
      },
      {
        "answer": "こともあって",
        "word": "先輩とは年が近いこともあって良い関係を築けている。",
        "mean": "선배와는 나이가 비슷하기도 해서 좋은 관계를 맺고 있다."
      },
      {
        "answer": "ということもあって",
        "word": "ちょうど受験前ということもあって, 息子はピリピリしている。",
        "mean": "마침 수험 전이기도 하고 아들은 날이 서 있다."
      },
      {
        "answer": "こともあって",
        "word": "筋トレを始めたこともあって, 食生活には特に注意するようにしている。",
        "mean": "근육 트레이닝을 시작하기도 해서 식생활에 특히 주의하도록 하고 있다."
      },
      {
        "answer": "こともあって",
        "word": "生まれつき体が弱いこともあって, 過度な運動は避けている。",
        "mean": "선천적으로 몸이 약하기도 하고 과도한 운동은 피하고 있다."
      }
    ]
  },
  {
    "id": 125,
    "grammar": "これといって ~ない / これといった ~ない / これという ~ない",
    "means": "이렇다 할 ~가 없다\n딱히 ~할 것이 없다\n별다른 ~가 없다",
    "description":
        "말할 것도 없다는 것을 나타낸다.\n\n뒤에는 [ も ]나 [ ~ない ]를 동반함.\n\n[ これといって ]의 뒤에는 동사나 형용사, [ これといった / これという ] 뒤에는 명사가 접속. ",
    "connectionWays":
        "これといって + 동사 + ~ない\nこれといって + 형용사 + ~ない\nこれといった + 명사 + ~ない\nこれという + 명사 + ~ない",
    "examples": [
      {
        "answer": "これといって",
        "word": "私には, これといって自慢できることがない。",
        "mean": "나는 이렇다 할 자랑거리가 없다."
      },
      {
        "answer": "これといって",
        "word": "この映画は見終わってもこれといって心に響くものがなかった。",
        "mean": "이 영화는 다 보고도 딱히 마음에 와닿는 것이 없었다."
      },
      {
        "answer": "これといって",
        "word": "この人知ってるかと聞かれても, これといって心当たりはない。",
        "mean": "이 사람을 아냐고 물어봐도 딱히 짚이는 게 없다."
      },
      {
        "answer": "これといって",
        "word": "これといって可愛いとも思わないので, 彼女がなぜ人気なのか分からない。",
        "mean": "딱히 귀엽다고도 생각하지 않아서 그녀가 왜 인기가 많은지 모르겠다."
      },
      {
        "answer": "これといった",
        "word": "一日をこれといった喜びや満足感無しに, ただ何となく過ごすのでは人生は勿体ない。",
        "mean": "하루를 이렇다 할 기쁨이나 만족감 없이 그저 그냥저냥 보내기엔 인생이 아깝다."
      },
      {
        "answer": "これといった",
        "word": "髪型を変えたいけどこれといったものがない。",
        "mean": "헤어 스타일을 바꾸고 싶지만 이렇다 할 게 없다."
      },
      {
        "answer": "これといった",
        "word": "これといった理由はないけど, なぜか蕎麦が好き。",
        "mean": "이렇다 할 이유는 없지만 왠지 소바가 좋다."
      },
      {
        "answer": "これといった",
        "word": "幼少期にはこれといった思い出はない。",
        "mean": "어릴 때 에는 이렇다 할 추억이 없다."
      },
      {
        "answer": "これという",
        "word": "社会問題に, 誰もが納得するこれという正解はそもそもない。",
        "mean": "사회문제에 누구나 납득할만한 이렇다 할 정답은 애초에 없다."
      },
      {
        "answer": "これという",
        "word": "一応努力してみたものの, 特にこれという結果は得られなかった。",
        "mean": "일단 노력해 보긴 했지만 딱히 이렇다 할 결과는 얻지 못했다."
      }
    ]
  },
  {
    "id": 126,
    "grammar": "術がない",
    "means": "~할 방법이 없다\n~할 수 없다. ",
    "description":
        "여기서 術[すべ]는 '방법'을 의미. \n\n[術がない] 는 '방법이 없다'라는 의미. \n\n단독으로 사용할 수도 있다. \n\n[成す術がない] 는 관용구로 '어찌할 도리가 없다, 어찌할 방법이 없다'라는 의미. ",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "術がない",
        "word": "言いたいことはたくさんあるが, それを上手く伝える​術がない。",
        "mean": "하고 싶은 말은 많은데 그걸 잘 전달할 방법이 없다."
      },
      {
        "answer": "術がない",
        "word": "放射線は見えないし臭いもないだけに, その危険を知る​術がない​。",
        "mean": "방사선은 보이지 않고 낸다새도 없어서 그 위험을 알 방법이 없다."
      },
      {
        "answer": "術がない",
        "word": "自分にはもう, それしか​術がない​。",
        "mean": "나는 이제 그것 말고는 방법이 없어."
      },
      {"answer": "術がない", "word": "１人で生きていく術がない。", "mean": "혼자서 살아갈 방법이 없어."},
      {
        "answer": "術がない",
        "word": "地震や津波などの自然災害に, 人類は​成す術がない。",
        "mean": "지진이나 해일 등의 자연재해에 인류는 어찌할 도리가 없어."
      },
      {
        "answer": "術がない",
        "word": "できることは全てやったり, もうこれ以上為す術がない。",
        "mean": "할 수 있는 건 모두 하거나 그 이상 할 수 있는 방법이 없어."
      },
      {
        "answer": "術がありません",
        "word": "もう癌は全身に転移しているので, 治す術がありません​。",
        "mean": "이제 암은 온몸으로 전이했기 때문에 고칠 방법이 없습니다."
      },
      {
        "answer": "術がありません",
        "word": "昔の友人に連絡をとりたいが, SNSもやってないし, 電話番号も知らないし, 居場所を知る​術がありません。",
        "mean": "옛 친구에게 연락을 하고 싶지만 SNS도 하지 않고 전화번호도 모르고 어디에 있는지 알 방법이 없어요."
      },
      {
        "answer": "術がない",
        "word": "いつ富士山が噴火するかなんて, 誰にも予測する術がない。",
        "mean": "언제 후지산이 분화할지 아무도 예측할 방법이 없어요."
      },
      {
        "answer": "術がない",
        "word": "試せることは全て試したし, もうこれ以上なす術がない。",
        "mean": "시도해 볼 수 있는 건 모두 시도해 봤고 이제 더 이상 어쩔 도리가 없어."
      },
      {
        "answer": "術がない",
        "word": "KFCのレシピは極秘なので, たとえ社員になっても知る術がない​らしい。",
        "mean": "KFC의 레시피는 극비이기 때문에 설령 사원이 된다고 해도 알 방법이 없다고 한다."
      },
      {
        "answer": "術がない",
        "word": "敵は空から攻撃してくるので, 我々はもう戦う術がない。",
        "mean": "적은 하늘에서 공격해오기 때문에 우리는 더 이상 싸울 방법이 없다."
      }
    ]
  },
  {
    "id": 127,
    "grammar": "~損なう / 損ねる / 損じる",
    "means": "(~했지만 어떠한 이유로) 할 수 없었다\n하지 못했다",
    "description":
        "해 보았지만 어떠한 이유로 실패했다', '실제로는 할 수 있었는데 부주의 등으로 할 수 없었다'는 것을 의미 \n\n앞에 나오는 내용이 뜻하는 행동이 이루어지지 않거나 그것을 할 능력이 없음을 나타내는 말이 온다. \n\n損(そこ)なう, 損(そこ)ねる, 損(そん)じる는 모두 의미가 같다\n\n-비슷한 문법 비교-\n\n [動ます形 + 忘れる] : 머리속에서 완전히 잃어버렸다 라는 뉘양스\n\n [~そびれる]: 하려고 생각했지만 기회를 놓쳤다 라는 뉘양스\n\n [~損なう / 損ねる / 損じる]：했지만 하는 법이 잘못되서 등 실패했다 라는 뉘양스",
    "connectionWays": "동사ます형",
    "examples": [
      {
        "answer": "損ねた",
        "word": "逃げた飼い猫を捕まえ損ねた。",
        "mean": "도망간 우리 집 고양이를 잡지 못했다."
      },
      {
        "answer": "損ね",
        "word": "上司に呼び止められた結果定時に帰り損ね, 結局残業することになってしまった。",
        "mean": "상사의 부름을 받은 결과 정시에 돌아오지 못하고 결국 야근을 하게 되어 버렸다."
      },
      {
        "answer": "損ねてしまった",
        "word": "停留所がどこか分からずバスに乗り損ねてしまった。",
        "mean": "정류장이 어디인지 몰라서 버스에 타지 못하고 말았다."
      },
      {
        "answer": "損ねた",
        "word": "ゆっくりお風呂に入っていたら洗濯し損ねたことに気付いた。",
        "mean": "느긋하게 목욕을 하고 있었는데 빨래를 하지 않은 것을 깨달았다."
      },
      {
        "answer": "損ね続けている",
        "word": "ここ数年インフル予防接種し損ね続けている。",
        "mean": "최근 몇 년 간 독감 예방 접종을 계속하지 못하고 있다."
      },
      {
        "answer": "損なって",
        "word": "昨晩スマホを充電し損なって肝心な時に使えなかった。",
        "mean": "어젯밤 스마트폰을 충전하지 못해서 중요할 때에 사용하지 못했다."
      },
      {
        "answer": "損ねた",
        "word": "またお気に入りのドラマを録画し損ねた。",
        "mean": "또 보고 싶었던 드라마 녹화를 못 했어."
      },
      {
        "answer": "損なった",
        "word": "突然パソコンが動かなくなって申し込みし損なった。",
        "mean": "갑자기 컴퓨터가 작동하지 않아서 신청을 하지 못했다."
      }
    ]
  },
  {
    "id": 128,
    "grammar": "そびれる",
    "means": "~할 기회를 놓치다\n~하려다 못하다\n~하지 못했다",
    "description":
        "해야 할 일이나 하려고 했던 일을 어떠한 이유로 할 수 없게 되었음을 나타낸다. \n\n-비슷한 문법 비교-\n\n [動ます形 + 忘れる] : 머리속에서 완전히 잃어버렸다 라는 뉘양스\n\n [~そびれる]: 하려고 생각했지만 기회를 놓쳤다 라는 뉘양스\n\n [~損なう / 損ねる / 損じる]：했지만 하는 법이 잘못되서 등 실패했다 라는 뉘양스",
    "connectionWays": "동사ます형",
    "examples": [
      {
        "answer": "そびれた",
        "word": "買い物に行きそびれたせいで, 冷蔵庫に何もない。",
        "mean": "쇼핑하러 가지 못한 탓에 냉장고에 아무것도 없어."
      },
      {
        "answer": "そびれてしまった",
        "word": "質問しようと思ったけど, 緊張で言いそびれてしまった。",
        "mean": "질문하려고 했는데 긴장되서 질문하지 못했다."
      },
      {
        "answer": "そびれてしまった",
        "word": "なんだかよく分からないうちにプレゼントを渡しそびれてしまった。",
        "mean": "왠지 잘 모르는 사이에 선물을 건네주지 못하고 말았다."
      },
      {
        "answer": "そびれてしまった",
        "word": "バスが混んでて降りそびれてしまった。",
        "mean": "버스가 붐벼서 미처 내리지 못하고 말았다."
      },
      {
        "answer": "そびれた",
        "word": "お風呂入って, 洗濯してたら見たい番組見そびれた。",
        "mean": "씻고 빨래하다가 보고 싶은 프로그램 못 봤어."
      },
      {
        "answer": "そびれた",
        "word": "せっかく買ったお土産を渡しそびれた。",
        "mean": "모처럼 산 기념품을 건내주지 못했다."
      },
      {
        "answer": "そびれた",
        "word": "年末に家族が次から次へとインフルエンザに感染し初詣に行きそびれた。",
        "mean": "연말에 가족들이 잇따라 독감에 감염되어 참배하러 가지 못했다."
      },
      {"answer": "そびれた", "word": "遅刻して飛行機に乗りそびれた。", "mean": "지각해서 비행기를 놓쳤어."}
    ]
  },
  {
    "id": 129,
    "grammar": "~たいがために / たいがための",
    "means": "~하기 위해,~하고 싶어서",
    "description":
        "[ ~んがために / んがための ]와 같이 목적을 나타낸다. \n\n[ ~んがために / んがための ]는 주로 문어적 표현으로 사용하지만, [ ~たいがために / たいがための ]는 좀 더 부드러운 느낌. \n\n목적 달성에 대한 바람, 의지가 포함되어 있다. ",
    "connectionWays": "동사ます형",
    "examples": [
      {
        "answer": "たいがために",
        "word": "結果を早く見たいがために映画は倍速にして観る。",
        "mean": "결과를 빨리 보고 싶어서 영화는 배속으로 해서 본다."
      },
      {
        "answer": "たいがために",
        "word": "サウナに入りたいがためにジムに行ってる。",
        "mean": "사우나에 가고 싶어서 헬스장에 가고 있다."
      },
      {
        "answer": "たいがために",
        "word": "Webサイトを作りたいがために勉強を始めた。",
        "mean": "웹 사이트를 만들고 싶어서 공부를 시작했다."
      },
      {
        "answer": "たいがために",
        "word": "かわいく見られたいがために張り切り過ぎてはいけません。",
        "mean": "귀엽게 보이고 싶어서 너무 무리해서는 안 돼요."
      },
      {
        "answer": "たいがために",
        "word": "自慢したいがために​犬を飼い始めた。",
        "mean": "자랑하고 싶어서 강아지를 키우기 시작했다."
      },
      {
        "answer": "たいがための",
        "word": "モテ​たいがための必死のアピールは見苦しい。",
        "mean": "인기를 끌기 위한 필사적 어필은 꼴사납다."
      },
      {
        "answer": "たいがために",
        "word": "鹿が見​たいがために奈良公園に行ってきました。",
        "mean": "사슴이 보고 싶어서 나라 공원에 갔다 왔어요."
      },
      {
        "answer": "たいがために",
        "word": "モテたいがために合コンで嘘をついてしまった。",
        "mean": "인기를 끌고 싶어서 미팅에서 거짓말을 해버렸다."
      },
      {
        "answer": "たいがために",
        "word": "彼女は金を得たいがために, 多くの男を騙してきた。",
        "mean": "그녀는 돈을 얻기 위해 많은 남자들을 속여왔다."
      },
      {
        "answer": "たいがために",
        "word": "試合に勝ちたいがために, 反則を犯してしまった彼は試合後, 相手チームや観客, たくさんの人から非難を浴びた。",
        "mean": "시합에서 이기고 싶어서 반칙을 저지르고 만 그는 시합 후 상대방 팀과 관객, 많은 사람들로부터 비난을 받았다."
      }
    ]
  },
  {
    "id": 130,
    "grammar": "ただでさえ",
    "means": "그렇지 않아도, 가뜩이나, 원래도, 그냥도, 안 그래도, 평소의 경우에서 조차",
    "description":
        "평소에도 좋지 않은 사태가 일어나고 있음을 나타낸다. \n\n뒤에 나오는 내용에 [ ~のに ]와 같은 말이 호응하는 경우가 많으며 그럴 경우에 뒤에 나오는 내용에서 평소의 상황을 넘어선 상황에서 더욱 좋지 않은 사태를 서술할 수 있다. ",
    "examples": [
      {
        "answer": "ただでさえ",
        "word": "ただでさえ苦しいのに泥棒にまで見舞われた。",
        "mean": "가뜩이나 괴로운데 도둑까지 맞았다."
      },
      {
        "answer": "ただでさえ",
        "word": "女の子は可愛い可愛いと褒めると, ただでさえ可愛い人も更に可愛くなっていく。",
        "mean": "여자는 귀엽다 귀엽다고 칭찬하면 그렇지 않아도 귀여운 사람도 더욱 귀여워진다."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ体調を崩しやすい時期ですので, お身体ご自愛ください。",
        "mean": "가뜩이나 몸 상태가 나빠지기 쉬운 시기이니 몸조심하시길 바랍니다."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ目が悪いのに, これ以上悪くなったら困る。",
        "mean": "그렇지 않아도 눈이 나쁜데 더 나빠지면 곤란해."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ毎日彼に会いたいタイプなのに, 忙しくて何日も会えないと耐えられない。",
        "mean": "그렇지 않아도 매일 그를 만나고 싶은 타입인데 바빠서 며칠이나 못 만나면 견딜 수 없어."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ学費が大変なのに, 留年でもしたら家計が火の車だ。",
        "mean": "안 그래도 학비로 힘든데 유급이라도 하면 가계가 쪼들린다."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ顔を見たくないし, いっそ留学でも行ったらいいのに。",
        "mean": "가뜩이나 얼굴도 보기 싫고 차라리 유학이라도 가버리면 좋을 텐데."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ少子化で子どもが少ないのに, 高齢化も進んでいて国の未来は絶望的だ。",
        "mean": "그렇지 않아도 저출산으로 아이가 적은데 고령화도 진행되고 있어 나라의 미래가 절망적이야."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ重いのに, その上また重荷か。",
        "mean": "가뜩이나 무거운데 또 웃짐이냐"
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ暗記するのは苦手なのに, 英語勉強するなんて厳しい。",
        "mean": "가뜩이나 암기를 잘 못하는데 영어 공부한다니 힘들어."
      }
    ]
  },
  {
    "id": 131,
    "grammar": "たところで (1)",
    "means": "~하고 나서\n~하고 난 직후에",
    "description": "앞 내용의 동작이나 변화가 끝난 직후 뒷내용의 행동이 발생하는 것을 표현",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "ところで",
        "word": "父は[ ありがとう ]と言ったところで静かに息を引き取った。",
        "mean": "남편은 '고마워'라고 말하고 난 후 조용히 숨을 거두었다."
      },
      {
        "answer": "ところで",
        "word": "夢の中で悪魔と目があったところで目が覚めました。",
        "mean": "꿈에서 악마와 눈이 마주치고 난 직후 잠에서 깼습니다."
      },
      {
        "answer": "ところで",
        "word": "チャーハン半分食べたところでもうお腹いっぱいになった。",
        "mean": "볶음밥 반쯤 먹고 났더니 벌써 배가 불렀다."
      },
      {
        "answer": "ところで",
        "word": "ご飯ができたところで夫が帰ってきた。",
        "mean": "밥이 다 된 때에 남편이 돌아왔다."
      },
      {
        "answer": "ところで",
        "word": "店から出たところで日傘を忘れたことに気がついた。",
        "mean": "가게에서 나오고 난 직후에 양산을 잊어버린 것을 깨달았다."
      },
      {
        "answer": "ところで",
        "word": "ワクチン接種から９時間くらい経ったところで, 少し熱っぽさと寒気を感じた。",
        "mean": "백신 접종을 하고 9시간 정도 경과한 직후 약간의 열과 한기를 느꼈다."
      },
      {
        "answer": "ところで",
        "word": "話が出尽くしたところで終わることにしましょう。",
        "mean": "나올 이야기는 다 하고 나서 그만하기로 하죠."
      },
      {
        "answer": "ところで",
        "word": "餃子の皮に餡を詰めたところで眠くなった。",
        "mean": "만두피에 소를 채우고 났더니 졸린다."
      }
    ]
  },
  {
    "id": 132,
    "grammar": "たところで (2)",
    "means": "~해봤자\n아무리/설령~라도\n~했다 해도\n~했다 해서",
    "description":
        "뒤에 나오는 내용이 긍정문이 오느냐, 부정문이 오느냐에 따라 다소 사용법이 다르다. \n\n긍정문의 경우, 뒤에 양적인 부족, 질적인 부족이 서술된다. \n\n-부정문의 경우, 뒤에 [ しょうがない(어쩔 수 없다) ], [ 無駄だ(소용없다) ], [ 意味がない(의미가 없다) ]와 같이 부정적인 판단을 포함한 내용이 서술된다. \n뒤에 나오는 내용의 동작을 한다 해도 의미가 없다는 뉘앙스를 포함. \n\n앞부분에는 [ いくら(얼마나, 얼마큼) ], [ どんなに(아무리) ], [ たとえ(설령, 가령) ] 등이 호응한다 ",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "ところで",
        "word": "彼にいくら相談したところで, 無駄だからやめた方がいいよ。",
        "mean": "그에게 아무리 상의해 봤자 소용없으니 그만두는 게 좋아."
      },
      {
        "answer": "ところで",
        "word": "これ以上議論したところで, まだ答えが出るテーマではないので, 時間の無駄だよ。",
        "mean": "더 이상 논의해 봤자 아직 답이 나올 주제가 아니기 때문에 시간 낭비다."
      },
      {
        "answer": "ところで",
        "word": "終電まで後３分だし, いくら走ったところで, もう間に合わないよ。",
        "mean": "막차까지 앞으로 3분 밖에 남지 않았고 아무리 달린다고 해도 이미 시간에 맞출 수 없어."
      },
      {
        "answer": "ところで",
        "word": "いくら泣いたところで, 死んだ人間は生き返ったりしない。",
        "mean": "아무리 울어도 죽은 사람은 되살아 나지 않아."
      },
      {
        "answer": "ところで",
        "word": "怒ったところで, 何も解決しないし, まずは落ち着いて話をきこう。",
        "mean": "화를 내봤자 아무것도 해결되지 않고 우선 침착하게 이야기를 들어보자."
      },
      {
        "answer": "ところで",
        "word": "会社辞めたいが, 辞めたところで何するべきかも分からない。",
        "mean": "회사 그만두고 싶은데 그만둔다고 해도 뭘 해야 할지 모르겠어."
      },
      {
        "answer": "ところで",
        "word": "この問題, 習ってない公式が使われているし, いくら考えたところで, 答えなんてわからないよ。",
        "mean": "이 문제는 배운 적 없는 공식이 사용되었고 아무리 생각해 봤자 답 같은 건 모르겠어."
      },
      {
        "answer": "ところで",
        "word": "テスト前日になってから勉強したところで結果は変わらない。",
        "mean": "시험 전날이 되어서야 공부한다 해도 결과는 변하지 않아."
      },
      {
        "answer": "ところで",
        "word": "もう１０点差も開いているし, いくら頑張ったところで逆転は不可能だよ。",
        "mean": "이제 10점 차로 벌어져 있고 아무리 열심히 한다 해도 역전은 불가능할 거야."
      },
      {
        "answer": "ところで",
        "word":
            "妻がダイエットのために欲しいって言ってる器具があるんだけど, どうせ買ってあげたところで, すぐに使わなくなるんだろうなあ。",
        "mean": "아내가 다이어트를 위해서 갖고 싶다고 하는 기구가 있는데 어차피 사 준다고 해도 금세 사용하지 않게 되겠지."
      },
      {
        "answer": "ところで",
        "word": "僕なんかが告白したところで, どうせ断られるんだろうけど, このまま何も言わずに卒業するのは嫌だ。",
        "mean": "내가 고백해 봤자 어차피 거절당하겠지만 이대로 아무 말도 없이 졸업하는 건 싫어."
      },
      {
        "answer": "ところで",
        "word": "君が助けを求め​たところで, 誰も来たりしない。",
        "mean": "네가 도움을 청해도 아무도 오지 않아."
      }
    ]
  },
  {
    "id": 133,
    "grammar": "동사 사전형 + だに",
    "means": "(하는 것) 만으로도",
    "description":
        "[~するだけで] 와 같은 표현\n\n[思う, 考える, 想像する, 思い出す] 등 단어와 자주 연결된다.\n\n화자의 부정정적인 감정을 표현하는데 사용된다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "だに",
        "word": "坂本龍馬が当時何を思って生きていたのか, それを思うだに私も胸が熱くなる。",
        "mean": "사카모토 료마가 당시 무엇을 생각하며 살았는지, 그것을 생각 하는 것 만으로도 나도 가슴이 뜨거워진다."
      },
      {
        "answer": "だに",
        "word": "洪水で浸水した１階を綺麗にするなんて, 考えるだに気が狂いそうだ。",
        "mean": "홍수로 침수된 1층을 깨끗하게 하다니 생각만 해도 미칠 지경이다."
      },
      {
        "answer": "出すだに",
        "word": "生意気な後輩のことはいまだに思い出すだに腹が立つ。",
        "mean": "건방진 후배는 아직도 생각만 해도 짜증이 난다."
      },
      {
        "answer": "だに",
        "word": "政府の対応をニュースで聞くだにイライラさせられる。",
        "mean": "정부의 대응을 뉴스에서 듣기만 해도 짜증이 난다."
      },
      {
        "answer": "だに",
        "word": "激辛の真っ赤なスープを見るだに, 辛さに弱い私は死を感じる。",
        "mean": "새빨간 국물을 보기만 해도 매운맛에 약한 나는 죽음을 느낀다."
      },
      {
        "answer": "だに",
        "word": "これから２週間ホテルで隔離生活…　想像するだに気が滅入る。",
        "mean": "앞으로 2주간 호텔에서 격리생활.. 상상하는 것 만으로도 힘들다."
      },
      {
        "answer": "だに",
        "word": "数分遅れていたら私も事故にあっていた。そう思うだに怖くなる。",
        "mean": "몇 분 늦었더라면 나도 사고를 당했을 거야.그렇게 생각 하는것만으로도 무서워진다."
      },
      {
        "answer": "だに",
        "word": "あの時の失敗を思うだに赤面してしまう。",
        "mean": "그때의 실패를 생각 하는 것 만으로도 얼굴이 빨개져 버리다."
      }
    ]
  },
  {
    "id": 134,
    "grammar": "명사 + だに",
    "means": "조차",
    "description":
        "[~さえしない, ~さえ~ない] 와 같은 표현\n\n[夢にだに思わなかった (꿈에서 조차 생각하지 못했다)] 는 관용어\n\n[微動, 予想, 想像, 一顧] 등 한정된 단어에 쓰임",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "だに",
        "word": "母が倒れたと聞いても, 彼は微動だにしなかった。",
        "mean": "어머니가 쓰러졌다는 소식을 듣고도 그는 미동조차 하지 않았다."
      },
      {
        "answer": "だに",
        "word": "まさか宝くじが当たるなんて夢にだに思わなかった。",
        "mean": "설마 복권에 당첨되리라고는 꿈에도 조차도 생각지 못했다."
      },
      {
        "answer": "だに",
        "word": "予想だにしていなかったプロポーズを昨日され, 頭が真っ白のまま寝た。",
        "mean": "예상 조차 못한 청혼을 어제 받고 머리가 새하얗게 잤다."
      },
      {
        "answer": "だに",
        "word": "想像だにしない成功は起きない。",
        "mean": "상상 조차 못한 성공은 일어나지 않는다."
      },
      {
        "answer": "だに",
        "word": "この世界の外側には, 想像だにしない世界が広がっている。",
        "mean": "이 세상 밖에는 상상 조차 하지 못한 세계가 펼쳐져 있다."
      },
      {
        "answer": "だに",
        "word": "予想だにしないタイミングで夫が帰って来た。",
        "mean": "예상 조차 못한 타이밍에 남편이 돌아왔다."
      },
      {
        "answer": "だに",
        "word": "予想だにしなかった内容だったから一瞬頭の中が真っ白になった。",
        "mean": "예상 조차 못한 내용이라 순간 머릿속이 하얘졌다"
      },
      {
        "answer": "だに",
        "word": "彼の周囲の批判など一顧だにしない生き方はカッコいい。",
        "mean": "그의 주위의 비판 따위는 일고 조차 하지 않는 생활방식은 멋있다."
      }
    ]
  },
  {
    "id": 135,
    "grammar": "~だの ~だの (と) ",
    "means": "~나 ~등\n~라느니 ~라느니 ",
    "description":
        "어떠한 공통 사항을 가진 요소들 중에서 몇 가지 열거하는 일부 열거형 병렬 조사이며 다른 요소의 존재도 암시하고 있다. \n\n대부분의 경우 열거한 것에 대해 혐오감이나 불쾌감, 적의와 같은 부정적인 뉘앙스를 가진다.\n\n보통 2가지 요소를 열거하지만 3가지 이상 열거하는 것도 가능하다. 또한 두 번째 요소는 생략도 가능하다. 그럴 경우에는 [ ~だの何だの (と) ]와 같이 관용적인 표현을 사용함. \n\n[やれ~だの, やれ~だのと] 문법과 같음",
    "connectionWays":
        "명사 + だの + 명사 + だの (と) \nナ형용사 어간 + だの + ナ형용사 어간 + だの (と) \nイ형용사 보통형 + だの + イ형용사 보통형 + だの (と) \n동사 보통형 + だの + 동사 보통형 + だの (と) \n회화문 + だの + 회화문 + だの (と) \n~だの何だの (と) ",
    "examples": [
      {
        "answer": "だの",
        "word": "霊能者とか大嫌いだ。守護霊の言葉だの除霊だのと変なことばかり言うから。",
        "mean": "영능자 같은 거 너무 싫어.수호령 말이니 제령이니 하는 이상한 소리만 하니까."
      },
      {
        "answer": "だの",
        "word": "最近は元首相銃撃事件だのカルト宗教だのと殺伐としたニュースが多い。",
        "mean": "요즘은 전직 총리 총격사건이니 컬트 종교니 살벌한 뉴스가 많다."
      },
      {
        "answer": "だの",
        "word": "注意をしたら誹謗中傷だの差別だのの逆ギレされた。",
        "mean": "주의를 했더니 비방 중상이니 차별이니 역겨움을 당했다."
      },
      {
        "answer": "だの",
        "word": "脚痛いだの腰痛いだの雨降ってるだのとジョギングサボってたら太ってきた。",
        "mean": "다리아프다 라며 허리아프다 라며 비온다며 조깅 빼먹었더니 뚱뚱해졌다."
      },
      {
        "answer": "だの",
        "word": "せっかく夜ご飯作ったのに味が薄いだの, 美味しくないだの色々文句言われた。",
        "mean": "모처럼 저녁 만들었는데 싱겁다느니, 맛없다느니 이런저런 불평을 들었다."
      },
      {
        "answer": "だの",
        "word": "人の趣味とか好きなものに対して下手だのもっと練習しろだの文句言ってくる人って最低だと思う。",
        "mean": "남의 취미나 좋아하는 것에 대해서 서툴다거나 연습하라거나 뭐라고 하는 사람은 최악이라고 생각해."
      },
      {
        "answer": "だの",
        "word": "友達すら信じきれていない。もしかしたら裏で悪く言われているだの, 実は嫌われているだのと被害妄想ばかりしている。",
        "mean":
            "친구조차 믿지 못하고 있다.혹시 뒤에서 나쁘게 욕 먹는 있다 라느니, 실은 미움받고 있는 거야 라느니 하고 피해망상만 하고 있어."
      },
      {
        "answer": "だの",
        "word": "それは正しいだのそれは間違っているだのという他人の意見はどうでもいい。自分が後悔するかどうかが大切なんだ。",
        "mean": "그것은 옳다느니 그건 틀렸다느니 하는 다른 사람의 의견은 아무래도 좋다.내가 후회하느냐가 중요해."
      },
      {
        "answer": "だの",
        "word": "あんだけ[ 私は味方 ]だの何だのと言ってたくせに, 肝心なときに助けてくれない。",
        "mean": "그렇게 나는 내 편이니 뭐니 하면서 중요할 때 도와주지 않는다."
      }
    ]
  },
  {
    "id": 136,
    "grammar": "~た弾みに / 弾みで / た拍子に / 拍子で",
    "means": "~한 것 때문에 무심코 ~해버리다\n~하는 바람에 ~해버리다\n~한 순간 ~해버리다",
    "description":
        "앞에 사건이 동기(원인)가 되어 뒤에 사건이 우발적으로 발생하는 것을 나타낸다\n\n이 표현의 [ 弾み(はずみ) ]와 [ 拍子(ひょうし) ]는 순간적인 기세나 계기를 의미함. \n\n사람의 부주의로 혹은 깜빡하여 일어난 현상을 서술할 때 사용한다. \n\n[ その弾みに ], [ その拍子に ], [ 何かの拍子に ]처럼 표현하기도 한다. ",
    "connectionWays": "동사 과거형+ 弾みに / 弾みで\n동사 과거형+ 拍子に / 拍子で",
    "examples": [
      {
        "answer": "拍子に",
        "word": "お店で人とぶつかった拍子に持っていたグラスを落として割ってしまった。",
        "mean": "가게에서 사람과 부딪히는 바람에 들고 있던 잔을 떨어뜨려 깨뜨려 버렸다."
      },
      {
        "answer": "弾みに",
        "word": "重い荷物を持ち上げようとした弾みに, 腰を痛めてしまった。",
        "mean": "무거운 짐을 들어 올리려고 하는 바람에 허리를 다쳐 버렸다."
      },
      {
        "answer": "弾みに",
        "word": "こんな人通りの多いところで駆け回っていると, 何かの拍子で大惨事になりかねない。",
        "mean": "이런 인적이 많은 곳에서 뛰어다니면 어쩌다가 대참사가 될 수도 있다."
      },
      {
        "answer": "拍子に",
        "word": "寝起きによろけた拍子に, 足首をひねって痛めた。",
        "mean": "자고 일어나 비틀거리는 바람에 발목을 비틀어 다쳤다."
      },
      {
        "answer": "弾みで",
        "word": "後ろから誰かに押された弾みで, 靴が脱げてしまった。",
        "mean": "뒤에서 누군가에게 밀리는 바람에신발이 벗겨지고 말았다."
      },
      {
        "answer": "弾みに",
        "word": "酔った弾みに, トムさんの秘密を漏らしてしまった。",
        "mean": "취한 김에 톰 씨의 비밀을 누설해 버렸다."
      },
      {
        "answer": "拍子に",
        "word": "昔のことを, ふとした拍子に思い出す。",
        "mean": "옛날 생각이 문득 생각났다."
      },
      {
        "answer": "拍子に",
        "word": "人とぶつかった拍子に, 持っていたスマホを落としてしまった。",
        "mean": "사람과 부딪히는 바람에 들고 있던 스마트폰을 떨어뜨리고 말았다."
      },
      {
        "answer": "弾みに",
        "word": "転んだ弾みに, 頭を打ってしまった。",
        "mean": "넘어지는 바람에 머리를 쳐버렸다."
      },
      {
        "answer": "拍子で",
        "word": "何かの拍子で, 突然電気が消えた。",
        "mean": "어쩌다 갑자기 전기가 꺼졌다."
      },
      {
        "answer": "拍子に",
        "word": "ふとした拍子に, 好きだった元彼のことを思い出して涙が出た。",
        "mean": "문득 좋아했던 전 남자친구가 생각나서 눈물이 났다."
      }
    ]
  },
  {
    "id": 137,
    "grammar": "~たら ~たで",
    "means": "~하면 ~하는 대로, ~하면 할수록",
    "description":
        "[~할 경우 당연히~해야 한다, ~한다면 반드시 ~다 ] 라는 결과가 된다는 의미 \n\n2개의 대립하는 사건을 나열하고 어느 쪽이든 같다는 것을 나타내는 표현. ",
    "connectionWays":
        "동사た형+ら + 동사 과거형 + で/で\nい형용사 어간かったら + い형용사 어간かった + で\nな형용사 어간だったら/なら + な형용사 어간 + だったで/で\n명사だったら/なら  + 명사  + だったら/で \n*같은 단어를 반복해서 사용",
    "examples": [
      {
        "answer": "たで",
        "word": "もちろん, 安く買えるほうがいいが, 安かったら安かったで少し不安になる。",
        "mean": "물론 싸게 사는 게 좋지만 싸면 싼 대로 조금 불안해져."
      },
      {
        "answer": "なら",
        "word": "仕事, 暇そうでいいねなんて言われますが, 暇なら暇で眠くなるし, つまらないし, ストレスもたまりますよ。",
        "mean": "일이 한가해 보여서 좋겠다고 하지만 한가하면 한가한 대로 졸리고, 지겹고, 스트레스도 쌓여요."
      },
      {
        "answer": "たで",
        "word": "駅に近いほど便利だが, 近かったら近かったで家賃は高いし, 騒音も気になります。",
        "mean": "역에서 가까울수록 편리하지만, 가까우면 가까울수록 집세는 비싸고 소음도 신경 쓰입니다."
      },
      {
        "answer": "たで",
        "word": "最初はあまり興味なかったけど, 観たら観たで面白かった。",
        "mean": "처음에는 그다지 흥미가 없었지만 보면 볼수록 재미있었다."
      },
      {
        "answer": "たで",
        "word": "ダメだったらダメだったでまた来年の試験頑張ればいいでしょ。",
        "mean": "안되면 안 되는 대로 다시 내년 시험 열심히 하면 되지."
      },
      {
        "answer": "たで",
        "word": "たくさん寝て熱が下がったのはいいけど, 元気になればなったで今度は眠れなくなってしまった。",
        "mean": "많이 자서 열이 내린 것은 좋은데 건강해지면 건강해진 대로 이번에는 잠을 잘 수 없게 되어버렸다."
      },
      {
        "answer": "たで",
        "word": "失敗したらしたで, もう一度チャレンジすればいい。",
        "mean": "실패하면 실패한 대로 다시 한번 도전하면 된다."
      },
      {
        "answer": "たで",
        "word": "背が高いのを羨ましがられますが, 高かったら高かったで嫌なこともありますよ。",
        "mean": "키가 큰 것에 부러움을 사지만 크면 큰 대로 싫은 것도 있어요."
      },
      {
        "answer": "たで",
        "word": "すごく眠いのに寝たら寝たですぐ起きてしまう。",
        "mean": "너무 졸린데 잠들면 잠드는 대로 금방 일어나 버린다."
      },
      {
        "answer": "たで",
        "word": "お金持ちになるのは簡単じゃないし, お金持ちになったらなったでお金持ちなりの苦労も待っている。",
        "mean": "부자가 되는 것은 간단하지 않고(쉽지 않고), 부자가 되면 되는 대로 부자 나름의 고생도 가지고 있다."
      }
    ]
  },
  {
    "id": 138,
    "grammar": "~たら ~ところだ",
    "means": "~했다면 ~할 것이다\n~했다면 ~일 것이다.",
    "description":
        "실제 일어나지 않은 일을 혹시 일어났더라면 어떻게 되었을지를 서술하는 반사실 조건을 나타낸다. \n\n앞에 [ ~ば ], [ ~たら ], [ ~なら ]와 같이 조건문이 온다 ",
    "connectionWays": "조건문 + ところだ",
    "examples": [
      {
        "answer": "ところだ",
        "word": "一国の主を批判する行為は, 昔だったら処刑されているところだ。",
        "mean": "한 나라의 주인을 비판하는 행위는 옛날 같으면 처형당했을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "もし遅刻しなければ, 今頃ゆっくりお昼ご飯でも食べてるところだろう。",
        "mean": "만약 지각하지 않았더라면 지금쯤 천천히 점심이라도 먹고 있을 거야."
      },
      {
        "answer": "ところだ",
        "word": "父が生きていたら, 一緒にテーブルを囲んで料理を食べていたところだろう。",
        "mean": "아버지가 살아계셨다면 함께 테이블에 둘러앉아 요리를 먹었을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "手伝ってくれなければ, とっくに諦めていたところだ。",
        "mean": "도와주지 않았다면 진작에 포기했을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "落とした財布を届けてくれなかったら, 今頃途方に暮れていたところだ。",
        "mean": "잃어버린 지갑을 가져다주지 않았다면 지금쯤 어찌할 바를 몰랐을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "秘密がバレたら大喧嘩になっていたところだ。",
        "mean": "비밀이 들킨다면 큰 싸움이 되었을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "アドバイスをくれなければ逃げ出していたところだ。",
        "mean": "조언을 해주지 않았더라면 도망쳤을 것이다."
      },
      {
        "answer": "ところだ",
        "word": "パソコン修理してくれなかったら今頃買い替えていたところだ。",
        "mean": "컴퓨터를 수리해 주지 않았더라면 지금쯤 다시 샀을 것이다(교체했을 것이다)."
      }
    ]
  },
  {
    "id": 139,
    "grammar": "~たらしい / ~ったらしい",
    "means": "~한 느낌이 들다\n~스럽다\n~롭다",
    "description":
        "접속하는 단어의 상태, 그 정도가 도를 지나쳐 혐오감에 달했을 때 사용하는 표현. 좋지 않은 상황에 사용. \n\n같이 사용하는 단어는 정해져 있으며 많지는 않다. ",
    "connectionWays":
        "명사 + たらしい / ったらしい\nい형용사어간 + たらしい / ったらしい\nな형용사어간 + たらしい / ったらしい",
    "examples": [
      {
        "answer": "ったらしい",
        "word": "友人の身体を蝕んでいる癌が憎ったらしい。",
        "mean": "친구의 몸을 갉아먹고 있는 암이 밉다."
      },
      {"answer": "たらしい", "word": "生活が貧乏たらしい。", "mean": "생활이 가난하다."},
      {
        "answer": "たらしい",
        "word": "いつまでも独りなのは辛いし, 自分が惨めったらしく感じてきた。",
        "mean": "언제까지나 혼자인 것은 괴롭고 내가 비참한 듯 느껴졌다."
      },
      {
        "answer": "ったらしい",
        "word": "相手に用件を伝える時は, 長ったらしい内容では良くない。",
        "mean": "상대방에게 용건을 전달할 때는 긴 듯한 내용은 좋지 않다"
      },
      {
        "answer": "たらしい",
        "word": "彼はいつも自慢たらしい話っぷりをする。",
        "mean": "그는 늘 자랑하는 듯이 이야기를 한다."
      },
      {
        "answer": "ったらしい",
        "word": "アイスクリームのフタの裏を舐める癖が貧乏ったらしいと言われた。",
        "mean": "아이스크림 뚜껑 뒷면을 핥는 버릇은 궁상맞다고 한다."
      },
      {
        "answer": "ったらしい",
        "word": "嫌みったらしいことばかり言っていると, 友達は減っていくばかりだ。",
        "mean": "싫은 말만 하면 친구는 줄어들기만 한다"
      },
      {
        "answer": "たらしい",
        "word": "私は貧乏たらしい生活から免れるために頑張ってお金を稼いだ。",
        "mean": "나는 궁상맞은 생활에서 벗어나기 위해 열심히 돈을 벌었다."
      }
    ]
  },
  {
    "id": 140,
    "grammar": "~たら(~ば)それまでだ / ~たら(~ば)それまでのことだ / ~はそれまでだ (1)",
    "means": "~하면 그걸로 끝이다\n~하면 그만이다",
    "description":
        "가정 조건문에 뒤에 붙어서 어떠한 사건이 한계에 달하는 것, 끝나는 것을 나타낸다. \n\n'혹시 그렇게 되었더라면 끝났을 것이다'라는 의미이지만, 끝이 오는 것에 안타까운 마음을 가지는 것이 아니고 또한 그것을 나쁘게 받아들이지도 않다. \n\n화자의 낙관적인 태도, 납득에 의한 포기, 꽉 막혔던 것이 뚫리는 듯한 모습을 나타낼 수 있는 표현. ",
    "connectionWays":
        "동사た형 + ら + それまで (のこと) だ\n동사ば형 + それまで (のこと) だ\n~ならそれまで (のこと) だ\n~たらそれまで (のこと) だ\n~ればそれまで (のこと) だ",
    "examples": [
      {
        "answer": "たらそれまでだけど",
        "word": "彼に不満を伝えた。別れようって言われたらそれまでだけど, ずっと我慢している自分も嫌だ。",
        "mean": "그에게 불만을 전했다. 헤어지자는 말을 들으면 그걸로 끝인 것을 줄곧 참고 있는 나도 싫다."
      },
      {
        "answer": "ならそれまでだ",
        "word": "意見の相違があった場合はお互い話し合う。話し合ったのにどちらかが納得できなかったならそれまでだ。",
        "mean": "의견의 차이가 있을 경우 서로 의논한다. 의논했는데도 어느 한 쪽이 납득할 수 없다면 그걸로 끝이다."
      },
      {
        "answer": "ばそれまでのことだけど",
        "word": "[ 本人が決めたこと ]で片づければそれまでのことだけど, 推しが卒業するのはやっぱりしんどい。",
        "mean": "본인이 결정한 것'으로 정리하면 그걸로 됐지만, 최애가 탈퇴하는 것은 역시 괴롭다."
      },
      {
        "answer": "死んだらそれまでだ",
        "word": "家族や友達が死ぬのは悲しいけど, 自分が死ぬのは別にいい。死んだらそれまでだと思っている。",
        "mean": "가족이나 친구가 죽는 것은 슬프지만 내가 죽는 것은 그다지 상관없다. 죽으면 그걸로 끝이라고 생각한다."
      },
      {
        "answer": "たらそれまでのこと",
        "word": "考え方は人それぞれと言われたらそれまでのことだけど, 彼のやり方はどうしても気に入らない。",
        "mean": "사고방식은 사람 제각각이라고 한다면 그걸로 됐지만, 그의 방식은 아무래도 마음에 들지 않는다."
      },
      {
        "answer": "たらそれまでのこと",
        "word": "[ ご縁 ]が恋愛を決める。勇気を出して告白をし想いを伝えましょう。断られたらそれまでのこと。",
        "mean": "인연'이 연애를 결정한다. 용기를 내서 고백하고 마음을 전달하자. 거절당하면 그걸로 됐다."
      },
      {
        "answer": "えばそれまでだ",
        "word": "有名企業に就職したからといって, 辞めてしまえばそれまでだ。",
        "mean": "유명 회사에 취직했더라도 그만둬버리면 그걸로 끝이다."
      }
    ]
  },
  {
    "id": 141,
    "grammar": "~たら(~ば)それまでだ/~たら(~ば)それまでのことだ/~はそれまでだ (2)",
    "means": "~하면 모든 게 끝이다\n~는 거기까지이다\n아무 소용 없다.",
    "description":
        "어떠한 상황, 일이 끝나는 것을 나타낸다. \n\n그 행동을 하면 지금까지의 노력이나 성과가 쓸모없는 것이라고 말할 때 사용.\n\n타인에게 사용하면 엄격한 어조가 되고, 냉대하는 듯한 뉘앙스가 된다.\n\n(1) 번 용법과는 달리, 낙관적인 뉘앙스는 없다. ",
    "connectionWays":
        "동사た형 + ら + それまで (のこと) だ\n동사ば형 + それまで (のこと) だ\n~ならそれまで (のこと) だ\n~たらそれまで (のこと) だ\n~ればそれまで (のこと) だ",
    "examples": [
      {
        "answer": "それまでです",
        "word": "常連さんを大切にしない店はそれまでです。",
        "mean": "단골을 소중하게 여기지 않는 가게는 거기까지다."
      },
      {
        "answer": "それまでです",
        "word": "理解できないならあなたはそれまでです。これ以上話しても無駄です。",
        "mean": "이해되지 않는다면 당신은 거기까지다. 이 이상 이야기해도 소용없다."
      },
      {
        "answer": "それまでです",
        "word": "いくら高そうな服を買っても, 着なければそれまでです。",
        "mean": "아무리 비싼 옷을 샀더라도 입지 않으면 그걸로 끝이다"
      },
      {
        "answer": "それまでだろう",
        "word": "この条件を飲んでくれないなら, 契約交渉はそれまでだろう。",
        "mean": "이 조건을 받아들여 주지 않는다면 계약 교섭은 여기까지 일 것이다."
      },
      {
        "answer": "それまでだ",
        "word": "恋愛は相手あってのものだから相手に配慮できなければ話はそれまでだ。",
        "mean": "연애는 상대가 있어야 가능한 것이라 상대를 배려하지 못한다면 이야기는 거기까지다."
      },
      {
        "answer": "それまでなんだけど",
        "word": "勝てる可能性はほとんど無かったと言われればそれまでなんだけど, それでも奇跡が起こるかもしれないと思っていたんだ。",
        "mean": "이길 가능성은 거의 없다고 하면 그걸로 끝이지만, 그래도 기적이 일어날지도 모른다고 생각하고 있었어."
      },
      {
        "answer": "それまでだ",
        "word": "自分がうまくいかないのを教師のせい, 親のせいにしてるやつはそれまでだ。",
        "mean": "자신이 잘 안되는 것을 선생님 탓, 부모 탓을 하는 녀석은 거기까지다."
      }
    ]
  },
  {
    "id": 142,
    "grammar": "~たりとも~ない",
    "means": "~도, ~조차도",
    "description":
        "뒤에 오는 내용은 반드시 부정.\n\n[ ~さえも~ない ]와 거의 비슷한 의미이며, 수(수량)가 적은 것을 특별히 강조하는 표현. \n\n(何人たりとも: 그 누구라 하더라도, 그 누구도 예외 없이) 는 관용표현. ",
    "connectionWays": "1 + 助数詞 + たりとも~ない",
    "examples": [
      {
        "answer": "たりとも",
        "word": "ジョンさんは１日たりとも学校を休んだことがありません。",
        "mean": "존 씨는 하루도 학교를 쉰 적이 없어요."
      },
      {
        "answer": "たりとも",
        "word": "試合が終わるまで, 何が起こるかわからないので, 一瞬たりとも油断はできない。",
        "mean": "시합이 끝나기까지 무슨 일이 일어날지 모르기 때문에 한순간도 방심할 수 없어."
      },
      {
        "answer": "たりとも",
        "word": "ダイエットして２週間が経ったけど, １kgたりとも落ちなかった。",
        "mean": "다이어트를 시작하고 2주가 지났지만, 1kg도 빠지지 않았다."
      },
      {
        "answer": "たりとも",
        "word": "ラーメンのスープは体に良くないと知りつつも, つい一滴たりとも残さず飲んでしまう。",
        "mean": "라면 국물이 몸에 좋지 않다는 걸 알면서도, 나도 모르게 한 방울도 남김없이 마시고 만다."
      },
      {
        "answer": "たりとも",
        "word": "何人たりともこの先に立ち入ることは許されません。",
        "mean": "그 누구라 하더라도 이 이상 개입하는 것은 용서할 수 없습니다."
      },
      {
        "answer": "たりとも",
        "word": "橋本さんは一度たりとも仕事の文句を言ったことがありません。",
        "mean": "하시모토 씨는 한 번도 일에 대해 불평을 말한 적이 없습니다."
      },
      {
        "answer": "たりとも",
        "word": "これはみんなが寄付してくれたお金だから一円たりとも無駄にはできない。",
        "mean": "이것은 모두가 기부해 준 돈이니까 1엔도 낭비할 수 없다."
      },
      {
        "answer": "たりとも",
        "word": "渋滞で１ミリたりとも進まない。",
        "mean": "정체가 심해서 1 mm도 나아가지 않는다."
      },
      {
        "answer": "たりとも",
        "word": "プライベートでは一杯たりともビールを飲みたくない。",
        "mean": "사적으로는 한 잔도 맥주를 마시고 싶지 않다."
      },
      {
        "answer": "たりとも",
        "word": "試験まであと１週間なので, 1秒たりとも無駄にはできない。",
        "mean": "시험까지 앞으로 1주 남았기 때문에, 1초도 허비할 수 없다."
      }
    ]
  },
  {
    "id": 143,
    "grammar": "たるもの",
    "means":
        "~이기 때문에 (당연히)\n~인 입장이기 때문에 (당연히)\n적어도~로서의 자격(입장)을 갖추고 있는\n~인 자격(입장)\n~된 자격(입장)",
    "description":
        "たる 앞에는 직업이나 입장을 나타내는 명사가 접속한다. \n\n뒷 부분에는 [ ~するべき ], [ ~しなければならない ], [ ~してはいけない ] 등이 호응하며, 그 직업이나 입장에 있는 사람은 이렇게 해야 한다고 규정 하는 표현. \n\n[ ~たるに ]는 뒷부분에 [ 値する ],[ ふさわしい ] 등이 오는 경우가 많으며, [ ~としての基準を満たしている ]라는 의미를 나타낸다. ",
    "connectionWays": "명사 + たるもの\n명사 + たる+명사\n~たるに値する / ふさわしい",
    "examples": [
      {
        "answer": "たるもの",
        "word": "政治家たるもの, 発言には慎重にならなければならない。",
        "mean": "정치인으로서, 발언에는 신중해야 한다."
      },
      {
        "answer": "たるもの",
        "word": "医者たるもの, 患者の命を第一に考えるべきだ。",
        "mean": "의사로서, 환자의 생명을 제일로 생각해야 한다."
      },
      {
        "answer": "たるもの",
        "word": "教師たるもの, 学生の見本となるような行動すべきだ。",
        "mean": "교사로서, 학생의 본보기가 되는 행동을 해야 한다."
      },
      {
        "answer": "たるもの",
        "word": "家庭を守る。それが父たるものの役目である。",
        "mean": "가정을 지킨다. 그것이 아버지로서의 책임이다."
      },
      {
        "answer": "たるに",
        "word": "前回の大会王者たるにふさわしい活躍だった。",
        "mean": "지난번 대회 우승자 다운 활약이었다."
      },
      {"answer": "たる", "word": "彼には社長たる資質がない。", "mean": "그에게는 사장다운 자질이 없다."},
      {
        "answer": "たる",
        "word":
            "憲法は[ 内閣は, 法律の定めるところにより, その首長たる内閣総理大臣及びその他の国務大臣でこれを組織する ]と定めている。",
        "mean":
            "헌법은 '내각은 법률이 정하는 바에 따라 그 수장인 내각총리대신 및 그 밖의 국무 대신으로 이를 조직한다'라고 정하고 있다."
      },
      {
        "answer": "たるに",
        "word": "【労働基準法第一条】労働条件は, 労働者が人たるに値する生活を営むための必要を充たすべきものでなければならない。",
        "mean":
            "[노동기준법 제1장] 노동조건은 노동자가 사람에 합당한 생활(사람다운 생활)을 영위하기 위해 필요를 충족해야 한다."
      }
    ]
  },
  {
    "id": 144,
    "grammar": "だろうに",
    "means": "~일 텐데, ~할 텐데, ~인데",
    "description":
        "1. 타인의 행동이나 처지에 대한 화자의 동정을 나타낸다. \n\n이 표현 다음에는 그에 대한 평가를 서술하지만 생략할 수 있다 \n\n2. 해야 할 일을 하지 않은 것과 실제로 일어나지 않은 것(사실에 반하는 가정)에 대해 안타까운 기분을 나타낸다.\n\n뒷부분 내용은 생략할 수 있다. ",
    "connectionWays": "문장 보통형 + だろうに",
    "examples": [
      {
        "answer": "だろうに",
        "word": "寒かっただろうに, 10キロも歩いてきたなんて",
        "mean": "추웠을 텐데, 10킬로미터나 걸어오다니"
      },
      {
        "answer": "だろうに",
        "word": "本当は怒りたかっただろうに, 謝ったら許してくれた。",
        "mean": "원래는 화내고 싶었는데, 사과했더니 용서해 줬다."
      },
      {
        "answer": "だろうに",
        "word": "謝るにも言い方ってものがあるだろうに。",
        "mean": "사과하는 데에도 표현 방법이라는 게 있는데."
      },
      {
        "answer": "だろうに",
        "word": "このお見合い写真はひどすぎる。もっといい写真があっただろうに。",
        "mean": "이 맞선 사진 너무 심하다. 더 괜찮은 사진 있었을 텐데."
      },
      {
        "answer": "だろうに",
        "word": "2人以上で尾行していれば彼を見失うことはなかっただろうに。",
        "mean": "두 명 이상 미행했더라면 그를 놓치는 일은 없었을 텐데."
      },
      {
        "answer": "だろうに",
        "word": "悪意があって発言したわけではなかっただろうに, 言葉尻を捕まえられてかわいそうだ。",
        "mean": "악의를 가지고 말한 건 아닐 텐데, 말꼬리를 붙잡혀 불쌍하다."
      },
      {
        "answer": "だろうに",
        "word": "リスクはあるだろうに, なぜ続いているのか話を聞いてみたい。",
        "mean": "위험이 있을 텐데, 왜 계속하고 있는지 이야기를 들어보고 싶다."
      },
      {
        "answer": "だろうに",
        "word": "この問題ちゃんと読めば解けただろうに, 急いでいたからミスしてしまった。",
        "mean": "이 문제를 제대로 읽었다면 풀 수 있었을 텐데, 급하게 하느라 실수하고 말았다."
      },
      {
        "answer": "だろうに",
        "word": "子育てで疲れているだろうに, 妻は家事も頑張ってくれている。",
        "mean": "아이를 양육하는 데 피곤할 텐데, 아내는 집안일도 열심히 해주고 있다."
      },
      {
        "answer": "だろうに",
        "word": "うまくやればバレなかっただろうに, ついぼろが出てしまったみたいだ。",
        "mean": "제대로 했다면 안 들켰을 텐데, 그만 약점을 들키고 만 것 같다."
      }
    ]
  },
  {
    "id": 145,
    "grammar": "~つ ~つ",
    "means": "~거니 ~거니\n~하기도 하고 ~하기도 하고",
    "description":
        "정반대의 의미를 가진 동사를 사용하여, 그것이 반복해서 교차로 행해지는 것을 나타낸다. \n\n抜きつ抜かれつ(앞서거니 뒤서거니)\n持ちつ持たれつ(서로 도움, 또는 그 관계)\n行きつ戻りつ(왔다 갔다 함, 서성거림)\n追いつ追われつ(쫓고 쫓기며)\n押しつ押されつ(밀치락 달치락)\n浮きつ沈みつ(떴다가 가라앉음, 흥망성쇠) 등 관용적 표현에 한다. ",
    "connectionWays": "동사ます형 +つ + 동사ます형+つ",
    "examples": [
      {"answer": "つ", "word": "持ちつ持たれつの関係", "mean": "서로 돕는 관계"},
      {
        "answer": "つ",
        "word": "あれは抜きつ抜かれつの良い試合だった。",
        "mean": "저것은 쫓고 쫓기는 좋은 시합이었다."
      },
      {
        "answer": "つ",
        "word": "鍋の中で豆腐が浮きつ沈みつしている。",
        "mean": "낸다비 안에서 두부가 떠올랐다가 가라앉았다고 한다."
      },
      {
        "answer": "つ",
        "word": "圧倒的な実力差のあるゲームは面白くない。追いつ追われつするシーソーゲームが最も見ごたえがある。",
        "mean": "압도적인 실력차가 있는 게임은 재미있지 않다. 엎치락뒤치락하는 시소게임이 가장 볼 만하다."
      },
      {
        "answer": "つ",
        "word": "今夜の月は雲間から見えつ隠れつしている。",
        "mean": "오늘 밤 달은 구름 사이로 보일 듯 안 보일듯한다."
      },
      {
        "answer": "つ",
        "word": "押しつ押されつの良い試合でしたが, ギリギリのところで相手の戦略に負けた。",
        "mean": "밀치락 달치락하는 좋은 시합이었습니다만, 아슬아슬한 부분에서 상대방의 전략에 졌다."
      },
      {
        "answer": "つ",
        "word": "猫と人の付き合いは一万年。持ちつ持たれつの関係だ。",
        "mean": "고양이와 사람의 사귐은 일 만년. 서로 돕는 관계다."
      },
      {
        "answer": "つ",
        "word": "葉が水面を浮きつ沈みつ漂っている。",
        "mean": "잎이 수면에 떴다가 가라앉았다가하며 떠돈다."
      },
      {
        "answer": "つ",
        "word": "抜きつ抜かれつの良いレースだった。",
        "mean": "앞서거니 뒤서거니 하는 좋은 경주였다."
      },
      {
        "answer": "つ",
        "word": "夢と現実を行きつ戻りつし, 結局１２時間寝続けた。",
        "mean": "꿈과 현실을 왔다 갔다 하다가 결국 12시간 계속 잤다."
      }
    ]
  },
  {
    "id": 146,
    "grammar": "~尽くす",
    "means": "다~하다, 끝까지~하다.",
    "description":
        "동작의 완료, 남기지 않고 모든 것을 다 끝냈음을 나타낸다. \n\n특히 사물이나 사건의 수량적인 부분에 착안하여, 많은 것을 남김없이 마지막까지 끝냈다는 점에 대해 기술할 때 사용. \n\n비슷한 표현으로는 [ ~切る ]가 있지만 이 표현은 동작의 완수를 강조하고 싶을 때 사용. ",
    "connectionWays": "동사ます형 + つくす\n동사ます형 + つくせないほどだ\n동사ます형 + つくせないほどの + 명사",
    "examples": [
      {"answer": "尽くした", "word": "料理は綺麗に食べ尽くした。", "mean": "요리는 깨끗하게 다 먹었다."},
      {
        "answer": "尽くした",
        "word": "この部屋は調べ尽くしたから, 次は隣の部屋だ。",
        "mean": "이 방은 다 조사했으니, 다음은 옆 방이다."
      },
      {
        "answer": "つくした",
        "word": "昨日は久しぶりに, 朝から晩まで遊びつくした。",
        "mean": "어제는 오랜만에 아침부터 밤까지 다 놀았다."
      },
      {
        "answer": "つくす",
        "word": "今の気持ちを一言で言いつくすのは難しいですが, とにかく嬉しいです。",
        "mean": "지금 기분을 한 마디로 다 말하기는 어렵습니다만, 어쨌거나 기쁩니다."
      },
      {
        "answer": "尽くす",
        "word": "人類は地球の資源を取り尽くす前に, それらの代替となるエネルギーを探さなければならない。",
        "mean": "인류는 지구의 자원을 다 뺏기 전에, 그것들의 대체가 될 에너지를 찾아야 한다."
      },
      {
        "answer": "尽くせない",
        "word": "この夏は語り尽くせないほどの思い出を作りたい。",
        "mean": "이번 여름은 다 말할 수 없을 정도로 추억을 만들고 싶어."
      },
      {
        "answer": "つくしている",
        "word": "彼はマレーシアが大好きで, マレーシアのことなら何でも知りつくしている。",
        "mean": "그는 말레이시아를 매우 좋아해서, 말레이시아에 대한 것이라면 뭐든 다 알고 있어."
      },
      {
        "answer": "つくした",
        "word": "もうアイデアは出つくしたかなあ。他に何かある？",
        "mean": "이제 아이디어는 다 나왔나. 또 뭐 있어?"
      },
      {
        "answer": "つくした",
        "word": "なんとか, セール品を全て売りつくした。",
        "mean": "어떻게든 세일 상품을 모두 다 팔았다."
      },
      {
        "answer": "つくされた",
        "word": "会場には熱狂的なファンで埋めつくされた。",
        "mean": "회장에는 열광적인 팬들로 가득 찼다."
      }
    ]
  },
  {
    "id": 147,
    "grammar": "っぱなし",
    "means": "~한 채로, 계속~함",
    "description":
        "1. 원래 해야할 일이 있는데도, 하지 않고(방치하고) 그 상태로 두는 것을 나타낸다. \n\n2. 같은 행동이나 상태를 계속 유지하는 것을 나타낸다. \n\n・1, 2 의미 모두 화자가 사물이나 상황에 대해 부정적인 뉘앙스를 가지고 말하는 것이기 때문에 좋지 않은 일에 사용하는 경우가 많다. \n\n・최근에는 'ゴルフの打ちっぱなし(골프 치기만 함)', '歌いっぱなし(노래하기만 함)'처럼 '~放題'와 같은 의미로 사용하기도 한다. (부정적인 뉘앙스는 없음)",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "っぱなし",
        "word": "アパレルの仕事は立ちっぱなしの仕事だから, とても大変です。",
        "mean": "의류 판매일은 계속 서 있어야 하는 일이라서, 매우 힘들어요."
      },
      {
        "answer": "っぱなし",
        "word": "たかし, 服が脱ぎっぱなしよ。きちんと洗濯機に入れなさい。",
        "mean": "다카시, 옷을 벗어둔 채잖니. 제대로 세탁기에 넣으렴."
      },
      {
        "answer": "っぱなし",
        "word": "車上荒らしが多発していますので, 車内に荷物を置きっぱなしにしないようにしましょう。",
        "mean": "차량 털이가 많이 발생하고 있기 때문에, 차 안에 짐을 그대로 두지 않도록 합시다."
      },
      {
        "answer": "っぱなし",
        "word": "今年が始まってから, ずっとチームは負けっぱなしだ。",
        "mean": "올해가 시작되고부터 계속 팀은 지기만 한다."
      },
      {
        "answer": "っぱなし",
        "word": "先月から休みがなくずっと働きっぱなしだ。",
        "mean": "지난달부터 휴일 없이 계속 일만 하고 있다."
      },
      {
        "answer": "っぱなし",
        "word": "ドアを開けっぱなしにしないでください。",
        "mean": "문을 계속 열어두지 말아주세요."
      },
      {
        "answer": "っぱなし",
        "word": "もう, だれよ！水を出しっぱなしにしたのは。",
        "mean": "진짜, 누구야! 물을 계속 틀어둔 사람이!"
      },
      {
        "answer": "っぱなし",
        "word": "ずっと親に迷惑かけっぱなしなので, いつか親孝行したい。",
        "mean": "계속 부모님에게 폐만 끼치고 있기 때문에, 언젠가 효도하고 싶다."
      },
      {
        "answer": "っぱなし",
        "word": "そういえば, 図書館の本を借りっぱなしだった。",
        "mean": "그러고 보니, 도서관 책을 빌려 둔 채였어"
      },
      {
        "answer": "っぱなし",
        "word": "ポケットにお金を入れっぱなしで洗濯してしまった。",
        "mean": "주머니에 돈을 넣어둔 채로 세탁하고 말았다."
      }
    ]
  },
  {
    "id": 148,
    "grammar": "~であれ ~であれ",
    "means": "~라도 ~라도 관계없이 / 상관없이\n~이든 ~이든 상관없이 ",
    "description": "예를 들고 '어느 것도 어느 경우도 상관없이'라고 말하고 싶을 때 사용. ",
    "connectionWays": "명사 1/의문사 + であれ + 명사 2/의문사 + であれ",
    "examples": [
      {
        "answer": "であれ",
        "word": "着るものであれ食べるものであれ無駄にしてはならない。",
        "mean": "입는 것이든 먹는 것이든 낭비해서는 안 된다."
      },
      {
        "answer": "であれ",
        "word": "子供であれ, 大人であれ, 約束を破ってはいけない。",
        "mean": "어린이든 어른이든, 약속을 깨서는 안 된다."
      },
      {
        "answer": "であれ",
        "word": "車であれ電車であれこの天候では無理だろう。",
        "mean": "자동차도 전철도 이 날씨에는 무리일 거야."
      },
      {
        "answer": "であれ",
        "word": "学生であれ, 社会人であれ, マナーを知らないのはよくない。",
        "mean": "학생이든 사회인이든, 매너를 모르는 것은 좋지 않다."
      },
      {
        "answer": "であれ",
        "word": "相手がスペインであれ, ブラジルであれ, 僕らは全力を出して試合にのぞむまでだ。",
        "mean": "상대방이 스페인이든, 브라질이든, 우리들은 전력을 다해 시합에 임할 뿐이다."
      },
      {
        "answer": "であれ",
        "word": "１円であれ, １０円であれ, お金を盗むのはよくないことだ。",
        "mean": "1엔이든, 10엔이든, 돈을 훔치는 것은 좋지 않은 일이다."
      },
      {
        "answer": "であれ",
        "word": "この会社ではアルバイトであれ, 社員であれ, 仕事に対する責任は変わらない。",
        "mean": "이 회사에서는 아르바이트도, 사원도, 일에 대한 책임은 변하지 않는다."
      },
      {
        "answer": "であれ",
        "word": "彼がお金持ちであれ貧乏であれ, 私の気持ちが変わることはない。",
        "mean": "그가 부자이든 가난하든, 내 마음이 변할 일은 없다."
      },
      {
        "answer": "であれ",
        "word": "ギターであれベースであれ, キムさんは弦楽器であれば何でも上手に弾いてしまう。",
        "mean": "기타든 베이스든 김 씨는 현악기라면 뭐든 잘 켜버린다."
      },
      {
        "answer": "であれ",
        "word": "オクラであれ納豆であれ, ネバネバしたものはとにかく嫌いだ。",
        "mean": "오크라도 낫토도, 끈적끈적한 것은 어쨌건 싫다."
      }
    ]
  },
  {
    "id": 149,
    "grammar": "~であれ / ~であろうと / ~だろうが / ~であろうが / ~であろうとなかろうと",
    "means": "~이든 ~이든\n~라도 ~라도",
    "description":
        "2개의 대표적인 것을 열거하고, 어떠한 조건이나 상황이라도 변하지 않는다, 관계없다, 상관없다, 영향을 주지 않는다는 것을 나타낸다. ",
    "connectionWays":
        "명사 + であろう (+ 명사 + であろう)\n명사 + であろうと (+ 명사 + であろうと)\n명사 + だろうが (+ 명사 + だろうが)\n명사 + であろうが (+ 명사 + であろうが)\n명사 + であろうとなかろうと",
    "examples": [
      {
        "answer": "であれ",
        "word": "大人であれ子供であれ, 人に迷惑をかけてはいけない。",
        "mean": "어른이든 아이든 다른 사람에게 폐를 끼쳐서는 안 된다."
      },
      {
        "answer": "であろうが",
        "word": "人は男性であろうが女性であろうが, 男性ホルモン, 女性ホルモンの両方を持っている。",
        "mean": "사람은 남자든 여자든, 남성 호르몬, 여성 호르몬 둘 다 가지고 있다."
      },
      {
        "answer": "だろうが",
        "word": "先生だろうが学生だろうが, 遅刻してくるのは良くない。",
        "mean": "선생이든 학생이든, 지각하는 것은 좋지 않다."
      },
      {
        "answer": "であれ",
        "word": "どんな理由であれ, 君に責任があることに変わりはない。",
        "mean": "어떤 이유든, 너에게 책임이 있는 것에는 변함없다."
      },
      {
        "answer": "であろうと",
        "word": "それが故意であろうとなかろうと, 実害が出ている以上許されない。",
        "mean": "그것이 고의든 아니든, 실질적인 손해가 난 이상 용서받을 수 없다."
      },
      {
        "answer": "であれ",
        "word": "彼女はヘビであれカエルであれ触ることができる。",
        "mean": "그녀는 뱀이든 개구리든 만질 수 있다."
      },
      {
        "answer": "だろうが",
        "word": "晴れだろうが, 雨だろうが, 運動会は決行します。",
        "mean": "맑은 날이든, 비가 오는 날이든, 운동회는 결행합니다."
      },
      {
        "answer": "あろうと",
        "word": "宇宙の終わりがあろうとなかろうと, 我々人類はそれを見ることはできないだろう。",
        "mean": "우주의 끝이 있든 없든, 우리 인류는 그것을 볼 수 없겠지."
      },
      {
        "answer": "あろうと",
        "word": "正社員であろうと, アルバイトであろうと, 仕事に対する責任は変わらない。",
        "mean": "정사원이든, 아르바이트든, 일에 대한 책임은 변하지 않는다"
      },
      {
        "answer": "だろうが",
        "word": "犬だろうが猫だろうが, 動物はだいたい苦手だ。",
        "mean": "개든 고양이든, 동물은 대체로 질색이다."
      }
    ]
  },
  {
    "id": 150,
    "grammar": "~て済むことではない / て済む問題ではない",
    "means":
        "~로는 안 된다\n~로 넘어갈 문제가 아니다\n~로는 충분하지 않다\n~만으로는 해결할 수 없다\n~로 끝날 일이 아니다.",
    "description":
        "그 정도로 불충분하고, 문제를 해결하기에 이르지 못한다는 의미.\n\n주로 비판, 비난에 사용.\n\n[ ~では済まない/では済まされない ]보다 더욱 불충분함을 강조하는 표현. ",
    "connectionWays": "동사て형 + すむこと(問題)ではない\n명사 + ですむこと(問題)ではない",
    "examples": [
      {
        "answer": "済むことではない",
        "word": "仕方ないで済むことではない。",
        "mean": "어쩔 수 없다는 걸로 넘어갈 문제가 아니다."
      },
      {
        "answer": "済むことではない",
        "word": "何でも謝って済むことではないけれど, 謝れない人間は最低だ。",
        "mean": "뭐든 사과만 하면 되는 것은 아니지만, 사과 조차 하지 못하는 인간은 최악이다."
      },
      {
        "answer": "済む問題ではない",
        "word": "閣僚の失言ともなると, 言い間違えで済む問題ではない。",
        "mean": "각료가 하는 실언이라면, 말실수로 넘어갈 문제가 아니다."
      },
      {
        "answer": "済む問題ではない",
        "word": "私は知らなかった, 分からなかったで済む問題ではない。",
        "mean": "내가 잘 몰랐다, 이해하지 못했다는 말로 끝날 문제가 아니다."
      },
      {
        "answer": "済む問題ではない",
        "word": "それは謝罪と賠償だけで済む問題ではないと思う。",
        "mean": "그것은 사죄와 배상만으로 해결될 문제가 아니라고 생각한다."
      },
      {
        "answer": "ですむことではない",
        "word": "今回のことは, お金ですむことではない。",
        "mean": "이번 일은 돈으로 해결될 문제가 아니다."
      },
      {
        "answer": "すむことではないよ",
        "word": "弁償してすむことではないよ。",
        "mean": "변상하는 걸로 끝날 문제는 아니야."
      },
      {
        "answer": "済む問題ではなく",
        "word":
            "国会議員ともなれば, [ これは個人の感想です ]と弁解するだけで済む問題ではなく, 一つひとつの発言に責任を持たなければいけない。",
        "mean":
            "국회의원이라면, '이것은 개인의 감상입니다'라고 변명하는 걸로 넘어갈 문제가 아니라, 한 마디 한 마디 발언에 책임을 가져야 한다."
      },
      {
        "answer": "済むことではない",
        "word": "一人が責任を取って辞めて済むことではない。",
        "mean": "한 명이 책임을 떠안고 그만두는 걸로 끝날 일이 아니다."
      },
      {
        "answer": "済む問題ではない",
        "word": "成果は出せませんでしたが頑張りましたで済む問題ではない。",
        "mean": "성과를 내지 못했지만 열심히 했습니다라는 말로 넘어갈 문제가 아니다."
      }
    ]
  },
  {
    "id": 151,
    "grammar": "でなくてなんだろうか",
    "means": "(이것이야말로) 그 자체이다\n~이 아니고 무엇이란 말인가",
    "description":
        "강조의 표현, 어떠한 것 이외가 아니고 바로 그것이라는 뜻\n\n[ ~が~でなくてなんだろう (か) ] 라는 식으로 자주 사용\n\n[ 一体 ] 가 자주 호흥된다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "なくてなんだろうか",
        "word": "激しく続くこの腹痛がいったい病気でなくてなんだろうか。",
        "mean": "심하게 계속되는 이 복통이 도대체 병이 아니라 무엇이란 말이냐."
      },
      {
        "answer": "なくてなんだろうか",
        "word": "命を賭して戦った彼が英雄でなくてなんだろうか。",
        "mean": "목숨을 걸고 싸운 그가 영웅이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろうか",
        "word": "これが悪夢でなくてなんだろうか。",
        "mean": "이게 악몽이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろうか",
        "word": "一目見たときから心が高鳴る。これが運命の赤い糸でなくてなんだろうか。",
        "mean": "한눈에 봤을 때부터 가슴이 두근거린다.이게 운명의 붉은 실이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだというのか",
        "word": "決断することから逃げて, これが責任放棄でなくてなんだというのか。",
        "mean": "결단하는 것에서 도망쳐 이게 책임 포기가 아니라 뭐란 말인가."
      },
      {
        "answer": "なくてなんだろう",
        "word": "肌の色でいじめられる。これが差別でなくてなんだろう。",
        "mean": "피부색으로 왕따를 당하다.이게 차별이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろう",
        "word": "彼女を見るとドキドキする。これが恋でなくてなんだろう。",
        "mean": "그녀를 보면 두근거려.이게 사랑이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろう",
        "word": "身に覚えのない怪しい請求が来ている。これが詐欺でなくてなんだろう。",
        "mean": "기억나지 않는 수상한 청구가 오고 있다.이게 사기가 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろうか",
        "word": "人気絶頂だったアイドルの自殺。これが悲劇でなくてなんだろうか。",
        "mean": "인기 절정이었던 아이돌 자살.이게 비극이 아니라 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろう",
        "word": "人を救っている医師が英雄でなくてなんだろう。",
        "mean": "사람을 구하고 있는 의사가 영웅이 아니고서야 무엇이란 말인가."
      },
      {
        "answer": "なくてなんだろう",
        "word": "家に帰れば妻も子も待ってくれている。これが幸せでなくてなんだろう。",
        "mean": "집에 돌아가면 아내도 아이도 기다려 주고 있다.이게 행복 그 자체이다"
      },
      {
        "answer": "なくてなんだろう",
        "word": "５階から転落した幼児が無傷だったとは, これが奇跡でなくてなんだろう。",
        "mean": "5층에서 떨어진 유아가 다치지 않았다니 이게 바로 기적이 그 자체이다"
      }
    ]
  },
  {
    "id": 152,
    "grammar": "~ではあるまいし / でもあるまいし / じゃあるまいし",
    "means": "~는 아니고, ~도 아니고",
    "description":
        "원인이나 이유를 나타낸다.\n\n뒤 내용은 상대방에게 충고, 명령, 비판을 비롯한 화자의 판단을 말한다. 비난하는 뉘앙스가 담겨있는 경우도 있어 손윗사람에게는 사용하지 않는 편이 좋다. 또한 공식적인 자리에서도 사용하기 어렵다.\n\n 'あるまい'는 'ないだろう'의 의미. ",
    "connectionWays":
        "동사 사전형 + もの(ん)\n동사 사전형 + わけ\n동사 た형 + もの(ん)\n동사 た형 + わけ\n명사",
    "examples": [
      {
        "answer": "じゃあるまいし",
        "word": "子供じゃあるまいし, 身の回りのことは自分でやりなさい。",
        "mean": "애도 아니고 자기 주변 일은 알아서 해."
      },
      {
        "answer": "でもあるまいし",
        "word": "天才でもあるまいし, 僕にはわからないな。",
        "mean": "천재도 아니고 나는 잘 모르겠어."
      },
      {
        "answer": "でもあるまいし",
        "word": "新人でもあるまいし, それくらい自分で調べたら？",
        "mean": "신입도 아니고 그 정도는 스스로 알아보지?"
      },
      {
        "answer": "じゃあるまいし",
        "word": "人生はリセットできない。ゲームじゃあるまいし。",
        "mean": "인생은 리셋할 수 없어. 게임도 아니고."
      },
      {
        "answer": "わけではあるまいし",
        "word": "たった6ヶ月だろう。一生会えないわけではあるまいし, そんな悲しそうな顔するなよ。",
        "mean": "고작 6개월이잖아. 평생 못 만나는 것도 아니고 그렇게 슬픈 얼굴 하지 마."
      },
      {
        "answer": "んじゃあるまいし",
        "word": "海外に引っ越しするんじゃあるまいし, またすぐ会えるだろう。",
        "mean": "외국으로 이사 가는 것도 아니고 금방 만날 수 있을 거야."
      },
      {
        "answer": "わけではあるまいし",
        "word": "猛暑がずっと続くわけではあるまいし, 秋になるまで我慢だ。",
        "mean": "무더위가 계속 이어지는 것도 아니고 가을이 될 때까지 참아야지."
      },
      {
        "answer": "んじゃあるまいし",
        "word": "鬼が出たんじゃあるまいし, なんで顔が青くなったの？",
        "mean": "귀신이 나온 것도 아니고 왜 얼굴이 새파래졌어?"
      }
    ]
  },
  {
    "id": 153,
    "grammar": "~ては敵わない/~てはやり切れない",
    "means": "~는 건(해서) 견딜 수 없다\n~는 건(해서) 참을 수 없다",
    "description":
        "참을 수 없다, 견딜 수 없다'라는 주관적 감정을 강조.\n\n'やり切れない'는 단독으로 사용하기도 한다.\n\n'こんなに'와 함께 호응할 경우, '~ては敵わない/てはやり切れない'처럼 'は'를 같이 사용함.\n\n원래의 형태는 '~(に)敵う/敵わない'로 '대항할 힘이 있다/없다'라는 의미가 있다.\nてはかまわない라고 발음한다",
    "connectionWays":
        "동사て형 + (は) \nい형용사 어간 + くて (は) \nな형용사 어간 + で (は) \n명사 + で (は) ",
    "examples": [
      {"answer": "敵わない", "word": "お腹が痛くて敵わない。", "mean": "배가 아파서 견딜 수 없다."},
      {
        "answer": "敵わない",
        "word": "彼といると気まずいし, 会話が続かなくて敵わない。",
        "mean": "그와 함께 있으면 어색하고 대화가 이어지지 않아 견딜 수 없다."
      },
      {
        "answer": "敵わない",
        "word": "ダイエットしたいが, 毎晩断食では敵わない。",
        "mean": "다이어트하고 싶지만 매일 밤 단식은 참을 수 없다."
      },
      {"answer": "かなわない", "word": "尋常の手段ではかなわない。", "mean": "보통 수단으로는 당할 수 없다."},
      {"answer": "やり切れない", "word": "うるさくてやり切れない。", "mean": "시끄러워 못 살겠다."},
      {
        "answer": "やりきれない",
        "word": "毎日残業続きではやりきれない。",
        "mean": "매일 밤 야근하는 것은 견딜 수 없다."
      },
      {
        "answer": "やり切れない",
        "word": "こんなわずかな給料ではやり切れない。",
        "mean": "이런 적은 월급으로는 견딜 재간이 없다."
      },
      {
        "answer": "かなわない",
        "word": "いくらうまいと言っても, 本職にはかなわない。",
        "mean": "아무리 잘한다고 해도 전문 직업인에게는 당하지 못한다."
      },
      {"answer": "敵わない", "word": "数学では彼に敵わない。", "mean": "수학으로는 그를 당해낼 재간이 없다."},
      {"answer": "敵わない", "word": "礼儀に敵わない。", "mean": "예의에 어긋난다."}
    ]
  },
  {
    "id": 154,
    "grammar": "てやまない",
    "means": "매우~하다",
    "description":
        "祈る, 願う, 信じる 등 '감정적인 동사' 에 접속한다.\n\n그 감정이 오랜 시간 지속되고 있음을 나타낸다.\n\n문어적 표현",
    "connectionWays": "동사 て형",
    "examples": [
      {"answer": "てやまない", "word": "男たちを惹きつけてやまない美貌", "mean": "남자들을 매우 끌어당겨 미모"},
      {"answer": "てやまない", "word": "みんなが欲しくてやまないもの", "mean": "모두가 매우 갖고 싶어 것"},
      {
        "answer": "てやまない",
        "word": "こんな星空を見ると, ここに生まれてよかったと思えてやまない。",
        "mean": "이런 별이 빛나는 하늘을 보니 여기에 태어나길 정말 다행이라고 생각한다"
      },
      {
        "answer": "てやまない",
        "word": "一時の感情で人生を棒に振り, 今でもあの時の行動を後悔してやまない。",
        "mean": "한때의 감정으로 인생을 망쳤고, 지금도 그때의 행동을 후회해 마지않는다."
      },
      {
        "answer": "てやまない",
        "word": "我が子の幸せを願ってやまない。",
        "mean": "내 아이의 행복을 바라 마지않다."
      },
      {
        "answer": "てやまない",
        "word": "坂本龍馬を尊敬してやまない。",
        "mean": "사카모토 료마를 존경해 마지않다."
      },
      {
        "answer": "てやまない",
        "word": "スター選手には相手側も警戒を強めるが, 観客はそれをものともしないような活躍を期待してやまないものだ。",
        "mean": "스타 선수에게는 상대편도 경계를 강화하지만 관객은 아랑곳하지 않는 활약을 기대해 마지 않는다."
      }
    ]
  },
  {
    "id": 155,
    "grammar": "~を控えて / ~を~に控えて / ~が~に控えて",
    "means": "~을 앞두고, ~을 목전에 두고",
    "description":
        "[ ＮをＮに控えて / ＮがＮに控えて ] 에서 앞 내용에는 사물, 뒷 내용에는 시간을 나타내는 명사가 접속할 때에는 그 일이 발생하기 전이라는 것을 나타낸다.'\n\n[Ｎを控えて] 과 같이 뒷 내용은 생략될 수도 있다.\n\n시간적인 긴박감과 사물에 대한 긴장감을 표현할 수 있다.\n\n일이 발생하기까지의 시간의 장단에 관계없이 화자 자신이 절박감을 느낀다면 내일이든 다음 주든 한 달 후든 1년 후든 사용할 수 있다.\n\n[ＮをＮに控えて / ＮがＮに控えて] 에서 앞 내용에는 사람이나 물건, 뒷 내용에는 장소를 나타내는 명사가 접속할 때는 그것이 위치적으로 가까이 있는 것이나 바로 뒤에 있는 것을 나타낸다.\n\n비슷한 문법 [~を前にして / ~を目前にして] 이 시간적인 압박감이 있다.",
    "connectionWays": "명사 + をひかえて\n명사 + を + 명사 + にひかえて\n명사 + が + 명사 + にひかえて",
    "examples": [
      {
        "answer": "を控え",
        "word": "来週末に本番を控え, 今日は夜通し練習だ。",
        "mean": "다음 주말 실전을 앞두고 오늘은 밤새 훈련이다."
      },
      {
        "answer": "を控え",
        "word": "新店舗の開店を控え, 店内は準備で慌ただしい。",
        "mean": "새 점포 개점을 앞두고 가게 안은 준비로 분주하다."
      },
      {
        "answer": "を控え",
        "word": "卒業を控えた四年生たちは論文執筆に忙しい。",
        "mean": "졸업을 앞둔 4학년 학생들은 논문 집필에 바쁘다."
      },
      {
        "answer": "に控え",
        "word": "夏休みを一か月後に控え, 待ちきれない気持ちが抑えられない。",
        "mean": "여름방학을 한 달 앞두고 더 이상 기다릴 수 없다."
      },
      {
        "answer": "を控え",
        "word": "Ｊリーグ開幕を控え, 今季の順位予想をしてみる。",
        "mean": "J리그 개막을 앞두고 올 시즌 순위 예상을 해본다."
      },
      {
        "answer": "に控え",
        "word": "卒業を１年後に控えているが, まだ将来の夢も分からないままだ。",
        "mean": "졸업을 1년 앞두고 있지만 아직 장래희망도 모르고 있다."
      },
      {
        "answer": "に控え",
        "word": "今相手にした選手よりも強い選手が次に控えている。",
        "mean": "지금 상대한 선수보다 강한 선수가 다음을 앞두고 있다."
      },
      {
        "answer": "を控え",
        "word": "この温泉旅館は後ろに山を控えた自然豊かな場所にある。",
        "mean": "이 온천여관은 뒤로 산을 앞둔 자연이 풍요로운 곳에 있다."
      }
    ]
  },
  {
    "id": 156,
    "grammar": "~を前にして / ~を目前にして",
    "means": "(시간)~을 앞두고\n(장소)~을 앞에 두고 ",
    "description":
        "시간 : 시시각각의 절박함을 나타낸다\n\n장소 : 눈앞의 현상 \n\n비슷한 문법 [~を控えて] 는 시간적 명사와 접속할 때 \"여유\" 가 있다.\n\nをまえにして, をめまえにして로 발음한다",
    "connectionWays": "명사 + を前にして\n명사 + を目前にして",
    "examples": [
      {
        "answer": "を前にして",
        "word": "明日の入試を前にして, 今最も心配するのは会場までの交通状況だ。",
        "mean": "내일 입시를 앞두고 지금 가장 걱정되는 것은 행사장까지의 교통상황이다."
      },
      {
        "answer": "を前に",
        "word": "自分の番の発表を前に, 全身の震えが止まらない。",
        "mean": "자신의 차례 발표를 앞두고 온몸의 떨림이 멈추지 않는다."
      },
      {
        "answer": "を前にして",
        "word": "明日の手術を前にして, 命というものについて考えさせられている。",
        "mean": "내일 수술을 앞두고 생명이라는 것에 대해 생각하게 하고 있다."
      },
      {
        "answer": "を目前にして",
        "word": "勝利を目前にして油断したのか, うっかり失点して負けてしまった。",
        "mean": "승리를 눈앞에 두고 방심했는지 무심코 실점해 지고 말았다."
      },
      {
        "answer": "を前にして",
        "word": "初めて見る遺体を前にして足の震えが止まらない。",
        "mean": "처음 보는 시신을 앞에 두고 다리 떨림이 멈추지 않는다."
      },
      {
        "answer": "を前にして",
        "word": "異性を前にしてあんなにドキドキしたのはあの時が初めてだった。",
        "mean": "이성을 앞에 두고 저렇게 두근거리기는 그때가 처음이었어."
      },
      {
        "answer": "を前にして",
        "word": "彼はこの動かぬ証拠を前にしてもまだ否認し続けている。",
        "mean": "그는 이 움직일 수 없는 증거를 앞에 두고도 여전히 부인하고 있다."
      },
      {
        "answer": "を前にして",
        "word": "愛する人の亡骸を前にして泣き崩れた。",
        "mean": "사랑하는 사람의 시체를 앞에 두고 울음을 터뜨렸다."
      }
    ]
  },
  {
    "id": 157,
    "grammar": "~を蔑(ないがし)ろにする",
    "means": "~을 업신여기다",
    "description": "사람이나 물건을 경시 혹은 없는 것과 동일한것으로 취급하는 표현.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "を蔑ろにすれば",
        "word": "これを蔑ろにすれば後々必ず大事になる。",
        "mean": "이를 업신여기면 나중에 반드시 소중해진다."
      },
      {
        "answer": "は蔑ろに",
        "word": "近年の子供の運動能力低下は蔑ろにできない問題だ。",
        "mean": "최근 아이들의 운동능력 저하는 무시할 수 없는 문제다."
      },
      {
        "answer": "を蔑ろに",
        "word": "行政は世論を黙殺し, 国民を蔑ろにしている。",
        "mean": "행정은 여론을 묵살하고 국민을 업신여기고 있다."
      },
      {
        "answer": "を蔑ろに",
        "word": "相手を想うあまりに自らを蔑ろにしてしまってる。",
        "mean": "상대방을 생각한 나머지 스스로를 업신여기고 있어."
      },
      {
        "answer": "を蔑ろに",
        "word": "ペットは, 動物たちを蔑ろにしている店で買ってはいけない。",
        "mean": "애완동물은 동물들을 업신여기는 가게에서 사면 안 된다."
      },
      {
        "answer": "蔑ろに",
        "word": "彼女の勇気ある行動が蔑ろにされていることが許せない。",
        "mean": "그녀의 용기 있는 행동이 무시당하는 것을 용서할 수 없다."
      },
      {
        "answer": "を蔑ろに",
        "word": "多数決とは, 少数派の意見を蔑ろにすることである。",
        "mean": "다수결은 소수의 의견을 무시하는 것이다."
      },
      {
        "answer": "が蔑ろに",
        "word": "利益優先によって, 安心や安全が蔑ろになっている。",
        "mean": "이익 우선에 따라 안심과 안전이 멸시되고 있다."
      }
    ]
  },
  {
    "id": 158,
    "grammar": "~を境に / を境にして",
    "means": "~을 경계로",
    "description": "어느 시점의 전후에서 그 성질은 완전히 달라짐을 나타낸다.\n\n주로 시간을 나타내는 명사에 접속.",
    "examples": [
      {
        "answer": "を境に",
        "word": "夏至を境に, 日が短くなっていく。",
        "mean": "하지를 경계로 해가 짧아져 간다."
      },
      {
        "answer": "を境に",
        "word": "彼はある日を境に突然冷たくなった。",
        "mean": "그는 어느 날을 기점으로 갑자기 차가워졌다."
      },
      {
        "answer": "を境に",
        "word": "ある研究によると, 年収６３０万円を境に幸福感は増えにくくなるらしい。",
        "mean": "한 연구에 의하면, 연수입 630만엔을 경계로 행복감은 늘어나기 어려워진다고 한다."
      },
      {
        "answer": "を境に",
        "word": "１月１日を境に一切タバコ吸ってない。",
        "mean": "1월 1일을 기점으로 일절 담배를 피우지 않았다."
      },
      {
        "answer": "を境にして",
        "word": "ある事件を境にして, 彼は犯人への復讐心にかられることになった。",
        "mean": "어떤 사건을 경계로 그는 범인에 대한 복수심에 사로잡히게 되었다."
      },
      {
        "answer": "を境に",
        "word": "人は, 何を境に生とされ, 何を境に死と見なされるのだろうか。",
        "mean": "사람은 무엇을 경계로 삶으로 간주되고 무엇을 경계로 죽음으로 간주되는가?"
      },
      {
        "answer": "を境に",
        "word": "ある日を境に筋トレを始めてから, ちょっとしたことでも疲れにくくなった。",
        "mean": "어느 날을 기점으로 근육 트레이닝을 시작하면서 사소한 일에도 쉽게 피로해지지 않게 되었다."
      },
      {
        "answer": "を境に",
        "word": "メニューを変えたあの日を境に, 客層ががらりと変わった。",
        "mean": "메뉴를 바꾼 그날을 기점으로 손님층이 확 바뀌었다."
      }
    ]
  },
  {
    "id": 159,
    "grammar": "~を機に / を契機に",
    "means": "~을 계기로",
    "description":
        "새로운 일이 시작되는 그 기점을 나타낸다. 전항에는 그 기점, 후항에는 그 후의 행위를 서술한다.\n[~をきっかけに] 로 바꿔 말할 수 있는데, 이 표현은 회화체이며 [~を機に / を契機に] 는 다소 딱딱한 표현.\n\n전항과 후항이 동종인 행위일 때 이 문형은 사용할 수 없다.\n✕大阪への旅行を機に, 京都にも旅行した。\n◯大阪への旅行を皮切りに, 京都にも旅行した。",
    "connectionWays": "명사 + を機に\n명사 + を契機に\n동사 보통형 + のを機に\n동사 보통형 + のを契機に",
    "examples": [
      {
        "answer": "を機に",
        "word": "失恋を機に髪をばっさり切った。",
        "mean": "실연을 계기로 머리를 싹둑 잘랐다."
      },
      {
        "answer": "を機に",
        "word": "出産・育児を機に離職する女性が増えているという。",
        "mean": "출산·육아를 계기로 이직하는 여성이 늘고 있다고 한다."
      },
      {
        "answer": "を機に",
        "word": "駅のゴミ箱に爆弾が仕掛けられていたらしい。これを機に警備を強化してほしいと思う。",
        "mean": "역 쓰레기통에 폭탄이 설치되어 있었다고 한다.이번 기회에 경비를 강화했으면 좋겠다."
      },
      {
        "answer": "を機に",
        "word": "パソコンが壊れたが, 修理すると逆に高いので, これを機に新しいのを買うつもりだ。",
        "mean": "컴퓨터가 고장났는데 수리하면 반대로 비싸서 이번 기회에 새 걸 살 거야."
      },
      {
        "answer": "を機に",
        "word": "新年度なので, これを機に何か新しいことに挑戦してみようと思う。",
        "mean": "새해라서 이번 기회에 뭔가 새로운 것에 도전해보려고 한다."
      },
      {
        "answer": "を機に",
        "word": "女性は結婚を機に家事と育児に追われるようになる。",
        "mean": "여성은 결혼을 계기로 가사와 육아에 쫓기게 된다."
      },
      {
        "answer": "を機に",
        "word": "出産を機に１０キロほど太った。",
        "mean": "출산을 계기로 10kg 정도 살이 쪘다."
      },
      {
        "answer": "を契機に",
        "word": "父は大病を患ったのを契機に, 健康に気を遣うようになった。",
        "mean": "아버지는 큰 병을 앓은 것을 계기로 건강에 신경을 쓰게 되었다."
      }
    ]
  },
  {
    "id": 160,
    "grammar": "~を皮切りにして, を皮切りとして\n~を振り出しに",
    "means": "~을 시작으로",
    "description":
        "전항과 동종의 행위가 차례차례 행해져 가는 모습을 나타낸다. 전항에는 그 기점, 후항에는 그 후의 행위를 서술함.\n\n[~を皮切(かわきり)りに ] 흔히 뉴스 등에서 사용된다. 한편 [~を振(ふ)り出しに] 잘 쓰이지 않지만 같은 뜻이다.\n\n전항과 후항이 동종의 행위일 때만 이 문형을 사용할 수 있다.\n\n✕転職を皮切りに, いろんなところに行ってみたい。\n〇転職をきっかけに, いろんなところに行ってみたい。\n\n이런 경우는 [~をきっかけに, ~を機に / 契機に ] 를 사용해야 한다.",
    "connectionWays": "명사\n동사 보통형 + の\n동사 과거형 + の",
    "examples": [
      {
        "answer": "を皮切りに",
        "word": "東京を皮切りに全国７か所でコンサートが開かれる。",
        "mean": "도쿄를 시작으로 전국 7곳에서 콘서트가 열린다."
      },
      {
        "answer": "を皮切りに",
        "word": "総理大臣は中国を皮切りにアジア諸国を訪問した。",
        "mean": "총리대신은 중국을 시작으로 아시아 여러 나라를 방문했다."
      },
      {
        "answer": "を皮切りに",
        "word": "１月の沖縄を皮切りに日本列島を北上する桜前線。",
        "mean": "1월 오키나와를 시작으로 일본 열도를 북상하는 벚꽃 전선."
      },
      {
        "answer": "を皮切りに",
        "word": "仮想通貨はビットコインを皮切りに, 数多くの種類が登場している。",
        "mean": "가상화폐는 비트코인을 시작으로 수많은 종류가 등장하고 있다."
      },
      {
        "answer": "を皮切りに",
        "word": "展覧会が本日東京での開催を皮切りに, 全国８ヶ所で巡回開催されます。",
        "mean": "전람회가 오늘 도쿄에서의 개최를 시작으로 전국 8곳에서 순회 개최됩니다."
      },
      {
        "answer": "を皮切りに",
        "word": "法律の盲点を突いた犯罪が頻発したことを皮切りに, それに関連する法律が次々と見直された。",
        "mean": "법의 허점을 찌른 범죄가 빈발한 것을 시작으로 이와 관련된 법률들이 속속 손질됐다."
      },
      {
        "answer": "を皮切りに",
        "word": "このお店は去年の２店舗目のオープンを皮切りに, 各地に次々出店している。",
        "mean": "이 가게는 지난해 두 번째 점포 오픈을 시작으로 각지에 속속 입점하고 있다."
      },
      {
        "answer": "を皮切りに",
        "word": "先日発生した通り魔の犯人は, 近くにいた女性を皮切りに, 道行く人を次々と切りつけていったそうだ。",
        "mean": "얼마 전 발생한 대로마의 범인은 근처에 있던 여성을 시작으로 행인을 차례로 칼집을 냈다고 한다."
      }
    ]
  },
  {
    "id": 161,
    "grammar": "~を疎かにする / ~をなおざりにする",
    "means": "~을 소홀히 해다",
    "description": "일을 대충 다루거나 불성실하게 처리하는 것을 표현.",
    "connectionWays": "명사 + を疎かにする (をおろそかにする) \n명사 + をなおざりにする",
    "examples": [
      {
        "answer": "疎かになっている",
        "word": "ゲームばかりで私生活が疎かになっている。",
        "mean": "게임만 해서 사생활이 소홀해지고 있다."
      },
      {
        "answer": "を疎かにして",
        "word": "装備を疎かにして登山はできない。",
        "mean": "장비를 소홀히 해서 등산은 할 수 없다."
      },
      {
        "answer": "を疎かにして",
        "word": "筋肉を増やしたければ食事を疎かにしてはいけない。",
        "mean": "근육을 늘리고 싶으면 식사를 소홀히 해서는 안 된다."
      },
      {
        "answer": "疎かにして",
        "word": "学業は疎かにしてはいけない。",
        "mean": "학업은 소홀히 해서는 안 된다."
      },
      {
        "answer": "をなおざりにして",
        "word": "練習をなおざりにしていてはどんなスポーツも強くなれない。",
        "mean": "연습을 소홀히 해서는 어떤 스포츠도 강해질 수 없다."
      },
      {
        "answer": "をなおざりにして",
        "word": "与えられた仕事をなおざりにしていては信頼は得られない。",
        "mean": "주어진 일을 소홀히 해서는 신뢰를 얻을 수 없다."
      },
      {
        "answer": "なおざりに",
        "word": "彼はどんな些細なこともなおざりにできない性格だ。",
        "mean": "그는 어떤 사소한 것도 소홀히 할 수 없는 성격이다."
      },
      {
        "answer": "なおざりにし",
        "word": "必死に勉強して入った大学をなおざりにし, 学費のためにバイトに明け暮れている。",
        "mean": "필사적으로 공부해 들어간 대학을 등한시하고 학비 때문에 아르바이트를 일삼고 있다."
      }
    ]
  },
  {
    "id": 162,
    "grammar": "~より(ほかに)ない / よりしかたがない",
    "means": "~할 수 밖에 없다",
    "description":
        "\"그것을 하는 것 외에 해결 방법은 없다는 것\" 을 표현 설사 그러고 싶지 않더라도 그렇게 하는 것 외에는 다른 방법이 없음을 나타낸다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "より仕方がない",
        "word": "自転車が壊れてしまった。歩いて行くより仕方がない。",
        "mean": "자전거가 고장났어.걸어가는 수밖에 없다."
      },
      {
        "answer": "より仕方がない",
        "word": "薬は嫌いだが, 飲まなければ死ぬというなら飲むより仕方がない。",
        "mean": "약은 싫지만 먹지 않으면 죽는다고 한다면 먹는 수밖에 없다."
      },
      {"answer": "より他にない", "word": "怖いけど渡るより他にない。", "mean": "무섭지만 건널 수밖에 없어."},
      {
        "answer": "よりほかにない",
        "word": "あとは被害が最小限であることをただ祈るよりほかにない。",
        "mean": "나머지는 피해가 최소한이기를 바랄 수밖에 없다."
      },
      {
        "answer": "より仕方がない",
        "word": "もう結果は変えられないし, 納得するより仕方がない。",
        "mean": "이제 결과는 바꿀 수 없고 납득할 수밖에 없다."
      },
      {
        "answer": "よりほかないだろう",
        "word": "死にたくても死ねないのなら, 生きるよりほかないだろう。",
        "mean": "죽고 싶어도 죽지 못한다면 사는 수밖에 없을 것이다."
      },
      {
        "answer": "よりほかない",
        "word": "出産の痛みは男には分からないので, あとは手を握ってあげるよりほかない。",
        "mean": "출산의 아픔은 남자가 모르기 때문에 나머지는 손을 잡아주는 수밖에 없다."
      },
      {
        "answer": "よりほかない",
        "word": "この社会で生きていくためには, 毎日同じサイクルを繰り返すよりほかない。",
        "mean": "이 사회에서 살아가기 위해서는 매일 같은 사이클을 반복하는 수밖에 없다."
      },
      {
        "answer": "よりほかない",
        "word": "明日は試験。今日は睡眠時間削るよりほかない。",
        "mean": "내일은 시험. 오늘은 수면시간을 깎는 수밖에 없다."
      },
      {
        "answer": "よりほかない",
        "word": "現場を見る限り, プロの犯行というよりほかない。",
        "mean": "현장을 보는 한 프로의 범행일 수밖에 없다."
      },
      {
        "answer": "他にいないし",
        "word": "頼れる人は他にいないし, 自分でやってみるよりしかたがない。",
        "mean": "의지할 수 있는 사람은 따로 없고, 스스로 해보는 수밖에 없다."
      }
    ]
  },
  {
    "id": 163,
    "grammar": "をもって (1)",
    "means": "~(기점 , 시점) 으로",
    "description":
        "시간을 나타내는 단어에 접속하여 일의 시작 또는 종료를 나타낸다.\n\n공지, 통지, 회의, 식 등의 정식적인 장소에서의 인사 등에 이용함.\n\n[ をもちまして ]는 [ をもって ] 보다 더 딱딱한 표현.",
    "connectionWays": "명사 + をもって\n명사 + をもちまして",
    "examples": [
      {
        "answer": "をもって",
        "word": "本日の営業は１９時をもって終了いたします。",
        "mean": "오늘 영업은 19시를 기점으로 종료됩니다."
      },
      {
        "answer": "をもちまして",
        "word": "これをもちまして, 会議を終わります。",
        "mean": "이것으로 회의를 마치겠습니다."
      },
      {
        "answer": "をもちまして",
        "word": "当店は７月１日をもちまして閉店致します。今まで長い間ありがとうございました。",
        "mean": "저희 가게는 7월 1일부로 폐점합니다.그동안 오랫동안 감사했습니다."
      },
      {
        "answer": "をもちまして",
        "word": "今シーズンをもちまして, 引退することに決めました。",
        "mean": "이번 시즌을 기점으로 은퇴하기로 결정했어요."
      },
      {
        "answer": "をもちまして",
        "word": "只今の時間をもちまして受付を終了させて頂きます。",
        "mean": "지금 시간을 기점으로 접수를 종료하겠습니다."
      },
      {
        "answer": "をもちまして",
        "word": "５月５日をもちまして, ２０歳になりました。",
        "mean": "5월 5일부로 20살이 되었습니다."
      },
      {
        "answer": "をもって",
        "word": "Ａ市長は任期満了をもって政界から引退することを表明した。",
        "mean": "A 시장은 임기 만료를 기점으로 정계에서 은퇴할 것을 표명했다."
      },
      {
        "answer": "をもちまして",
        "word": "今日をもちまして２０歳になりました。",
        "mean": "오늘로써 20살이 되었습니다."
      }
    ]
  },
  {
    "id": 164,
    "grammar": "やれ~やれ~",
    "means": "~나~등\n~라느니~라느니",
    "description":
        "어떤 공통항을 가진 요소들 중에서 몇 가지를 열거하는 일부 열거형 병렬이다. 다른 요소의 존재도 암시함.\n\n대부분 열거한 사물에 대한 혐오감이나 불쾌감, 적의 등 부정적인 뉘앙스가 포함된다.\n\n보통은 두 가지 요소를 열거하지만 세 가지 이상 꼽을 수도 있으며 두 번째 요소는 생략할 수도 있다.\n\n이 경우에는 [やれ~だのやれ何だの (と) ] 라는 관용적인 표현을 사용함.\n\n[~だの~だの (と) ] 와 비슷한 문법",
    "connectionWays":
        "やれ + 명사 + だ, やれ + 명사 + だと\nやれ + 명사 + だの, やれ + 명사 + だのと\nやれ + 회화체 + だ, やれ + 회화체 + だと\nやれ + 회화체 + だの, やれ + 회화체 + だのと",
    "examples": [
      {
        "answer": "やれ",
        "word": "やれ出張だの, やれ会議だのと, ゆっくりする暇もない。",
        "mean": "출장이니 회의니 느긋하게 쉴 틈도 없다."
      },
      {
        "answer": "やれ",
        "word": "激しい運動をする時は, やれ準備運動だ, やれ水分だと注意することが多い。",
        "mean": "격렬한 운동을 할 때는 아 준비운동이다 수분이라고 주의할 것이 많다."
      },
      {
        "answer": "やれ",
        "word": "当初はやれ絵が下手だ, やれ展開が不自然だと馬鹿にされていたが, 今では大人気漫画になっている。",
        "mean": "처음에는 그림을 잘 못 그리거나 전개가 부자연스럽다고 조롱받았지만 지금은 큰 인기 만화가 되고 있다."
      },
      {
        "answer": "やれ",
        "word": "やれ筋トレだ, やれ栄養だと最近のダイエットは色々うるさい。",
        "mean": "근육 트레이닝이라느니 영양이라며 요즘 다이어트는 여러 가지 시끄럽다."
      },
      {
        "answer": "やれ",
        "word": "家にハチが入って来て, やれ窓閉めないからだやれ殺虫剤だと文句言われた。",
        "mean": "집에 벌이 들어와서 창문 안 닫아서 그렇다 라느니 살충제라느니 불평을 들었다."
      },
      {
        "answer": "やれ",
        "word": "夫はやれお寿司だ, やれピザだと食べたいものばかり言うが, 毎日食べたいものばかり食べるような生活はできない。",
        "mean": "남편은 초밥이라며 피자라며 먹고 싶은 것만 말하지만 매일 먹고 싶은 것만 먹는 생활은 할 수 없다."
      },
      {
        "answer": "やれ",
        "word": "やれ台風だ, やれ地震だと心配事も多い。",
        "mean": "태풍나 지진등 걱정거리도 많다."
      },
      {
        "answer": "やれ",
        "word": "息子はやれ勇者になるだの, やれ吟遊詩人になるだのと, 夢みたいなことばっかり言ってる。",
        "mean": "아들은 용사가 된다느니 음유시인이 된다느니 하는 꿈같은 소리만 한다."
      }
    ]
  },
  {
    "id": 165,
    "grammar": "や否や / や",
    "means": "~하자 마자",
    "description":
        "전건의 동작 후 바로 후건의 동작이 발생하는 것을 나타낸다\n\n이미 발생한 일에 사용함\n\n후건이 예상밖의 일이라면 화자는 놀라움을 표현하는 것이 가능하다",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "や否や",
        "word": "お母さんの顔を見るや否や, 安心したのか泣き出してしまった。",
        "mean": "엄마의 얼굴을 보자마자 안심했는지 울음을 터뜨리고 말았다."
      },
      {"answer": "や否や", "word": "帰宅するや否や, 倒れ込んだ。", "mean": "귀가하자마자 쓰러졌다."},
      {
        "answer": "や否や",
        "word": "タバコを吸うや否や, 火災報知器が鳴り響いた。",
        "mean": "담배를 피우자마자 화재경보기가 울렸다."
      },
      {
        "answer": "や否や",
        "word": "タイに着くや否や病気にかかってしまった。",
        "mean": "태국에 도착하자마자 병에 걸리고 말았다."
      },
      {
        "answer": "や否や",
        "word": "椅子に座るや否やスマホを取り出した。",
        "mean": "의자에 앉자마자 핸드폰을 꺼냈다."
      },
      {"answer": "や", "word": "駅に到着するや, 電車が来た。", "mean": "역에 도착하자 전철이 왔다."},
      {
        "answer": "や否や",
        "word": "私が起きたと分かるや否や, おはようの挨拶をしてくれる猫ちゃん。",
        "mean": "내가 일어났다는 것을 알자마자 좋은 아침 인사를 해주는 고양이."
      },
      {
        "answer": "や否や",
        "word": "教室に入るや否や髪切ったの気づいてくれて褒めてくれた。",
        "mean": "교실에 들어가자마자 머리 자른거 알아줘서 칭찬해줬어."
      },
      {
        "answer": "や否や",
        "word": "男の人が[ 漏れそう！ ]と言うや否や, トイレに走って行った。",
        "mean": "남자가 \"새겠다!\"고 하자마자 화장실로 뛰어갔다."
      },
      {
        "answer": "や否や",
        "word": "お風呂に入るや否や, 気持ちよさそうな声をあげて目をつぶった。",
        "mean": "목욕을 하자마자 기분 좋은 소리를 지르며 눈을 감았다."
      },
      {
        "answer": "や否や",
        "word": "髪を染めるや否や, 可愛いと言われ始めた。",
        "mean": "염색하자마자 귀엽다는 말을 듣기 시작했다."
      },
      {
        "answer": "や",
        "word": "父の訃報を受け取るや, 彼はすぐ新幹線で実家へ向かった。",
        "mean": "아버지의 부고를 받자 그는 곧바로 신칸센을 타고 친정으로 향했다."
      },
      {
        "answer": "や否や",
        "word": "叶わない夢と知るや否や, 自暴自棄になってしまった。",
        "mean": "이룰 수 없는 꿈이라는 것을 알자마자 자포자기가 되고 말았다."
      }
    ]
  },
  {
    "id": 166,
    "grammar": "滅多に~ない",
    "means": "좀처럼~않다,~는 드물다",
    "description": "발생 빈도나 횟수가 상당히 적은 것을 강조하는 문법\n\nめったに 로 발음한다.",
    "connectionWays": "滅多に + 동사ない형 + ない\n~は滅多にない",
    "examples": [
      {
        "answer": "めったに",
        "word": "酒は普段めったに飲まない。",
        "mean": "술은 평소에 좀처럼 마시지 않는다."
      },
      {
        "answer": "は滅多にない",
        "word": "うちの家族は生活リズムがそれぞれ違うから, 朝ご飯揃って食べることは滅多にない。",
        "mean": "우리 가족은 생활 리듬이 각기 다르기 때문에 아침을 차려 먹는 경우는 드물다."
      },
      {
        "answer": "はめったにない",
        "word": "怒りにはいつも理由がある。ただし, 正当な理由はめったにない。",
        "mean": "분노에는 언제나 이유가 있다.다만 정당한 이유는 드물다."
      },
      {"answer": "めったにない", "word": "めったにない奇跡が起きた。", "mean": "흔치 않은 기적이 일어났다."},
      {
        "answer": "は滅多にない",
        "word": "褒められることは滅多にないので嬉しいです。ありがとうございます。",
        "mean": "칭찬받을 일이 좀처럼 없기 때문에 기쁩니다.감사합니다。"
      },
      {
        "answer": "めったにない",
        "word": "仕事し始めたら恋愛なんてめったにない。出会いがあるのは学生だけだ。",
        "mean": "일하기 시작하면 연애 같은 건 거의 없어.만남이 있는 것은 학생뿐이다."
      },
      {
        "answer": "は滅多に",
        "word": "知らない番号からの電話には滅多に出ないようにしている。",
        "mean": "모르는 번호로부터의 전화는 좀처럼 받지 않도록 하고 있다."
      },
      {
        "answer": "めったに",
        "word": "彼女のめったに見れない満面の笑みがめちゃくちゃ可愛い。",
        "mean": "그녀의 좀처럼 볼 수 없는 함박웃음이 너무 귀엽다."
      }
    ]
  },
  {
    "id": 167,
    "grammar": "まくる",
    "means": "마구~하다 / 계속~하다 / 여러번~하다",
    "description":
        "동작을 몇번이나 격하게 반복하는 상태를 표현한다.\n\n[勝って勝って勝ちまくる] 같이 [~て~て~まくる] 로 강조하기 도한다",
    "connectionWays": "동사 ます형 + まくる",
    "examples": [
      {
        "answer": "まくり",
        "word": "７月に入ってから勝ちまくり, 一気に首位に躍り出た。",
        "mean": "7월 들어 계속 이겨 단숨에 선두로 올라섰다."
      },
      {
        "answer": "まくって",
        "word": "仕事でミスしまくって自信がなくなった。",
        "mean": "일에서 실수를 너무 많이 해서 자신이 없어졌다."
      },
      {"answer": "まくる", "word": "朝から晩まで遊びまくる。", "mean": "아침부터 밤까지 마구 놀러 다니다."},
      {
        "answer": "まくった",
        "word": "悔しくて泣いて, 泣いて, 泣きまくった。",
        "mean": "억울해서 울고 울고 마구 울었다."
      },
      {
        "answer": "まくった",
        "word": "料理注文しまくったせいで会計が怖い。",
        "mean": "음식을 너무 많이 주문하는 바람에 계산이 무서워."
      },
      {
        "answer": "まくった",
        "word": "プールで子どもみたいにはしゃぎまくった。",
        "mean": "수영장에서 어린애처럼 매우 떠들었다."
      },
      {
        "answer": "まくって",
        "word": "日焼けで腕の皮が剥けまくっている。",
        "mean": "햇볕에 타서 팔 껍질이 마구 벗겨져 있다."
      },
      {
        "answer": "まくって",
        "word": "うちの猫が初めて聞く雷の音にビビりまくっている。",
        "mean": "우리 고양이가 처음 듣는 천둥소리에 마구 질겁을 하고 있다."
      },
      {
        "answer": "まくった",
        "word": "昼間寝まくったから眠くない。",
        "mean": "낮에 잠을 많이 자서 졸리지 않아."
      },
      {
        "answer": "まくった",
        "word": "この４日間で青森から東京までをバイクで走りまくった。",
        "mean": "지난 4일간 아오모리에서 도쿄까지 마구 오토바이를 몰고 다녔다."
      },
      {"answer": "まくった", "word": "美味しいものを食べまくった。", "mean": "맛있는 것을 마구 먹었다."},
      {
        "answer": "まくった",
        "word": "この５連休で生活リズムが乱れまくった。",
        "mean": "지난 5일 연휴로 생활 리듬이 매우 흐트러졌다."
      },
      {
        "answer": "まくった",
        "word": "大掃除で要らないものを捨てまくった。",
        "mean": "대청소로 불필요한 것을 마구 버렸다."
      },
      {
        "answer": "まくって",
        "word": "日焼けして肌が荒れまくってる。",
        "mean": "햇볕에 타서 피부가 매우 거칠어졌어."
      },
      {
        "answer": "まくって",
        "word": "蚊に刺されまくって夜中に起きた。",
        "mean": "모기한테 너무 많이 물려서 새벽에 일어났어."
      },
      {
        "answer": "まくった",
        "word": "子どもが壁中にシールを貼りまくったから叱った。",
        "mean": "아이가 벽 안에 스티커를 마구 붙여서 혼냈다."
      },
      {
        "answer": "まくって",
        "word": "夜更かししまくって授業中に睡眠取った。",
        "mean": "여러번 밤새워 수업 중에 잠을 잤다."
      },
      {
        "answer": "まくっていた",
        "word": "子どもの頃は親に迷惑かけまくっていた。",
        "mean": "어렸을 때는 부모에게 매우 폐를 끼쳤다."
      }
    ]
  },
  {
    "id": 168,
    "grammar": "放題",
    "means": "~을 마음대로",
    "description":
        "마음껏 하고 싶은 만큼 한다는 뜻을 나타낸다\n\n비슷한 명사에만 접속하는 三昧(ざんまい) 라는 문법이 있다",
    "connectionWays": "동사 ます형 + 放題\n동사 ます형 + たい放題",
    "examples": [
      {
        "answer": "放題",
        "word": "焼肉食べ放題大人一人３０００円",
        "mean": "불고기 무제한 어른 1인당 3000엔"
      },
      {
        "answer": "放題",
        "word": "赤ちゃんは泣くのが仕事だから, 泣きたい放題泣かせておけばいい。",
        "mean": "아기는 우는 게 일이니까 울고 싶은 대로 울리면 돼."
      },
      {
        "answer": "放題",
        "word": "いつも些細な事からつい言いたい放題言ってしまって喧嘩になる。",
        "mean": "항상 사소한 것부터 무심코 하고 싶은 대로 말해 버려서 싸움이 된다."
      },
      {
        "answer": "放題",
        "word": "現在キャンペーン中で, 海外ドラマが見放題だそうだ。",
        "mean": "현재 캠페인 중이라 해외 드라마를 마음껏 볼 수 있다고 한다."
      },
      {
        "answer": "放題",
        "word": "ネットでは匿名性にかこつけて, 無責任な発言をしたい放題している。",
        "mean": "인터넷에서는 익명성을 빙자해 무책임한 발언을 하고 싶은 대로 하고 있다."
      },
      {
        "answer": "放題",
        "word": "この店のビール飲み放題には, ２時間という時間制限がある。",
        "mean": "이 가게의 맥주 무제한은 2시간이라는 시간 제한이 있다."
      },
      {
        "answer": "放題",
        "word": "子供には自分の好きなようにやりたい放題させておけばいい。",
        "mean": "아이에게는 자기 마음대로 하고 싶은 대로 하게 놔두면 된다."
      }
    ]
  },
  {
    "id": 169,
    "grammar": "べくして",
    "means": "~(당연히) 할 만해서,~할 운명이여서,~할 것이 당연히 예상되어서",
    "description":
        "예상된 사태가 발생한 것의 필연성을 나타낸다. (일어날 일은 일어날 것이다)\n\n같은 동사 두개를 두번 사용.\n\n앞 문장에는 동사 사전형을 뒷 문장에는 동사 과거형이 오는 경우가 많다.",
    "connectionWays": "동사 사전형 + べくして+ 동사",
    "examples": [
      {
        "answer": "べくして",
        "word": "彼とは出会うべくして出会った気がする。",
        "mean": "그와는 만날 운명이여서 만난 것 같아."
      },
      {
        "answer": "べくして",
        "word": "チャンスを掴める人は, 掴むべくして掴んでいる。",
        "mean": "기회를 잡을 수 있는 사람은 잘을 운명이여서 잡고 있다."
      },
      {
        "answer": "べくして",
        "word": "これは無秩序な状態が招いた, 起こるべくして起こった惨事だ。",
        "mean": "이는 무질서한 상태가 초래한, 일어날 만해서 일어난 참사다."
      },
      {
        "answer": "べくして",
        "word": "勝者は勝つべくして勝ち, 敗者は負けるべくして負ける。",
        "mean": "승자는 이길만 해서 이기도 패자는 질만해서 진다"
      },
      {
        "answer": "べくして",
        "word": "全ての人は生まれるべくして生まれたのだ。",
        "mean": "모든 사람은 태어날 운명이여서 태어난 것이다"
      },
      {
        "answer": "べくして",
        "word": "二人は別れるべくして別れた。",
        "mean": "두 사람은 헤어질 만해서 헤어졌다."
      },
      {
        "answer": "べくして",
        "word": "あの人はたまたま選ばれた天才ではなく, 選ばれるべくして選ばれた天才だ。",
        "mean": "저 사람은 우연히 뽑힌 천재가 뽑힐 만해서 뽑힌 천재이다."
      }
    ]
  },
  {
    "id": 170,
    "grammar": "ぶる",
    "means": "~인 척하다",
    "description":
        "본래 그렇지 않은데도 그런 소질이나 성질을 가지고 있음을 남에게 보여주는 것처럼 행동하는 것을 나타낸다.\n\n그 행동에 대한 화자의 마이너스 평가를 나타낸다.\n\n접속할 수 있는 단어는 한정되어 있다.\n\n[可愛い子ぶる] 귀여운 아이 행세 , [もったいぶる] 거드름을 피우다 등 관용구가 있다.\n\n비슷한 문법~ふりをする, ~気取り (きどり) ",
    "connectionWays": "명사\nな형용사 어간\nい형용사 어간",
    "examples": [
      {
        "answer": "ぶっている",
        "word": "彼は被害者ぶっているが, 真の被害者は私のほうだ。",
        "mean": "그는 피해자인 척하지만 진정한 피해자는 내 쪽이다."
      },
      {
        "answer": "ぶっている",
        "word": "あの人はまだ有名になったわけでもないのに, マスクやサングラスなど変装して有名人ぶっている。",
        "mean": "저 사람은 아직 유명해진 것도 아닌데 마스크나 선글라스 등 변장해서 유명인 척 하고 있다."
      },
      {
        "answer": "ぶる",
        "word": "女の子が好きな男の子の前で可愛い子ぶるのは本能のようなものだ。",
        "mean": "여자가 좋아하는 남자 앞에서 귀여운 아이 행세를 하는 것은 본능과도 같다."
      },
      {
        "answer": "もったいぶる",
        "word": "もったいぶる必要ないから, 早く話してほしい。",
        "mean": "거드름 피울 필요 없으니까 빨리 얘기해줬으면 좋겠어."
      },
      {
        "answer": "ぶっている",
        "word": "世論を代弁して正義の味方ぶっているが, あれはただの自己満だ。",
        "mean": "여론을 대변하며 정의의 편인 척 하고지만 저건 그냥 자만이다."
      },
      {
        "answer": "ぶっている",
        "word": "冷静ぶっているが, 焦っていることくらい目を見れば分かる。",
        "mean": "냉정한 척 하고 있지만 초조한 것쯤 눈을 보면 알 수 있다."
      },
      {
        "answer": "ぶっている",
        "word": "良い人ぶっている人ほど自己中心的な人が多い。",
        "mean": "좋은 사람인 척하는 사람일수록 자기중심적인 사람이 많다."
      }
    ]
  },
  {
    "id": 171,
    "grammar": "~羽目になる / 羽目に陥る",
    "means": "~처지에 이르다",
    "description":
        "어떤 일이 원인이 되어 금세 어려움에 빠지게 되는 것을 나타내는 문법\n\n羽目 (はめ) : 궁지, 처지, 입장",
    "connectionWays": "동사 사전형 + 羽目になる",
    "examples": [
      {
        "answer": "羽目になった",
        "word": "原因不明のエラーが発生して再インストールする羽目になった。",
        "mean": "원인 불명의 에러가 발생해 재설치할 처지에 놓였다."
      },
      {
        "answer": "羽目になった",
        "word": "インフルエンザが悪化して入院する羽目になった。",
        "mean": "독감이 악화되어 입원할 처지가 되었다."
      },
      {
        "answer": "羽目になった",
        "word": "大通りが工事中で遠回りする羽目になった。",
        "mean": "큰길이 공사 중이어서 우회할 처지가 되었다."
      },
      {
        "answer": "羽目になった",
        "word": "急いで家を飛び出したせいで忘れ物して, 結局戻る羽目になった。",
        "mean": "서둘러 집을 뛰쳐나가는 바람에 잊어버리고 결국 돌아갈 처지가 됐다."
      },
      {
        "answer": "羽目になった",
        "word": "昼休みもなく会議に突入する羽目になった。",
        "mean": "점심시간도 없이 회의에 돌입할 처지가 되었다."
      },
      {
        "answer": "羽目になる",
        "word": "冷静な判断によって下された決断でなければ一生後悔する羽目になる。",
        "mean": "냉정한 판단에 따라 내려진 결단이 아니면 평생 후회할 처지가 된다."
      },
      {
        "answer": "羽目になる",
        "word": "嘘を嘘で塗り固めるから, また嘘をつく羽目になる。",
        "mean": "거짓말을 거짓으로 칠하니까 또 거짓말을 하는 꼴이 된다."
      },
      {
        "answer": "羽目になる",
        "word": "今昼寝をしたら夜また徹夜する羽目になる。",
        "mean": "지금 낮잠을 자면 밤에 또 새야 할 지경이야."
      }
    ]
  },
  {
    "id": 172,
    "grammar": "はさておき",
    "means": "~은 제쳐두고\n~은 차치하고",
    "description": "더 중요한 주제를 제시할 때 사용 \n\n비슷한 문법 [~はともかく (として) ]",
    "connectionWays": "명사 + はさておき",
    "examples": [
      {
        "answer": "はさておき",
        "word": "世間の評価はさておき, 私は良かったと思う。",
        "mean": "세간의 평가는 차치하고 나는 좋았다고 생각한다."
      },
      {
        "answer": "はさておき",
        "word": "この事件に関与していたかどうかはさておき, 彼は部下の監督不行き届きで処分されるだろう。",
        "mean": "이 사건에 관여했는지 아닌지는 차치하고, 그는 부하의 감독 소홀로 처분될 것이다."
      },
      {
        "answer": "はさておき",
        "word": "そんな冗談はさておき, 手伝ってくれませんか。",
        "mean": "그런 농담은 제쳐두고 도와주시겠어요?"
      },
      {
        "answer": "はさておき",
        "word": "外見はさておき, とても優しい人だった。",
        "mean": "겉모습은 차치하고 아주 상냥한 사람이었다."
      },
      {
        "answer": "はさておき",
        "word": "うまいかどうかはさておき, 人前で歌おうとする根性は凄いと思う。",
        "mean": "잘하는지 아닌지는 차치하고 사람들 앞에서 노래하려는 근성은 대단하다고 생각한다."
      },
      {
        "answer": "はさておき",
        "word": "結果はさておき, 今年も楽しい一年だった。",
        "mean": "결과는 차치하고 올해도 즐거운 한 해였다."
      },
      {
        "answer": "はさておき",
        "word": "実行するかはさておき, 綿密な計画を立てておくことは悪いことではない。",
        "mean": "실행할지는 차치하고 면밀한 계획을 세워두는 것은 나쁜 일이 아니다."
      },
      {
        "answer": "はさておき",
        "word": "ジムに通うかどうかはさておき, 運動習慣はつけたいと思っている。",
        "mean": "헬스장에 다닐지 어떨지는 차치하고, 운동 습관은 기르고 싶다고 생각하고 있다."
      }
    ]
  },
  {
    "id": 173,
    "grammar": "~抜きに~ない / 抜きで~ない / 抜きにしては~ない",
    "means": "~가 없으면~하지 못한다",
    "description": "어떤 것이 없으면 불가능하다을 나타낸다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "抜きで",
        "word": "Ａ社の歴史を語るなら, 創業者の伝説抜きでは語れない。",
        "mean": "A사의 역사를 이야기한다면 창업자의 전설 없이는 말할 수 없다."
      },
      {
        "answer": "抜きで",
        "word": "朝ご飯抜きでは頭が働かない。",
        "mean": "아침 식사를 거르면 머리가 작동하지 않는다."
      },
      {
        "answer": "抜きで",
        "word": "私にとってはタバコ抜きでは生きていけない。",
        "mean": "나에게는 담배 없이는 살 수 없다."
      },
      {
        "answer": "抜きには",
        "word": "国家の展望はエネルギー政策抜きには語れない。",
        "mean": "국가의 전망은 에너지 정책 없이는 말할 수 없다."
      },
      {
        "answer": "抜きで",
        "word": "その人を知るには, コミュニケーション抜きでは進まない。",
        "mean": "그 사람을 알기 위해서는 커뮤니케이션 없이는 진행되지 않는다."
      },
      {
        "answer": "抜きには",
        "word": "進歩は行動抜きにはありえない。",
        "mean": "진보는 행동 없이는 있을 수 없다."
      },
      {
        "answer": "抜きには",
        "word": "近年の異常気象は地球温暖化の影響を抜きには考えにくい。",
        "mean": "근년의 이상기후는 지구온난화의 영향을 빼고는 생각하기 어렵다."
      },
      {
        "answer": "抜きで",
        "word": "この件は彼の協力抜きでは進められない。",
        "mean": "이 건은 그의 협력 없이는 진행될 수 없다."
      }
    ]
  },
  {
    "id": 174,
    "grammar": "시간, 횟수 명사 + にして",
    "means": "~할 때에\n~단계에 이르러서야",
    "description":
        "어느 단계에 이르렀을 때를 나타내는 뒷 내용에는 사물의 실현, 성립, 발견, 이해 등이 기술된다\n\n주로 시간이나 나이, 횟수 등을 나타내는 명사에 연결된다.\n\n주로 뒤에는 [ようやく, やっと, 初めて] 와 호흥 한다.",
    "examples": [
      {
        "answer": "にして",
        "word": "この難関試験に, ３回目にしてようやく合格した。",
        "mean": "이 난관 시험에 3회 만에 (3회의 단계에 이르러서야) 겨우 합격했다."
      },
      {
        "answer": "にして",
        "word": "４０歳にしてようやく父親になった。",
        "mean": "마흔에 겨우 아버지가 되었다."
      },
      {
        "answer": "にして",
        "word": "この歳にして初めて人生とは何かが分かった。",
        "mean": "이 나이에 비로소 인생이 무엇인지 알 수 있었다."
      },
      {
        "answer": "にして",
        "word": "あれだけの量の仕事を１日にして終わらせたとは凄すぎる。",
        "mean": "저만한 양의 일을 하루아침에 끝냈다니 너무 대단하다."
      },
      {
        "answer": "にして",
        "word": "光を放ち, 一瞬にして消えてしまった。",
        "mean": "빛을 발하며 순식간에 사라져 버렸다."
      },
      {
        "answer": "にして",
        "word": "あの時の言葉の本当の意味が, 今にしてようやく分かった。",
        "mean": "그때 한 말의 참뜻을 이제야 알았다."
      },
      {"answer": "にして", "word": "還暦にして初めての孫が生まれた。", "mean": "환갑에 첫 손자가 태어났다."},
      {
        "answer": "にして",
        "word": "２０社目にして念願の内定をもらえた。",
        "mean": "20사째에 염원의 내정을 받았다."
      }
    ]
  },
  {
    "id": 175,
    "grammar": "명사 + にして + 명사",
    "means": "~이기도 하고~이기도 하다\n~동시에~이다.",
    "description":
        "어떤 두 가지 상태나 성질이 공존하고 있음을 나타낸다\n\n문어체이다\n\n[最後にして最初 , 最初にして最後, 最初で最後] (처음이자 마지막) 라는 관용어가 있다",
    "examples": [
      {
        "answer": "にして",
        "word": "単純にして難解なフェルマーの最終定理が, ３６０年の時を経てようやく証明された。",
        "mean": "단순하고 난해한 페르마의 최종 정리가 360년이 지나서야 증명됐다."
      },
      {
        "answer": "にして",
        "word": "子どもの頃にお化けを見たことがある。今思えば, それが最初にして最後だった。",
        "mean": "어렸을 때 귀신을 본 적이 있어.지금 생각하면 그게 처음이자 마지막이었다. (처음이기도 하고 마지막이기도 하다)"
      },
      {
        "answer": "にして",
        "word": "彼は経営者にして政治家でもある。",
        "mean": "그는 경영자이기도하고 정치인이기도 하다."
      },
      {"answer": "にして", "word": "大胆にして細心であれ", "mean": "대담하기 동시에 세심하다"},
      {
        "answer": "にして",
        "word": "彼女は実力派女優にして歌手でもある。",
        "mean": "그녀는 실력파 여배우이자 가수이기도 하다."
      },
      {
        "answer": "にして",
        "word": "彼のダイナミックにして繊細な感性に彩られた演奏は評価されている。",
        "mean": "그의 역동적이기도 하고 섬세한 감성에 물든 연주는 평가받고 있다."
      },
      {
        "answer": "にして",
        "word": "簡素にして効率的かつ透明な政府を実現する。",
        "mean": "간소화하여 효율적이고 투명한 정부를 실현한다."
      }
    ]
  },
  {
    "id": 176,
    "grammar": "~にしたって / にしたところで",
    "means": "~라고 한들,~이라도",
    "description": "역접 표현, 뒷부분은 좋지 않는 내용이 자주 온다.　にしたって 로도 사용된다",
    "connectionWays":
        "동사 보통형 + にしたって / にしたところで\nい형용사 보통형 + にしたって / にしたところで\nな형용사 어간 ( + である) + にしたって / にしたところで\n명사 ( + である) + にしたって / にしたところで",
    "examples": [
      {
        "answer": "にしたって",
        "word": "一つの言葉にしたって, 聞く側によって意味は変わる。",
        "mean": "한 마디라고 해도 듣는 쪽에 따라 의미는 달라진다."
      },
      {
        "answer": "にしたところで",
        "word": "健康のための運動にしたところで, 結局膝とか腰が痛くなって続かない。",
        "mean": "건강을 위한 운동이라고 한들 결국 무릎이나 허리가 아파 계속되지 않는다."
      },
      {
        "answer": "にしたって",
        "word": "どれだけおいしいにしたって, 食べ過ぎると飽きる。",
        "mean": "아무리 맛있다고 한들 너무 많이 먹으면 질려."
      },
      {
        "answer": "にしたって",
        "word": "どちらにしたって状況が悪いことには変わりない。",
        "mean": "어느 쪽이라도 상황이 나쁜 것에는 변함이 없다."
      },
      {
        "answer": "にしたって",
        "word": "Ａさんが嫌いにしたって, その態度はあまりにも酷過ぎるんじゃないか。",
        "mean": "A씨가 싫어한다고 해도 그 태도는 너무 가혹하잖아."
      },
      {
        "answer": "にしたって",
        "word": "手元には１円もない。通帳にしたって同じだ。",
        "mean": "수중에는 1엔도 없다.통장라고 한들 마찬가지다."
      },
      {
        "answer": "にしたって",
        "word": "社長にしたって, 会社の未来がはっきり見えているわけではない。",
        "mean": "사장이라고 해도 회사의 미래가 분명하지는 않다."
      },
      {
        "answer": "にしたって",
        "word": "彼がどんなに好きにしたって, それを仕事にするのは容易ではない。",
        "mean": "그를 아무리 좋아한다 해도 그것을 일로 삼는 것은 쉽지 않다."
      }
    ]
  },
  {
    "id": 180,
    "grammar": "~と相まって / が相まって / も相まって",
    "means": "~와 어울려",
    "description":
        "여러 사물의 성질이 서로 작용하는 것을 나타낸다.\n\n후건에서는 그 상호작용에 의해 초래되는 좋은 결과가 서술된다.\n\n일반적으로 나쁜 내용이 서술되는 경우는 적다\n\nとあいまって 로 발음한다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "が相まって",
        "word": "綺麗な服と長い黒髪とが相まってお似合いです。",
        "mean": "예쁜 옷과 긴 검은 머리가 어울려 잘 어울려요."
      },
      {
        "answer": "が相まって",
        "word": "映像とBGMとが相まって, 一瞬でその世界に惹き付けられた。",
        "mean": "영상과 배경음악이 어우러져 순식간에 그 세계에 끌렸다."
      },
      {
        "answer": "と相まって",
        "word": "凄まじい演技力と相まって胸に迫るものであった",
        "mean": "굉장한 연기력과 어우러져 가슴을 파고드는 것이었다."
      },
      {
        "answer": "が相まって",
        "word": "歌声と歌詞が相まっていて泣きそうになる。",
        "mean": "노랫소리와 가사가 어울려 울 것 같다."
      },
      {
        "answer": "が相まって",
        "word": "甘味と酸味が相まって美味しかった。",
        "mean": "단맛과 신맛이 어우러져 맛있었다."
      },
      {
        "answer": "が相まって",
        "word": "信頼と感謝。この二つが相まって初めて愛が成り立つ。",
        "mean": "믿음과 감사. 이 둘이 합쳐져야 사랑이 이루어진다."
      },
      {
        "answer": "が相まって",
        "word": "衣装にダンス, そしてが歌声が相まって, 思わずその可愛さに打ちのめされた。",
        "mean": "의상에 춤, 그리고 노랫소리가 어우러져 저도 모르게 그 귀여움에 푹 빠졌다."
      },
      {
        "answer": "が相まって",
        "word": "忙しさと体調不良とが相まって憂鬱な気分だ。",
        "mean": "바쁘고 몸살이 겹쳐 우울한 기분이다."
      },
      {
        "answer": "も相まって",
        "word": "二日酔いと寝不足も相まって具合悪くなった。",
        "mean": "숙취와 수면 부족도 겹쳐 몸이 불편해졌다."
      },
      {"answer": "も相まって", "word": "幼い顔も相まって可愛らしい。", "mean": "어린 얼굴도 어울려 귀엽다."},
      {
        "answer": "も相まって",
        "word": "気温, そして湿気も相まって暑すぎる。",
        "mean": "기온, 그리고 습기도 맞물려 너무 덥다."
      },
      {
        "answer": "も相まって",
        "word": "疲労に仕事のストレスも相まってもう限界だ。",
        "mean": "피로에 일 스트레스도 겹쳐 이젠 한계다."
      },
      {
        "answer": "も相まって",
        "word": "１日３０食限定, そして今は夏休みということも相まって, 朝イチで行かなければすぐ売り切れてしまう。",
        "mean": "하루 30끼 한정, 그리고 지금은 여름방학이라는 것도 맞물려 아침 일찍 가지 않으면 금방 매진된다."
      },
      {
        "answer": "も相まって",
        "word": "さっきゲームに課金しちゃったし, 他の買い物とかも相まって今月は支払い１０万円超えそう。",
        "mean": "아까 게임에 과금해 버렸고, 다른 쇼핑 등도 합쳐서 이번 달은 지불 10만엔이 넘을 것 같아."
      },
      {
        "answer": "も相まって",
        "word": "Ａ選手は正確なボールコントロールもそうだが, 特徴的な髪型も相まって人々の印象に残る選手になった。",
        "mean": "A 선수는 정확한 볼 컨트롤도 그렇지만, 특징적인 헤어스타일도 어우러져 사람들의 인상에 남는 선수가 되었다."
      },
      {
        "answer": "が相まって",
        "word": "可愛い衣装, そして透明感のある歌声とが相まって非常に良かった。",
        "mean": "귀여운 의상, 그리고 투명감 있는 노랫소리가 어우러져 매우 좋았다."
      }
    ]
  },
  {
    "id": 181,
    "grammar": "~といったところだ / というところだ / ってところだ ",
    "means": "기껏해야~정도이다, 대략~정도이다",
    "description": "수량 명사 뒤에 붙어서 '아무리 많아봐야~정도 밖에 안된다' 를 의미",
    "connectionWays": "숫자 + (조수사) +\n동사 사전형 + ",
    "examples": [
      {
        "answer": "といったところです",
        "word": "明日の気温は１２度から２０度といったところです。",
        "mean": "내일 기온은 기껏해야 12도에서 20도 정도입니다"
      },
      {
        "answer": "といったところでしょう",
        "word": "ここから目的地までは車で１時間といったところでしょう。",
        "mean": "여기서 목적지까지는 차로 많아 봤자 1시간 정도 걸리는 곳이겠지요."
      },
      {
        "answer": "といったところだろうか",
        "word": "見た感じ, あの人はもうすぐ４０歳といったところだろうか。",
        "mean": "보기에 저 사람은 이제 대략 40살 정도인 것 같아"
      },
      {
        "answer": "といったところです",
        "word": "来場者数はおよそ１万人といったところです。",
        "mean": "방문객 수는 기껏해야 약 1만 명 정도입니다."
      },
      {
        "answer": "といったところだ",
        "word": "発車まで５分といったところだ。急げばまだ間に合う。",
        "mean": "발차까지 대략 5분 정도 남았다.서두르면 아직 늦지 않아"
      },
      {
        "answer": "というところだ",
        "word": "残る座席は３席というところだ。",
        "mean": "남는 좌석은 기껏해야 3석 정도다 "
      },
      {
        "answer": "ってところだ",
        "word": "この薬が効き始めるのは服用後６~８時間後ってところだ。",
        "mean": "이 약이 효과를 내기 시작하는 것은 복용 후 대략 6~8시간 후 정도이다"
      },
      {
        "answer": "といったところだ",
        "word": "写真の頭身から推測すると, 彼は身長１５５~１６０ｃｍといったところだろう。",
        "mean": "사진의 두신으로 미루어 볼 때 그의 키 기껏해야 155~160cm 정도일 것이다.  "
      }
    ]
  },
  {
    "id": 183,
    "grammar": "~といったらありはしない / といったらありゃしない / ったらありゃしない / といったらない / ったらない",
    "means": "굉장히~하다, 정말~하다, 매우~하다\n형용하기 어렵다",
    "description":
        "정도나 상태를 나타내는 말에 대해서 그것을 강조하는 표현.\n\n[といったら, ありはしない] 의 회화체 표현은 [ったら, ありゃしない] 이다",
    "connectionWays":
        "동사 사전형\nい형용사 보통형\nい형용사 보통형 + こと + といったらありゃしない\nな형용사 어간 ( + だ) \nな형용사 어간 + なこと + といったらありゃしない\n명사 ( + だ) ",
    "examples": [
      {
        "answer": "といったらありゃしない",
        "word": "泥遊びなんて汚いといったらありゃしない。",
        "mean": "진흙탕 같은 건 너무 더랍다"
      },
      {
        "answer": "ったらない",
        "word": "女性の着物姿の美しさったらない。",
        "mean": "여자 기모노 차림은 정말 아름답다."
      },
      {
        "answer": "ったらありゃしない",
        "word": "今の時代携帯がないと不自由ったらありゃしない。",
        "mean": "요즘 시대에 핸드폰 없으면 너무 불편하다."
      },
      {
        "answer": "ったらありゃしない",
        "word": "ねばねばの食べ物は食べづらいったらありゃしない。",
        "mean": "끈적끈적한 음식은 정말 먹기 힘들다."
      },
      {
        "answer": "ったらない",
        "word": "次から次へと情報が入って来て, 忙しいったらない。",
        "mean": "자꾸 정보가 들어와서 매우 바쁘다."
      },
      {
        "answer": "ったらありゃしない",
        "word": "喉に何か詰まってて, 話しにくいったらありゃしない。",
        "mean": "목에 뭐가 막혀서 말하기 너무 어렵다"
      },
      {
        "answer": "といったらない",
        "word": "初めての一人暮らしの心細さといったらない。",
        "mean": "처음 혼자 사는 것은 너무 불안하다."
      },
      {
        "answer": "ったらありゃしない",
        "word": "そんな生き方, みっともないったらありゃしない。",
        "mean": "그런 삶의 매우 꼴불견이다"
      },
      {
        "answer": "といったらありゃしない",
        "word": "課題が終わった後の達成感といったらありゃしない。",
        "mean": "과제가 끝난 후의 성취감은 형용할 수 없다"
      },
      {
        "answer": "ったらありゃしない",
        "word": "文句ばっかりうるさいったらありゃしない。",
        "mean": "불평만 하고 매우 시끄럽다"
      },
      {
        "answer": "ったらありゃしない",
        "word": "蚊もハエも鬱陶しいったらありゃしない。",
        "mean": "모기도 파리도 너무 울적하다"
      },
      {
        "answer": "といったらない",
        "word": "この授業の進みの悪さといったらない。",
        "mean": "이 수업의 진척은 너무 나쁘다"
      },
      {
        "answer": "といったらない",
        "word": "やっと涼しくなってきました。 夜の寝やすさといったらない。",
        "mean": "드디어 시원해졌어요. 밤에 자기 매우 편하다"
      },
      {
        "answer": "ったらない",
        "word": "言葉にしたいことを言葉にできたときの気持ちよさったらない。",
        "mean": "말하고 싶은 것을 말로 할 수 있었을 때의 기분은 형언할 수 없다."
      },
      {
        "answer": "ったらない",
        "word": "１人の時に虫と遭遇した時の恐怖ったらない。",
        "mean": "혼자일 때 벌레와 조우했을 때의 두려움은 형언할 수 없다"
      }
    ]
  },
  {
    "id": 184,
    "grammar": "~ときたら / と来た日には (강하게 비난)",
    "means": "은/는,~로 말할 것 같으면",
    "description":
        "비교적 친숙한 인물이나 사물을 나타내는 명사에 접속하여 그러한 극단적인 행위나 성질에 대한 부정적인 평가나 강한 비난을 하는 문법이다.\n\n[ときたら]는 [は] 로 바꿔 쓸 수 있다.\n\n[と来た日には] 는 약간 딱딱한 말투",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ときたら",
        "word": "うちの猫ときたら, すぐトイレットペーパーで遊んで散らかしたがる。",
        "mean": "우리집 고양이는 (라고 하면) 바로 휴지 가지고 놀고 어지럽히고 싶어해."
      },
      {
        "answer": "ときたら",
        "word": "最近の若者ときたら, 挨拶もまともにできない人が多い。",
        "mean": "요즘 젊은이는 인사도 제대로 못하는 사람이 많다."
      },
      {
        "answer": "ときたら",
        "word": "旦那ときたら, 休みになればどこにも出掛けず家で寝てばかりいる。",
        "mean": "남편라고 말할 것 같으면 방학이 되면 아무 데도 나가지 않고 집에서 잠만 잔다."
      },
      {
        "answer": "と来た日には",
        "word": "息子と来た日には, 食事中もトイレ中もずっとスマホを離さない。",
        "mean": "아들라고 하면 (강조) 식사 중에도 화장실 중에도 계속 스마트폰을 놓지 않는다."
      },
      {
        "answer": "ときたら",
        "word": "友達が彼女との将来を考えているのに私ときたら",
        "mean": "친구가 그녀와의 장래를 생각하고 있는데 나는 ."
      },
      {
        "answer": "ときたら",
        "word": "オリンピックを見てると[ この人たちはすごいのに私ときたら… ]と思ってしまって精神衛生上良くない。",
        "mean": "올림픽을 보면 '이 사람들은 대단한데 나는 . ' 라고 생각이 들어서 정신위생상 좋지 않다."
      },
      {
        "answer": "ときたら",
        "word": "蝉ですら求愛行動するのに私ときたらもう…",
        "mean": "매미조차도 구애 행동하는데 나는 더 이상.."
      },
      {
        "answer": "ときたら",
        "word": "諸外国は対応が早いのに, 我が国ときたら緊急対応策さえも遅すぎる。",
        "mean": "외국은 대응이 빠른데 우리나라로 말 할 거 같으면 긴급 대응책조차 너무 늦다."
      }
    ]
  },
  {
    "id": 185,
    "grammar": "~ときたら (필연적인 판단, 결과)",
    "means": "~라고 하면",
    "description":
        "전건의 상황 하에서 인도되는 필연적인 판단이나 결과, 그것과 가장 적당하다고 생각되는 조합을 후건에서 말하는 문법\n\n좋은 일에도 나쁜 일에도 사용할 수 있다.",
    "connectionWays": "동사 사전형\n동사 ない형\n명사\nい형용사\nな형용사 어간",
    "examples": [
      {
        "answer": "ときたら",
        "word": "ポテチときたら, やっぱりコーラが合う。",
        "mean": "뽀떼찌 (과자) 하면 역시 콜라가 어울려."
      },
      {
        "answer": "ときたら",
        "word": "残業も多く, 休日も少ないときたら, 過労で倒れてもしょうがない。",
        "mean": "야근도 많고 휴일도 적다면 과로로 쓰러져도 소용없다."
      },
      {
        "answer": "ときたら",
        "word": "叱られてもすぐ謝れないときたら, 彼は今後社会人として生きていくことはできないだろう。",
        "mean": "꾸지람을 듣고도 바로 사과하지 못한다면 그는 앞으로 사회인으로 살아갈 수 없을 것이다."
      },
      {
        "answer": "ときたら",
        "word": "性格も明るくて容姿も美しいときたら, 誰も敵いっこない。",
        "mean": "성격도 밝고 용모도 아름답다면 누구도 적수가 없다."
      },
      {
        "answer": "ときたら",
        "word": "夏, 花火, 浴衣ときたら彼女ですね！",
        "mean": "여름, 불꽃놀이, 유카타 하면 여자친구네요!"
      },
      {
        "answer": "ときたら",
        "word": "胃痛, 腹痛ときたら次は頭痛か？",
        "mean": "위통, 복통이라고 하면 다음은 두통인가?"
      },
      {"answer": "ときたら", "word": "二宮金ときたら尊徳。", "mean": "니노미야 금하면 존덕."},
      {"answer": "ときたら", "word": "安くて美味いときたら最高でしょ。", "mean": "싸고 맛있으면 최고지."}
    ]
  },
  {
    "id": 186,
    "grammar": "~ともなく / ともなしに (목적도 의지도 없게 행동해지는 동작)\n",
    "means": "아무렇지도 않게~하다\n무의식적으로~하다",
    "description":
        "의지 동사에 접족하여, 그 동작이 무의식적으로 행해지는것을 표현한다.\n\n[見る, 言う, 話す] 등 일부의 동작에 붙는다",
    "connectionWays": "동사 사전형 + ともなく\n동사 사전형 + ともなしに",
    "examples": [
      {"answer": "ともなく", "word": "夜空を見るともなく見ていた。", "mean": "무심코 밤하늘을 보고 있었다."},
      {
        "answer": "ともなく",
        "word": "宇宙の果てはどうなっているのか, 考えるともなく考えることがある。",
        "mean": "우주의 끝은 어떻게 되어 있는가, 무심코 생각할 때가 다"
      },
      {
        "answer": "ともなく",
        "word": "友達と何を話すともなく話している時間が好き。",
        "mean": "친구와 아무 생각 없이 이야기하는 시간을 좋아합니다"
      },
      {
        "answer": "ともなく",
        "word": "掃除をしながらテレビを見るともなく見ていた。",
        "mean": "청소를 하면서 무의식으로 TV를 보고 있다"
      },
      {
        "answer": "ともなく",
        "word": "昨夜, 雨音を聞くともなく聞きながら線香花火をした。",
        "mean": "어젯밤 아무렇지 않게 빗소리를 들으면서 향불꽃을 피웠다."
      },
      {
        "answer": "ともなしに",
        "word": "青春という命の季節は, いつ来ていつ去るともなしに過ぎてしまった。",
        "mean": "청춘이라는 생명의 계절은 언제 오고 언제 떠나는지도 모르고 지나갔다."
      },
      {
        "answer": "ともなしに",
        "word": "過去にあった嫌なことを考えるともなしに考えてしまう。",
        "mean": "과거에 있었던 불쾌한 일을 무의식적으로 생각해 버렸다."
      },
      {
        "answer": "ともなしに",
        "word": "映画を暇なとき, 見るともなしに見ている。",
        "mean": "영화를 한가할 때, 아무렇지 않게 보고 있다."
      }
    ]
  },
  {
    "id": 187,
    "grammar": "~に至る /~に至って",
    "means": "~에 이르다 /~에 이르러서",
    "description":
        "여러 단계를 거쳐 최종단계에 도달하다.\n\n물리적 공간에의 도달, 사물이나 상황 변화의 결과, 결론 등을 나타낸다.\n\n문어체이다",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "至る",
        "word": "この川はＡ市内を通り, Ｂ市の海に至る。",
        "mean": "이 강은 A 시내를 지나 B시 바다에 이른다."
      },
      {
        "answer": "至っていない",
        "word": "いまだに規制を解除する基準には至っていない。",
        "mean": "아직까지 규제를 해제하는 기준에는 이르지 못했다."
      },
      {
        "answer": "至っていない",
        "word": "一人暮らしをしようかと考えているが, 考えているだけでまだ実行には至っていない。",
        "mean": "혼자 살까 생각하고 있지만 생각만 하고 아직 실행에는 이르지 못했다."
      },
      {
        "answer": "に至っている",
        "word": "初恋の人の好きな色が青だったから自分も青が好きになり, そのまま現在に至っている。",
        "mean": "첫사랑이 좋아하는 색이 파란색이었기 때문에 자신도 파란색을 좋아하게 되어 그대로 현재에 이르고 있다."
      },
      {
        "answer": "に至った",
        "word": "話し合いの末, Ａプランで進めていくに至った。",
        "mean": "논의 끝에 A플랜으로 진행하기에 이르렀다."
      },
      {
        "answer": "に至っている",
        "word": "一目惚れから始まったカップルの７０％が結婚に至っているというデータがある。",
        "mean": "첫눈에 반하면서 시작된 커플의 70%가 결혼에 이르렀다는 데이터가 있다."
      },
      {
        "answer": "に至っている",
        "word": "過去があって今に至っている。",
        "mean": "과거가 있어서 지금에 이르고 있다."
      },
      {
        "answer": "に至り",
        "word": "事故後数時間経過するに至り, 医者ももうどうにもできなかった。",
        "mean": "사고 후 몇 시간이 지나기에 이르러 의사도 이제 어쩔 수 없었다."
      }
    ]
  },
  {
    "id": 188,
    "grammar": "~に至るまで",
    "means": "~에 이르기 까지",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "に至るまで",
        "word": "現在に至るまで, この事件の全容は解明されていない。",
        "mean": "현재까지 이 사건의 전모는 밝혀지지 않았다."
      },
      {
        "answer": "に至るまで",
        "word": "旅行中空き巣に入られ, 貴金属類から家具に至るまで根こそぎ持って行かれた。",
        "mean": "여행 중 빈집에 들어가 귀금속류부터 가구에 이르기까지 송두리째 가져갔다."
      },
      {
        "answer": "に至るまで",
        "word": "主要国首脳会議の開催で大通りはもちろん, 住宅街に至るまで大規模な厳戒警備態勢が敷かれた。",
        "mean": "주요국 정상회의 개최로 큰길은 물론 주택가에 이르기까지 대규모 경계경비가 마련됐다."
      },
      {
        "answer": "に至るまで",
        "word": "一度目標を定めたら, 後はそこに至るまで地道に一歩一歩進んでいくだけだ。",
        "mean": "일단 목표를 정하면 나중에는 거기에 이르기까지 꾸준히 한발짝씩 나아갈 뿐이다."
      },
      {
        "answer": "に至るまで",
        "word": "鬱病の完治に至るまで数年程掛かりました。",
        "mean": "우울증 완치에 이르기까지 몇 년 정도 걸렸습니다."
      },
      {
        "answer": "に至るまで",
        "word": "付き合うに至るまで紆余曲折があった。",
        "mean": "사귀기에 이르기까지 우여곡절이 있었다."
      },
      {
        "answer": "に至るまで",
        "word": "何事も, 答えに至るまでの道筋がみな必ずしも同じとは限らない。",
        "mean": "모든 것이 답에 이르기까지의 길이 반드시 같다고는 할 수 없다."
      },
      {
        "answer": "に至るまで",
        "word": "古人の教えが現代に至るまで長い年月伝わってきている。",
        "mean": "고인의 가르침이 현대에 이르기까지 오랜 세월 전해져 오고 있다."
      },
      {
        "answer": "に至るまで",
        "word": "頭からつま先に至るまでずぶ濡れだ。",
        "mean": "머리부터 발끝까지 흠뻑 젖었다."
      },
      {
        "answer": "に至るまで",
        "word": "この作品はキャラクターのデザインから物語, その背景に至るまで精巧に描かれている。",
        "mean": "이 작품은 캐릭터 디자인부터 이야기, 그 배경에 이르기까지 정교하게 그려져 있다."
      }
    ]
  },
  {
    "id": 190,
    "grammar": "にかかっている",
    "means": "~에 달려있다",
    "examples": [
      {
        "answer": "にかかっている",
        "word": "この国が今後発展するかどうかは, 今の若者にかかっている。",
        "mean": "이 나라가 앞으로 발전할지는 지금 젊은이들에게 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "私が大金持ちになれるかどうかは, 今日の宝くじの結果にかかっている。",
        "mean": "내가 갑부가 될 수 있을지는 오늘 복권 결과에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "うちの会社の運命は, 新しい社長の手腕にかかっている。",
        "mean": "우리 회사의 운명은 새 사장의 수완에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "新しい自転車を買ってもらえるかどうかは, 来月のテストの結果にかかっている。",
        "mean": "새 자전거를 사줄 수 있을지는 다음 달 테스트 결과에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "いい夫婦関係を築けるかどうかは, お互いが本音を言い合えるかどうかにかかっている。",
        "mean": "좋은 부부관계를 맺을 수 있느냐는 것은 서로가 속마음을 말할 수 있느냐에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "うちのチームが勝つかどうかは, 田中にかかっている。",
        "mean": "우리 팀이 이길지 여부는 다나카(田中)에게 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "今回のプロジェクトが成功するかどうかは, 今日のプレゼンの出来にかかっている。",
        "mean": "이번 프로젝트의 성공 여부는 오늘 프레젠테이션의 완성 여부에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "卒業できるかどうかは, 明日の期末テストの出来にかかっている。",
        "mean": "졸업할 수 있을지 어떨지는 내일 기말고사의 완성 여부에 달려 있다."
      },
      {
        "answer": "にかかっている",
        "word": "この患者の命を救えるかどうかは, 私たちにかかっている。",
        "mean": "이 환자의 생명을 구할 수 있을지는 우리에게 달려 있다."
      }
    ]
  },
  {
    "id": 193,
    "grammar": "~にしてみたら , にしてみれば / にしてみても",
    "means": "~의 입장에서 보면 /~의 입장에서 봐도",
    "description":
        "인물을 나타내는 명사에 대해서 사람마다 생각이나 견해가 다르다는 것을 말하는 문법,\n이 문형은 일반적인 개념에 대해서 자주 사용함.\n개인에 대해서는 [~にとって ]를 사용하는 것이 더 좋다.",
    "connectionWays": "사물을 표현하는 명사에 접속",
    "examples": [
      {
        "answer": "にしてみたら",
        "word": "花柄の服なんて男にしてみたら恥ずかしい。",
        "mean": "꽃무늬 옷따위 남자의 입장에서 보면 창피해."
      },
      {
        "answer": "にしてみたら",
        "word": "生徒が何百人もいると, 先生にしてみたら一人ひとりのことなんていちいち気にしていられないはずだ。",
        "mean": "학생이 수백 명이나 있으면 선생님 입장에서는 한 사람 한 사람 일 따위는 일일이 신경 쓰지 않을 것이다."
      },
      {
        "answer": "にしてみたら",
        "word": "客にしてみたら, 正社員でもアルバイトでも同じ店員だ。",
        "mean": "손님의 입장에서 보면 정규직이든 아르바이트든 같은 점원이다."
      },
      {
        "answer": "にしてみたら",
        "word": "お酒が大好きな私にしてみたら, お酒を飲む以外でストレス発散する方法が見つからない。",
        "mean": "술을 아주 좋아하는 나의 입장에서 보면 술을 마시는 것 외에는 스트레스를 풀 방법을 찾을 수 없다."
      },
      {
        "answer": "にしてみたら",
        "word": "綺麗好きな人にしてみたら, ここは汚すぎて耐えられないだろう。",
        "mean": "깔끔하고 좋아하는 사람의 입장에서 보면 여기는 너무 더러워서 견딜 수 없을 거야."
      },
      {
        "answer": "にしてみても",
        "word": "手術は怖いことだが, それは医者にしてみても同じだ。",
        "mean": "수술은 무서운 일이지만 그건 의사의 입장에서 봐도 마찬가지다."
      },
      {
        "answer": "にしてみても",
        "word": "子供の未来は親にしてみても心配だ。",
        "mean": "자식의 미래는 부모 입장에서도 걱정이다."
      },
      {
        "answer": "にしてみると",
        "word": "九死に一生を得た私にしてみると, 今何事もなく健康で生きていることこそが幸せだ。",
        "mean": "구사일생으로 살아난 나의 입장으로 보면 지금 아무 일 없이 건강하게 살고 있는 것이야말로 행복이다."
      },
      {
        "answer": "にしてみれば",
        "word": "税金を無駄遣いされて, 国民にしてみれば当然不満だろう。",
        "mean": "세금 낭비로 국민 입장에서 보면 당연히 불만일 것이다."
      },
      {
        "answer": "にしてみれば",
        "word": "私にしてみれば友達は私を助けてくれる道具のようなものだ。",
        "mean": "나의 입장에서 보면 친구는 나를 도와주는 도구와 같다."
      }
    ]
  },
  {
    "id": 194,
    "grammar": "~にしろ / ~にしたって / ~にせよ / ~にしても",
    "means": "~라고 해도,~라고 하더라도",
    "description": "예외 없이 성립한 것을 표현한다\n\n[どんなに, いくら] 등 과 자주 결합한다.",
    "connectionWays": "명사 \nい형용사 보통형 \nな형용사 어간 \n동사 보통형 ",
    "examples": [
      {"answer": "にせよ", "word": "何にせよまず安全第一である。", "mean": "뭐라고 해도 안전이 제일이다."},
      {
        "answer": "にせよ",
        "word": "いくら大好物にせよ, 食べ過ぎると飽きる。",
        "mean": "아무리 좋아해도 너무 많이 먹으면 질린다."
      },
      {
        "answer": "にしても",
        "word": "いずれにしても探し回っている時間はない。",
        "mean": "어쨌든 찾아다닐 시간은 없다."
      },
      {
        "answer": "にせよ",
        "word": "子供のしたことにせよ, 許されることではない。",
        "mean": "아이가 한 짓이든 용서받을 일은 아니다."
      },
      {
        "answer": "にしろ",
        "word": "相手が年下にしろ, 最低限の礼儀は必要だ。",
        "mean": "상대가 연하건 최소한의 예의는 필요하다."
      }
    ]
  },
  {
    "id": 195,
    "grammar": "~につけ",
    "means": "~때마다",
    "description": "할 때 마다~한 기분(생각) 이 든다 라는 의미",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "につけて",
        "word": "このメロディーを聞くにつけて, 子供の頃を思い出す。",
        "mean": "이 멜로디를 들을 때마다 어렸을 때가 생각난다."
      },
      {
        "answer": "につけて",
        "word": "今の旦那から結婚する前にもらった手紙を読むにつけて, たくさんデートしたことを思い出す。",
        "mean": "지금 남편이 결혼하기 전에 받은 편지를 읽을 때마다 데이트를 많이 했던 기억이 난다."
      },
      {
        "answer": "につけて",
        "word": "時々, 勉強をやめたいこともあるが, 電話で家族の声を聞くにつけて, もっと頑張らなければと思う。",
        "mean": "가끔 공부를 그만두고 싶기도 하지만 전화로 가족들의 목소리를 들을 때마다 더 열심히 해야겠다고 생각한다."
      },
      {
        "answer": "につけて",
        "word": "この写真を見るにつけて, 昔, 家族で旅行したことを思い出す。",
        "mean": "이 사진을 뽈 때마다 옛날에 가족끼리 여행했던 기억이 난다."
      },
      {
        "answer": "につけて",
        "word": "この音楽を聞くにつけて, 学生時代を思い出す。",
        "mean": "이 음악을 들을 때마다 학창시절이 생각난다."
      }
    ]
  },
  {
    "id": 196,
    "grammar": "~につけ~につけ",
    "means": "~하든~하든",
    "description": "앞 뒤에 반대의 의미를 가진 단어가 들어가 ‘언제나’ 라는 의미를 나타낸다",
    "connectionWays":
        "동사 사전형 + につけ + 동사 사전형 + につけ \nい형용사 사전형 + につけ + い형용사 사전형 \n명사 + につけ + 명사 + につけ",
    "examples": [
      {
        "answer": "につけ",
        "word": "嬉しいにつけ, 悲しいにつけ, 泣くのがくせだ。",
        "mean": "좋든 슬프든 우는 게 습관이다."
      },
      {
        "answer": "につけ",
        "word": "夏につけ, 冬につけ, 服装を調節するのがむずかしい。",
        "mean": "여름이든 겨울이든 복장을 조절하기가 어렵다."
      },
      {
        "answer": "につけ",
        "word": "本につけ, まんがにつけ, 読むのが好きです。",
        "mean": "책이든 만화든 읽는 것을 좋아합니다."
      },
      {
        "answer": "につけ",
        "word": "事件のニュースを見るにつけ, 聞くにつけ, 悲しい気持ちになる。",
        "mean": "사건 뉴스를 보거나 듣거나 슬픈 기분이 든다."
      },
      {
        "answer": "につけ",
        "word": "合格につけ, 不合格につけ, 報告をしてください。",
        "mean": "합격이든 불합격이든 보고를 해주세요."
      }
    ]
  },
  {
    "id": 197,
    "grammar": "~には及ばない (およばない) ",
    "means": "1.~에 미치지 못 한다\n2.~할 것 까지도 없다,~할 필요도 없다",
    "description":
        "1. [ＡはＢに (は) 及ばない] 의 문형으로, A보다 B가 우수하다는 것을 나타낸다.\n\n[~には敵わない (かなわない] 문법과 같은 의미\n\n2. 상대방의 기분이나 제안 등에 대해 [일부러~할 필요가 없다]는 완곡적인 거부를 나타낸다.\n\n비슷한 문법 [~には当たらない,~までもない / までもなく]",
    "connectionWays": "동사 기본형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "に及ばない",
        "word": "数学で言えば, 私は彼に及ばない。",
        "mean": "수학으로 말하면, 나는 그에게 미치지 못한다."
      },
      {
        "answer": "及ばない",
        "word": "彼の洞察力には到底及ばない。",
        "mean": "그의 통찰력에는 도저히 미치지 못한다."
      },
      {
        "answer": "及ばない",
        "word": "コンピューターの知識では, 彼に全く及ばない。",
        "mean": "컴퓨터 지식으로는 그에게 전혀 미치지 못한다."
      },
      {
        "answer": "には及ばないだろう",
        "word": "何年練習しても, 彼の才能には及ばないだろう。",
        "mean": "몇 년 연습해도 그의 재능에는 미치지 못할 것이다."
      },
      {
        "answer": "には及びません",
        "word": "その話は既に聞いていますので, 説明には及びません。",
        "mean": "그 얘기는 이미 들었기 때문에 설명할 필요는 없습니다."
      },
      {
        "answer": "は及びません",
        "word": "私は当然のことをしただけなので, お礼には及びません。",
        "mean": "저는 당연한 일을 했을 뿐이므로 감사할 필요는 없습니다."
      },
      {
        "answer": "には及びません",
        "word": "帰り道は分かっていますので, 心配には及びません。",
        "mean": "돌아가는 길은 알고 있기 때문에 걱정할 필요는 없습니다."
      },
      {
        "answer": "には及びません",
        "word": "わざわざお迎えに来ていただかなくても結構です。それには及びません。",
        "mean": "일부러 마중 나와 주시지 않으셔도 됩니다.그럴 필요는 없어요."
      }
    ]
  },
  {
    "id": 203,
    "grammar": "ぐるみ",
    "means": "~전부",
    "description": "집단을 나타내는 명사에 붙어서 그 물건을 포함한 모든 물건을 나타낸다.\n\n원형은 包む(くるむ) 이다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ぐるみ",
        "word": "襲われて身ぐるみ剥がされ, 持ち物全部盗まれた。",
        "mean": "습격을 받아 몸을 몽땅 털리고, 소지품 전부 도둑맞았다."
      },
      {"answer": "ぐるみ", "word": "Ａ君とは家族ぐるみの付き合いだ。", "mean": "A 군과는 온 가족의 교제다."},
      {"answer": "ぐるみ", "word": "この事件は村ぐるみの事件だ。", "mean": "이 사건은 온 마을의 사건이다."},
      {
        "answer": "ぐるみ",
        "word": "Ａ国の大量虐殺事件の真相は国家ぐるみで隠蔽されている。",
        "mean": "A국 대량학살 사건의 진상은 국가 차원에서 은폐되고 있다."
      },
      {
        "answer": "ぐるみ",
        "word": "犯行の手口を見ると, 単独犯ではなく, 組織ぐるみだと思われる。",
        "mean": "범행 수법을 보면 단독범이 아니라 조직 전체로 보인다."
      },
      {
        "answer": "ぐるみ",
        "word": "Ａ党は党ぐるみで国民を騙そうとしている。",
        "mean": "A당은 온 몸으로 국민을 속이려 하고 있다."
      },
      {
        "answer": "ぐるみ",
        "word": "Ａ高校のいじめ問題は長年学校ぐるみで隠蔽されてきたが, 在校生の内部告発により公になった。",
        "mean": "A고교의 괴롭힘 문제는 오랜 기간 학교 차원에서 은폐돼 왔으나 재학생들의 내부 고발로 불거졌다."
      },
      {
        "answer": "ぐるみ",
        "word": "Ａ社は会社ぐるみで詐欺を行っていた。",
        "mean": "A사는 회사 전체에서 사기를 치고 있었다."
      }
    ]
  },
  {
    "id": 204,
    "grammar": "~ずにはすまない",
    "means": "반드시~해야 한다",
    "description": "사회적 상식, 도덕적 기준에서 ‘~해야 한다’ 는 의미",
    "connectionWays": "동사 ない형, する는 せずに",
    "examples": [
      {
        "answer": "~ずにはすまない",
        "word": "今回のことは彼が責任を取らずにはすまない。",
        "mean": "이번의 일은 그가 반드시 책임 지어야 한다"
      },
      {
        "answer": "せずにはすまなかった",
        "word": "隣の家の窓ガラスを割ってしまったので, 弁償をせずにはすまなかった",
        "mean": "옆집 창문을 깨 버려서 반드시 변상해야 했다"
      },
      {
        "answer": "せずにはすまない",
        "word": "軽い事件でも起きたのなら, その原因を調査せずにはすまない",
        "mean": "가벼운 사건이라도 일어나면, 반드시 그 이유를 조사해야한다"
      }
    ]
  },
  {
    "id": 205,
    "grammar": "とあっては",
    "means": "~이라면",
    "description": "とあっては 뒤에는 부정표현이 많이 온다",
    "connectionWays": "명사에 직접 접속, 다양한 동사",
    "examples": [
      {
        "answer": "とあっては",
        "word": "彼女が応援してくれるとあっては絶対に負けられない。",
        "mean": "그녀가 응원해준다면 절대 질 수 없어."
      },
      {
        "answer": "とあっては",
        "word": "社長直々の命令とあっては嫌でもやらなければ。",
        "mean": "사장 직제 명령이라면 싫어도 해야지."
      },
      {
        "answer": "とあっては",
        "word": "Ａさんの頼みとあっては断れない。",
        "mean": "A씨의 부탁이라면 거절할 수 없다."
      },
      {
        "answer": "とあっては",
        "word": "自国民が殺されたとあっては, 政府としても何もしないわけにはいかない。",
        "mean": "자국민이 살해됐다면 정부로서도 아무것도 하지 않을 수 없다."
      },
      {
        "answer": "とあっては",
        "word": "この値段とあってはかなり売れそうだ。",
        "mean": "이 가격이면 꽤 잘 팔릴 것 같아."
      },
      {
        "answer": "とあっては",
        "word": "生のオーケストラを聴けるとあっては行かなければ。",
        "mean": "생중계 오케스트라를 들을 수 있다면 가야지."
      },
      {
        "answer": "とあっては",
        "word": "愛する子が失踪するとあっては, どんな親でも心配しないはずがない。",
        "mean": "사랑하는 아이가 실종된다면 어떤 부모라도 걱정하지 않을 리 없다."
      },
      {
        "answer": "とあっては",
        "word": "大好きなアイドルがやってくるとあっては行かない理由がない。",
        "mean": "좋아하는 아이돌이 찾아오면 있어서는 안 갈 이유가 없다."
      }
    ]
  },
  {
    "id": 206,
    "grammar": "とあれば",
    "means": "~이라면",
    "description": "とあれば는 주로~のため+とあれば (~을 위해서라면) 라 주요 쓰인다",
    "connectionWays": "명사에 직접 접속, 다양한 동사",
    "examples": [
      {
        "answer": "ためとあれば",
        "word": "生きるためとあれば, 罪を犯しても良いものでしょうか。",
        "mean": "살기 위해서라면 죄를 지어도 될까요?"
      },
      {
        "answer": "ためとあれば",
        "word": "私は愛する妻や息子のためとあれば, 何でもする。",
        "mean": "나는 사랑하는 아내나 아들을 위해서라면 무엇이든 한다."
      },
      {
        "answer": "とあれば",
        "word": "命が助かるとあれば, いくらでも払います。",
        "mean": "생명이 살아난다면 얼마든지 지불하겠습니다."
      },
      {
        "answer": "ためとあれば",
        "word": "お金のためとあれば, 彼は友達さえも裏切る。",
        "mean": "돈을 위해서라면 그는 친구조차도 배신한다."
      },
      {
        "answer": "とあれば",
        "word": "親友の頼みとあれば, 仕方がない。手伝ってあげるよ",
        "mean": "친한 친구의 부탁이라면 어쩔 수 없다.도와줄게"
      }
    ]
  },
  {
    "id": 207,
    "grammar": "といえども",
    "means": "~라고 해요",
    "description": "いくら~といえども 형태로 자주 사용되며 , 아무리~라고 해도 (역접) 의 의미이다",
    "connectionWays": "보통형 접속",
    "examples": [
      {
        "answer": "といえども",
        "word": "いくら生きるためといえども, 人の物を盗むのは良くない。",
        "mean": "아무리 살기 위해서라도 남의 물건을 훔치는 것은 좋지 않다."
      },
      {
        "answer": "といえども",
        "word": "いくら安いといえども, 偽物であれば欲しいとは思わない。",
        "mean": "아무리 싸다고 해도 가짜라면 갖고 싶지 않다."
      },
      {
        "answer": "といえども",
        "word": "未成年といえども, 罪を犯したのであれば償うべきだ。",
        "mean": "미성년자라도 죄를 지었으면 속죄해야 한다."
      },
      {
        "answer": "といえども",
        "word": "プロのギタリストといえども, ミスをすることはあり得る。",
        "mean": "프로 기타리스트라고 해도 실수를 할 수는 있다."
      },
      {
        "answer": "といえども",
        "word": "たった10円といえども, 粗末にしてはならない。",
        "mean": "단돈 10엔이라고 해도 소홀히 해서는 안 된다."
      },
      {
        "answer": "といえども",
        "word": "会社の社長といえども, 簡単には社員を首にすることはできない。",
        "mean": "회사 사장이라고 해도 쉽게 직원을 해고할 수는 없다."
      },
      {
        "answer": "といえども",
        "word": "彼は大学を中退したといえども, 今では大企業の社長として立派に働いている。",
        "mean": "그는 대학을 중퇴했지만 지금은 대기업 사장으로 훌륭하게 일하고 있다."
      },
      {
        "answer": "といえども",
        "word": "会社を作ったといえども, まだ社員が二人だけなので, 会社と言えるかどうか。",
        "mean": "회사를 만들었다지만 아직 직원이 두 명뿐이니 회사라고 할 수 있을까?"
      },
      {
        "answer": "といえども",
        "word": "外国人といえども, 日本に住んでいるのだから, 日本の法律は守らなければならない。",
        "mean": "외국인이라고 해도 일본에 살고 있으니 일본의 법률은 지켜야 한다."
      }
    ]
  },
  {
    "id": 208,
    "grammar": "とはいえ",
    "means": "~라고는 해도 ",
    "description": "앞 부분의 전제는 인정하지만, 그에 반하는 본인의 의견을 이야기할 때 사용하는 표현.",
    "connectionWays": "명사에 직접 접속, 동사 보통형",
    "examples": [
      {
        "answer": "とはいえ",
        "word": "癌の手術に成功したとはいえ, 他の場所に転移しているかもしれないし, まだまだ安心できない。",
        "mean": "암 수술에 성공했다고는 하지만 다른 곳으로 전이되었을지도 모르고 아직 안심할 수 없다."
      },
      {
        "answer": "とはいえ",
        "word": "気分が悪かったとはいえ, 遅れるのであれば出社前に会社に連絡すべきである。",
        "mean": "기분이 나빴다고는 하지만 늦는다면 출근 전 회사에 연락해야 한다."
      },
      {
        "answer": "とはいえ",
        "word": "もう過去のこととはいえ, そう簡単には許すことはできない。",
        "mean": "이미 과거의 일이라지만 그렇게 쉽게 용서할 수는 없다."
      },
      {
        "answer": "とはいえ",
        "word": "ここは最寄り駅とはいえ, 自宅から自転車でも20分はかかる。",
        "mean": "이곳은 가장 가까운 역이라고 해도 집에서 자전거로 20분은 걸린다."
      },
      {
        "answer": "とはいえ",
        "word": "親しい関係だとはいえ, 最低限の礼儀を忘れてはいけない。",
        "mean": "친한 사이라고 해도 최소한의 예의를 잊어서는 안 된다."
      },
      {
        "answer": "とはいえ",
        "word": "彼はまだ未成年だとはいえ, 自分の犯した行為にしっかりと責任を持つべきだ。",
        "mean": "그는 아직 미성년이라고 해도 자신이 저지른 행위에 대해 책임을 져야 한다."
      },
      {
        "answer": "とはいえ",
        "word": "私は日本人だとはいえ, アメリカで育ったので, 漢字があまり読めません。",
        "mean": "저는 일본인이지만 미국에서 자랐기 때문에 한자를 잘 읽을 수 없습니다."
      },
      {
        "answer": "とはいえ",
        "word": "結婚に年齢差は関係ないとはいえ, やはり年の差のせいで結婚をした人を見ると色々考えてしまう。",
        "mean": "결혼에 나이차는 상관없다고는 하지만 역시 나이차 때문에 결혼을 한 사람을 보면 많은 생각이 든다."
      },
      {
        "answer": "とはいえ",
        "word": "男女平等とはいえ, 会社で地位が高い人はたいてい男性だ。",
        "mean": "남녀평등이라고는 하지만 회사에서 지위가 높은 사람은 대개 남성이다."
      },
      {
        "answer": "とはいえ",
        "word": "分かっているとはいえ, やっぱり別れは辛いものだ。",
        "mean": "알고 있다고는 하지만 역시 이별은 괴로운 법이다."
      }
    ]
  },
  {
    "id": 209,
    "grammar": "ながらに / ながらの",
    "means": "~인 채로,~인 상태로 /~그대로의",
    "description":
        "관용적으로 사용될 때 많다\n\n生まれながら (태어날 때부터)\nいつもながら (항상, 늘)\n涙ながら(눈물을 흘리면서)\n昔ながら (옛날 그대로)",
    "connectionWays": "동사 ます형, 명사에 직접 접속",
    "examples": [
      {
        "answer": "昔ながら",
        "word": "昔ながらの伝統を大切にしよう。",
        "mean": "옛날 그대로의 전통을 소중히하자"
      },
      {
        "answer": "生まれながら",
        "word": "人には必ず生まれながらの使命がある。",
        "mean": "인간에게는 반드시 태어날 때부터의 사명이 있다"
      },
      {
        "answer": "いつもながら",
        "word": "今日見たあの子はいつもながら可愛かった。",
        "mean": "오늘 본 그 아이는 언제나 귀여웠다"
      },
      {
        "answer": "涙ながらに",
        "word": "涙ながらに[ 本当にありがとうございます ]と何度も言われた。",
        "mean": "눈물을 흘리면서 \"정말로 감사합니다\" 라고 몇번이나 들었다"
      },
      {
        "answer": "生まれながらに",
        "word": "人間は生まれながらにして異なる個性と才能, 環境を持つ。",
        "mean": "인간은 태어날 때부터 다른 개성과 재능, 환경을 갖는다."
      },
      {
        "answer": "生まれながらに",
        "word": "王子は生まれながらに孤独であった。",
        "mean": "왕자는 태어날 때부터 고독했다."
      },
      {
        "answer": "昔ながらの",
        "word": "街から昔ながらの喫茶店が減っている。",
        "mean": "거리에서 옛날 그대로의 찻집이 줄어들고 있다."
      },
      {
        "answer": "涙ながらに",
        "word": "数年ぶりの再会を涙ながらに喜んだ。",
        "mean": "몇 년 만의 재회를 눈물 흘리며 기뻐했다."
      },
      {
        "answer": "涙ながらに",
        "word": "おじいちゃんは孫の成長を涙ながらに喜んでいた。",
        "mean": "할아버지는 손자의 성장을 눈물 흘리며 기뻐하셨다."
      },
      {
        "answer": "いつもながら",
        "word": "彼の決断力にはいつもながら脱帽です",
        "mean": "그의 결단력에는 언제나 경의를 표합니다."
      }
    ]
  },
  {
    "id": 210,
    "grammar": "にあって(は)",
    "means": "~에,~에서",
    "description": "특별한 상황 / 장소에서 라는 의미",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にあって(は)",
        "word": "この不景気にあって, 私たちがすべきことは何だと思いますか。",
        "mean": "이 불경기에 우리가 해야할 것은 무엇이라 생각하십니까"
      },
      {
        "answer": "にあって(は)",
        "word": "大企業じゃなくてもいいので, 不況下にあっても, 成長し続けられる会社に僕は就職したいと思っている。",
        "mean": "대기업이 아니여도 좋으니까, 불경기에서도 계속 성장하는 회사에 취업하고 싶다"
      },
      {
        "answer": "にあって(は)",
        "word": "山根部長は, 普段めちゃくちゃ怖いけど, 家庭にあって私たちが想像できないほど優しいパパだそうだよ。",
        "mean": "야마네 부장님은 평소 엄청 무섭지만, 가정에서 ㅜ리가 상상할 수 없는 정도 상냥한 아빠래"
      }
    ]
  },
  {
    "id": 211,
    "grammar": "にかかわる",
    "means": "~에 관련된",
    "description": "목숨, 생사, 명예와 같이 아주 중대한 것과 관련이 있다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に関わってくる",
        "word": "同じミスを繰り返すのは信用問題に関わってくる。",
        "mean": "같은 실수를 반복하는 것은 신용 문제와 관련된다"
      },
      {
        "answer": "命に関わる",
        "word": "命に関わる病気ではないので, 安心してください。",
        "mean": "생명과 관련된 질병이 아니기 때문에 안심하십시오."
      },
      {
        "answer": "関わってくる",
        "word": "将来, 十分な年金がもらえないと, 私たちの将来の生活に大きく関わってくる。",
        "mean": "장래, 충분한 연금을 받지 못하면, 우리의 장래 생활에 크게 관련 된다."
      },
      {
        "answer": "に関わる",
        "word": "お客様のプライバシーに関わることですのでお伝えできません。",
        "mean": "고객님의 사생활과 관련된 일이라 말씀드릴 수 없습니다."
      }
    ]
  },
  {
    "id": 212,
    "grammar": "にかたくない",
    "means": "~하기 어렵지 않다,~하고도 남는다",
    "description": "想像(する), 察する 등에 자주 붙는다.",
    "connectionWays": "동사 기본형, 명사에 직접 접속",
    "examples": [
      {
        "answer": "にかたくない",
        "word": "若くして母を失った子の気持ちは想像にかたくない",
        "mean": "젊은 나이에 엄마를 잃은 아이의 기분은 상상하기 어렵지 않다."
      },
      {
        "answer": "にかたくない",
        "word": "友人の変わり果てた姿をみて, どんなに驚いたか想像にかたくない。",
        "mean": "친구의 달라진 모습을 보고 얼마나 놀랐을지 상상하기 어렵지 않다."
      },
      {
        "answer": "にかたくない",
        "word": "津波で家を失った人々のショックは, 想像にかたくない。",
        "mean": "쓰나미로 집을 잃은 사람들의 충격은 상상하기 어렵지 않다."
      },
      {
        "answer": "にかたくない",
        "word": "このままの状況が続くと, 日本の経済はダメになることは想像にかたくない。",
        "mean": "이대로의 상황이 계속되면, 일본의 경제는 망치는 것은 상상하기 어렵지 않다."
      },
      {
        "answer": "にかたくない",
        "word": "なぜ彼があのような行動をとったのか, 事情を聞いてみれば理解にかたくない。",
        "mean": "왜 그가 그런 행동을 했는지 사정을 들어보면 이해하기 어렵지 않다."
      },
      {
        "answer": "にかたくない",
        "word": "消費税の増税は国民にとって, 大きな負担になることは理解にかたくない。",
        "mean": "소비세 증세는 국민에게 큰 부담이 된다는 것은 이해하기 어렵지 않다."
      }
    ]
  },
  {
    "id": 213,
    "grammar": "に即して",
    "means": "~에 입각하여",
    "description": "앞의 내용을 기준으로 한다는 의미",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に即して",
        "word": "最近は事実に即した報道をしていないマスメディアが増えてきたように思う。",
        "mean": "최근에는 사실에 입각한 보도를 하지 않는 매스미디어가 많아진 것 같다."
      },
      {
        "answer": "に即して",
        "word": "実際に即した改善案を提示していただけないと, 現場はますます混乱する一方でございます。",
        "mean": "실제 즉각적인 개선안을 제시해주지 않으면 현장은 더욱 혼란스러울 뿐입니다."
      },
      {
        "answer": "に即して",
        "word": "学校の規則に則して, 髪は黒にしなければならない。",
        "mean": "학교 규칙에 따라 머리는 검은색으로 해야 한다."
      }
    ]
  },
  {
    "id": 214,
    "grammar": "の至りだ",
    "means": "~의 극치이다,~하기 그지없다",
    "description": "정도가 심하다는 의미\n\n(光栄の至り, 感激の至り, 幸甚の至り등)",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "の至りです",
        "word": "このような式典に参加でき, 光栄の至りです。",
        "mean": "이런 식전에 참석하게 되어 영광스럽기 그지없습니다."
      },
      {
        "answer": "の至りでございます",
        "word": "皆様のご声援に感激の至りでございます。",
        "mean": "여러분의 성원에 감격하기 그지없습니다."
      },
      {
        "answer": "幸甚の至りです",
        "word": "少しでもお役に立てば幸甚の至りです。",
        "mean": "조금이라도 도움이 된다면 대단히 다행입니다."
      },
      {
        "answer": "光栄の至りでした",
        "word": "限られた時間でしたが, 大変貴重なお話しを伺え, その場にいられましたことが光栄の至りでした。",
        "mean": "한정된 시간이었지만 매우 귀중한 이야기를 들을 수 있었고, 그 자리에 있게 된 것이 영광스럽기 그지없었습니다."
      },
      {
        "answer": "感謝の至りです",
        "word": "多くの方に応援して頂いて感謝の至りです。",
        "mean": "많은 분들이 응원해 주셔서 감사하기 그지없습니다."
      },
      {
        "answer": "恐縮の至りです",
        "word": "褒めていただき恐縮の至りです。",
        "mean": "칭찬해 주셔서 황송하기 짝이 없습니다."
      },
      {
        "answer": "の至り",
        "word": "若気の至りを経験してこそ本当の大人になれる。",
        "mean": "젊음의 극치를 겪어야 진정한 어른이 될 수 있다."
      }
    ]
  },
  {
    "id": 215,
    "grammar": "ばこそ",
    "means": "~이기 때문에",
    "description":
        "다른 이유는 없고 [오직~이유 때문에 이유 / 원인을 강조] 한다는 표현.\n\n[から] 도 이유의 의미를 내표하고 있지만 강조의 의미는 없다.\n\n뒤에 のだ 가 자주 붙는다.",
    "connectionWays": "동사 가정법 ば",
    "examples": [
      {
        "answer": "命あればこそ",
        "word": "どんなことも命あればこそできる。",
        "mean": "어떤 일도 목슴이 있기 때문에 가능하다"
      },
      {"answer": "あればこそ", "word": "苦があればこそ楽もある。", "mean": "고생이 있기 때문에 낙도 있다"},
      {
        "answer": "愛せばこそ",
        "word": "ワインを愛せばこそどう作られているのか気になるものだ。",
        "mean": "와인을 사랑하기 때문에 어떤 것으로 만들어져 있는지가 궁금해지는 것이다"
      },
      {
        "answer": "思えばこそ",
        "word": "死を思えばこそ, 生の意味を知る。",
        "mean": "죽음을 생각하기 때문에 생명의 의미를 안다"
      },
      {
        "answer": "思えばこそ",
        "word": "大切に思えばこそ心配になる。",
        "mean": "중요하게 생각하기 때문에 걱정이 된다"
      },
      {
        "answer": "あればこそ",
        "word": "健康であればこそ, 楽しい時間を過ごせる。",
        "mean": "건강하기 때문에 즐거운 시간을 보낼 수 있다"
      },
      {
        "answer": "考えればこそ",
        "word": "親は子どもの将来を考えればこそ, ときどき厳しいことを言うのだ。",
        "mean": "부모님 아이의 미래를 생각하기 때문에 가끔 엄한 말을 하는 것이다"
      },
      {
        "answer": "いればこそ",
        "word": "自分の努力を認めてくれる人がいればこそ, やる気も出てくるというものだ。",
        "mean": "자신의 노력을 인정해주는 사람이 있기 때문에 의욕이 나오는 것이다"
      },
      {
        "answer": "あればこそ",
        "word": "今回のプロジェクトが成功したのは御社のご協力があればこそだと深く感謝しております。",
        "mean": "이번 프로젝트가 생공 한 것은 귀사의 협력이 있었기 때문이라고 깊게 감사하고 있습니다"
      },
      {
        "answer": "あればこそ",
        "word": "大企業にはできない, ベンチャー企業であればこそできることに徹底してこの会社は急成長を遂げた。",
        "mean": "대기업에서는 할 수 없는 밴처 기업이기 때문에 가능한 것이 철처하게 이 회사는 급성장을 이뤘다"
      }
    ]
  },
  {
    "id": 216,
    "grammar": "ばそれまでだ, たらそれまでだ",
    "means": "~하면 그걸로 끝이다,~하면 그만이다",
    "description": "일단~하면 그걸로 끝이다, 다른 방도가 없다",
    "connectionWays": "동사 가정법 ば\n동사 과거형",
    "examples": [
      {
        "answer": "諦めたらそれまでだ",
        "word": "とにかく人生は諦めたらそれまでだ。",
        "mean": "어쨌든 인생은 그만두면 그걸로 끝이다"
      },
      {
        "answer": "言われればそれまでだ",
        "word": "証拠もなく, 知らないと言われればそれまでだ。",
        "mean": "증거도 없고 모른다고 하면 그만이다"
      },
      {
        "answer": "しまったらそれまでだ",
        "word": "先生に見つかってしまったらそれまでだ。",
        "mean": "선생님한테 걸리면 그걸로 끝이다"
      },
      {
        "answer": "なければそれまでだ",
        "word": "力は手に入れただけでは意味がない。使いこなせなければそれまでだ。",
        "mean": "힘을 손에 얻는것 만으로 의미가 없다. 잘 구사할 수 없으면 그걸로 그만이다"
      },
      {
        "answer": "言ってしまえばそれまでだ",
        "word": "昨日の疲れが残るようになってきた。歳だと言ってしまえばそれまでだが。",
        "mean": "어제의 피고가 남게 되었다. 나이라고 말해버리면 그걸로 끝인데."
      },
      {
        "answer": "思ったらそれまでだ",
        "word": "自分でできないと思ったらそれまでだ。",
        "mean": "스스로 할 수 없다고 생각하면 그걸로 끝이다"
      },
      {
        "answer": "思ってしまったらそれまでだ",
        "word": "自分はこの程度だと思ってしまったらそれまでだ。",
        "mean": "자신은 이정도라고 생각해 버리면 그걸로 끝이다"
      },
      {
        "answer": "死んだらそれまでだ",
        "word": "人は死んだらそれまでだ。",
        "mean": "사람은 죽으면 그걸로 끝이다"
      },
      {
        "answer": "放り出してしまったらそれまでだ",
        "word": "苦しいからと言って放り出してしまったらそれまでだ。",
        "mean": "힘들다고 해서 던저 버리면 그걸로 끝이다"
      }
    ]
  },
  {
    "id": 217,
    "grammar": "べからず",
    "means": "~하지 말 것",
    "description": "する는 すべからず 로 사용되기도 한다\n\n주로 간판이나 표지 등에 표현된다",
    "connectionWays": "동사 기본형",
    "examples": [
      {"answer": "べからず", "word": "ここにゴミを捨てるべからず。", "mean": "여기에 쓰레기를 버리지 말 것"},
      {
        "answer": "べからず",
        "word": "人をいじめる行為は許すべからず。",
        "mean": "사람을 괴롭히는 행위는 용서하지 말 것"
      },
      {"answer": "べからず", "word": "働かざる者食うべからず", "mean": "일하지 않는 자는 먹지도 말 것"},
      {"answer": "べからず", "word": "初心忘るべからず", "mean": "초심을 잃지 말 것"},
      {
        "answer": "べからず",
        "word": "工事中につき, 立ち入るべからず。",
        "mean": "공사중이기 때문에 입장 하지 말 것"
      },
      {"answer": "べからず", "word": "試験中は会話するべからず。", "mean": "시험 중은 대화 하지 말 것"},
      {"answer": "すべからず", "word": "壁に落書きすべからず。", "mean": "벽에 낙서 하지 말 것"},
      {"answer": "するべからず", "word": "食べ物は粗末にするべからず。", "mean": "식사는 소홀히 하지 말 것"},
      {
        "answer": "逆らうべからず",
        "word": "健康のためには睡魔に逆らうべからず。",
        "mean": "건강을 위해서 졸음은 거스리지 말 것"
      },
      {"answer": "渡るべからず", "word": "危ない橋は渡るべからず。", "mean": "위험한 다리는 건너지 말 것"}
    ]
  },
  {
    "id": 218,
    "grammar": "べからざる",
    "means": "~해서는 안 될",
    "description":
        "する는 すべからざる로 사용되기도 한다.\n\n[許すべからざる, 欠くべからざる] 등 한정된 말투 밖에 사용하지 못함",
    "connectionWays": "동사 기본형 + べからざる + 명사",
    "examples": [
      {
        "answer": "欠くべからざる",
        "word": "現代社会では, スマホは欠くべからざる存在となっている。",
        "mean": "현대 사회는 스마트폰을 빼고는 안될 존재가 되어 있다"
      },
      {
        "answer": "許すべからざる",
        "word": "汚職は政治家として許すべからざる行為だ。",
        "mean": "비리는 정치가 로써 용서 해서는 안될 행동이다"
      },
      {
        "answer": "許すべからざる",
        "word": "いかなる理由があったとしても, 許すべからざる行為だ。",
        "mean": "어떠한 이유가 있다고 해도 용서해서는 안될 행동이다"
      },
      {
        "answer": "交わるべからざる",
        "word": "彼は少年時代, 交わるべからざる人と交わり不良と化した。",
        "mean": "그는 소년 시절 어울려서는 안될 사람과 어울려 불량배가 되었다"
      }
    ]
  },
  {
    "id": 219,
    "grammar": "べく",
    "means": "~하기 위해",
    "description": "ために 보다 강한 의지에 사용된다\n\nする는 すべく로 활용한다",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "すべく",
        "word": "食わず嫌いを克服すべく, 食材を細かく切って調理してみる。",
        "mean": "먹어 보지도 않고 싫어하는 것을 극복하기 위해 식재료를 잘게 잘라서 조리해 보겠어"
      },
      {
        "answer": "すべく",
        "word": "文章を書くのが苦手なので, それを克服すべく, 短い文から少しずつ書いてみようと思う。",
        "mean": "문장을 잘 못쓰기 때문에 극복하기 위해서 짧은 글부터 조금씩 써보려고 해"
      },
      {
        "answer": "打開すべく",
        "word": "つまらない日々を打開すべく何かを本気で始めようと思う。",
        "mean": "지루한 나날을 타개하기 위해서 무언가를 진심으로 시작해보려고 해"
      },
      {
        "answer": "寝るべく",
        "word": "ぐっすり寝るべく, 早めにベッドに入った。",
        "mean": "푹 자기 위해서 빠르게 침대에 누웠다"
      },
      {
        "answer": "なるべく",
        "word": "社長になるべく, 資金と人材の確保に尽力している。",
        "mean": "사장이 되기 위해서 자금과 인재의 확보를 힘쓰고 있다"
      },
      {
        "answer": "試合で勝つべく, 毎日の練習を怠らない。",
        "word": "시합에서 이기기 위해서 매일의 연습을 게을리 하지 않다"
      },
      {
        "answer": "防止すべく",
        "word": "不慮の事故を防止すべく, 設備の安全に留意する。",
        "mean": "뜻밖의 사건을 방지 하기 위해서 설비의 안전에 유의한다"
      },
      {
        "answer": "出すべく",
        "word": "全力を出すべく, ご飯をたらふく食べた。",
        "mean": "전력으로 다하려고 밥을 배불리 먹었다"
      }
    ]
  },
  {
    "id": 220,
    "grammar": "まじき",
    "means": "~해서는 안 될",
    "description":
        "직업, 직위, 입장을 나타내는 명사에 접속해 그 지위에 상응하지 않는 정도, 태도, 행위를 비난 하는 문법\n\n뒷 문장에는 언동이나 발언, 행위, 행동, 태도 등이 접속된다.",
    "connectionWays":
        "명사 + としてあるまじき + 명사\n명사 + にあるまじき + 명사\n명사 + として許すまじき + 명사",
    "examples": [
      {
        "answer": "してあるまじき",
        "word": "あの反則はプロとしてあるまじき行為だ。",
        "mean": "저 반칙은 프로로써 있을 수 없는 행동이야"
      },
      {"answer": "それは政治家としてあるまじき発言だった。", "word": "그건 정치가로써 있어서는 안될 발언이었다"},
      {
        "answer": "薬品の個人的使用 / 売買は医者としてあるまじき行動だ。",
        "word": "약품은 개인적 사용 , 판매는 의사로써 있어서는 안될 행동이다"
      },
      {"answer": "教師としてあるまじき言動", "word": "교사로써 있어서는 안될 말과 행동"},
      {
        "answer": "許すまじき",
        "word": "子どもを長時間車に放置して死なせるとは, 親として許すまじき行為だ。",
        "mean": "아이를 장시간 차에 방치해 죽게하다니, 부모로써 용서해서는 안될 행동이다"
      },
      {
        "answer": "として許すまじき",
        "word": "捏造報道は報道機関として許すまじき行為である。",
        "mean": "날조보도는 정보기관으로써 용서해서는 안될 행동이다"
      },
      {
        "answer": "にあるまじき",
        "word": "今日のは北海道にあるまじき最高気温だった。",
        "mean": "오늘은 훗카이도에 있어서는 안될 최고 기온 이였다"
      }
    ]
  },
  {
    "id": 221,
    "grammar": "~사전형 + まで(のこと)だ",
    "means": "~하면 된다,~할 뿐이다, ",
    "description": "다른 방법이 없으니까 최선의 방법으로써 다른 방법을 한다는 화자의 각오나 결의를 표현",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "頑張るまでだ",
        "word": "今回の試験で合格できなかったら, また一年頑張るまでだ。",
        "mean": "이번 시험에서 합격 못하면 다시 일년동안 열심히 하면 된다"
      },
      {
        "answer": "までだ",
        "word": "もし今月も家賃を払ってくれなければ, 裁判所に訴えるまでだ。",
        "mean": "가령 이번 달도 집세를 못받으면 재판소에 소송하면 된다"
      },
      {
        "answer": "までのことだ",
        "word": "誰も一緒にやってくれないなら, 一人で最初から最後までやり切るまでのことだ。",
        "mean": "누구도 함께 해 주지 않는다면 혼자서 처음부터 끝까지 다 하면 된다"
      }
    ]
  },
  {
    "id": 222,
    "grammar": "~과거형 + まで(のこと)だ",
    "means": "~했을 뿐이다",
    "description": "다른 뜻은 없고 오직 이 이유 때문에~한 것이다",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "したまで",
        "word": "どうして怒られるのかわからないよ。先生に言われた通りにしたまでなのに。",
        "mean": "왜 혼났는지 모르겠어, 선생님한테 들은 대로 했을 뿐인데"
      },
      {
        "answer": "したまでのことだ",
        "word": "A:何であんなことしたの？　B:この前部長に言われたことしたまでのことだよ。",
        "mean": "A:왜 그런 짓을 했어 ? B: 전 부장님께 들은 대로 했을 뿐이야"
      },
      {
        "answer": "答えたまでのことで",
        "word": "聞かれたから答えたまでのことで, 自分から話したわけじゃない。",
        "mean": "물어봐서 답한것 뿐인으로 내가 말한 것이 아니야"
      },
      {
        "answer": "したまでです",
        "word": "私は当然のことをしたまでです",
        "mean": "저는 당연한 것을 했을 뿐입니다"
      },
      {
        "answer": "したまでです",
        "word": "人としてするべきことをしたまでです",
        "mean": "사람으로 써 해야할 일을 했을 뿐입니다"
      }
    ]
  },
  {
    "id": 223,
    "grammar": "までもない / までもなく",
    "means": "~까지도 아니다,~할 필요도 없다 /~할 필요도 없이",
    "description": "당연한 것이거나 중요도가 낮은 이유로 [ 일부로~할 필요는 없다 ] 를 표현하는 의미",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "までもない",
        "word": "ここから家まであと少しなので, 傘を差すまでもない。",
        "mean": "여기부터 집까지 금방이니까 우산을 쓸 필요도 없다"
      },
      {
        "answer": "使うまでもない",
        "word": "簡単な計算なら計算機を使うまでもない。",
        "mean": "간단한 계산이라면 계산기를 쓸 필요도 없다"
      },
      {
        "answer": "するまでもありません",
        "word": "初期段階ですから, 手術をするまでもありません。",
        "mean": "초기단계이니까, 수술을 할 필요 없습니다"
      },
      {
        "answer": "言うまでもないことですが",
        "word": "言うまでもないことですが, 道にゴミを捨てないでください。",
        "mean": "말할 필요도 없는 것 인데요 길에 쓰레기를 버리지 말아주세요"
      },
      {
        "answer": "までもないだろう",
        "word": "この程度なら医者に診てもらうまでもないだろう。",
        "mean": "그정도라면 의사에게 진단 받을 필요도 없겠지"
      },
      {
        "answer": "説明するまでもないでしょう",
        "word": "これについては既にご存知のはずでしょうから, 説明するまでもないでしょう。",
        "mean": "이것에 대해서는 이미 알고 계실 테니 설명할 필요도 없을 것입니다."
      },
      {
        "answer": "までもなく",
        "word": "もらったケーキは保存するまでもなく, 今日中に全部食べてしまうつもりだ。",
        "mean": "받은 케이크를 보관 할 필요도 없이 지금 먹어 치울 생각이다"
      },
      {
        "answer": "までもない",
        "word": "一人の命と大勢の命, 比べるまでもないだろう。",
        "mean": "한 사람의 목숨과 수많은 생명, 비교할 필요도 없을 것이다."
      },
      {
        "answer": "言うまでもない",
        "word": "社会の高齢化が避けられないことは言うまでもない。",
        "mean": "사회의 고령화 피할 수 없는 것은 말할 필요도 없다"
      },
      {
        "answer": "論ずるまでもない",
        "word": "なぜ差別はいけないか。それは論ずるまでもない。",
        "mean": "왜 차별은 안 되는가.그것은 논할 필요도 없다."
      }
    ]
  },
  {
    "id": 224,
    "grammar": "まみれ",
    "means": "~범벅, ~투성이",
    "description":
        "표면에 더러운 부착물이 잔뜩 묻어 있다는 것을 표현\n\n원칙, 먼지, 피, 땀, 진흙, 기름, 모래, 쓰레기, 상처 등 화자가 더러움, 불쾌함을 느끼는 것에만 접속함",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "ほこりまみれ",
        "word": "タンスから昔の洋服を出したら, ほこりまみれだった。",
        "mean": "옷장에서 옛날 옷을 꺼내니 먼지투성이였다"
      },
      {"answer": "血まみれ", "word": "手を切り血まみれになった。", "mean": "손을 베어 피 범벅이 되었다"},
      {
        "answer": "泥まみれ",
        "word": "子供が泥まみれになって帰ってきた。",
        "mean": "아이가 진흙 투성이가 되어 돌아 왔다."
      },
      {
        "answer": "血まみれ",
        "word": "ニュースによると, 殺人事件が発生したマンションの一室は血まみれだったらしい。",
        "mean": "뉴스에 의하면 살인 사건가 발생한 맨션의 방은 피 투성이라고 한다"
      },
      {
        "answer": "借金まみれ",
        "word": "借金まみれの生活から脱したい。",
        "mean": "빛 투성이의 생활부터 벗어나고 싶다"
      },
      {
        "answer": "まみれ",
        "word": "正論まみれの世間に嫌気が差す。",
        "mean": "정론투성이의 세상에 싫증이 나다."
      },
      {
        "answer": "不祥事まみれ",
        "word": "表面的には優良企業だが, その実態は不祥事まみれだ。",
        "mean": "표면적으로 우량기업이지만 그 실태는 불상사 투성이다"
      },
      {"answer": "人間は欲まみれである。", "word": "인간은 욕심 투성이다"},
      {
        "answer": "広告まみれ",
        "word": "このサイトは広告まみれで見にくいといったらありゃしない。",
        "mean": "이 사이트는 광고 투성이라 너무 보기 힘들다"
      },
      {
        "answer": "よだれまみれ",
        "word": "毎朝起きると枕がよだれまみれだ。",
        "mean": "매일 아침 일어나면 배게가 침 범벅이다"
      },
      {
        "answer": "ウンコにまみれ",
        "word": "言い訳するアホはウンコにまみれで死ねばいい。",
        "mean": "변명하는 바보는 똥 범벅에 죽어도 싸다"
      }
    ]
  },
  {
    "id": 225,
    "grammar": "めく",
    "means": "~한 느낌이 들다",
    "description": "春, 謎, 冗談, 皮肉, 説教 (설교, 잔소리) 등 특정 단어와만 접속한다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {"answer": "春めいてきた", "word": "季節はようやく春めいてきた。", "mean": "계절은 겨우 봄 다워 졌다"},
      {
        "answer": "謎めいた",
        "word": "彼はどこか謎めいた雰囲気があり女性に人気がある。",
        "mean": "그는 어딘가 아리송한 분위기가 있어, 여성에게 인기가 있다"
      },
      {
        "answer": "説教めいた",
        "word": "先輩から説教めいたことを言われた。",
        "mean": "선배에게 설교인 듯한 이야기를 들었다"
      },
      {
        "answer": "皮肉めいた",
        "word": "彼の妙に皮肉めいた言い方に腹が立つ。",
        "mean": "그의 묘하게 빈정대는 말투에 화가 난다"
      },
      {
        "answer": "冗談めいた",
        "word": "冗談めいた言葉を言われて雰囲気が台無しになった。",
        "mean": "농담 같은 말을 듣고 분위기가 엉망이 됬다"
      },
      {
        "answer": "夏めいてきました",
        "word": "風鈴に蚊取り線香, 部屋がすっかり夏めいてきました。",
        "mean": "풍경에 모기향, 방에 완전히 여름다워 졌습니다"
      },
      {
        "answer": "地獄めいている",
        "word": "トイレはクーラーがないから暑くて地獄めいている。",
        "mean": "화장실은 에어컨이 없어서 더워서 지옥인듯한 느낌이 든다"
      },
      {
        "answer": "狂気めいている",
        "word": "ゲームのプレイ時間3000時間。狂気めいている。",
        "mean": "게임 플레이 시간 3000시간.광기가 넘치다."
      }
    ]
  },
  {
    "id": 226,
    "grammar": "もさることながら",
    "means": "~은 물론이고",
    "description":
        "[~도 중요하지만~은 더 중요하다 ] 라는 의미\n\n앞 문장에는 명백한 예시를 들고, 뒷 문장에는 앞 문장보다 중요한 것을 말함.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "美しさもさることながら",
        "word": "その顔の美しさもさることながら, 何より声が素敵",
        "mean": "그 얼굴의 아름다움은 물로이고 무엇보다 목소리가 멋지다"
      },
      {
        "answer": "ストーリーもさることながら",
        "word": "このアニメはストーリーもさることながら, 世界観やキャラ設定もよく作られている。",
        "mean": "이 애니메이션은 이야기는 물론이고 세계관이나 캐릭터 설정도 잘 만들어져있다"
      },
      {
        "answer": "体もさることながら",
        "word": "筋肉質な体もさることながら, その体以上に心も男らしい。",
        "mean": "근육질인 몸도 물론이고 그 몸 이상으로 마음도 남자답다"
      },
      {
        "answer": "外観もさることながら",
        "word": "このカフェは外観もさることながら, 店内も和を感じさせる作りになっている。",
        "mean": "이 카페는 외관도 물론이고 가게 안도 조화롭게 꾸며져 있다"
      },
      {
        "answer": "そのボリュームもさることながら",
        "word": "ここの料理はそのボリュームもさることながら, 視覚的な満足感もすごい。",
        "mean": "여기 음식은 그 크기은 물론이고 시각적인 만족감도 굉장해"
      },
      {
        "answer": "性格もさることながら",
        "word": "私の好きなアイドルは性格もさることながら, ファンサービスも嫌な顔一つせずにしてくれる。",
        "mean": "내가 좋아하는 아이돌은 성격은 물론이고 팬 서비스도 싫은 표정 하나 않고 해준다"
      },
      {
        "answer": "知名度もさることながら",
        "word": "このゲームはその知名度もさることながら, 年１回大会も開催されている。",
        "mean": "이 게임은 그 지명도은 물론이고 매년 1회 대회도 개최되고 있다"
      },
      {
        "answer": "抜け毛もさることながら",
        "word": "私, 抜け毛もさることながら, １人目を産んでから白髪が酷い。",
        "mean": "나 탈모는 물론이고 한명을 낳고부터 흰머리가 심해"
      },
      {
        "answer": "経験もさることながら",
        "word": "中途採用は経験もさることながら, 一番重要視しているのは[ 人柄 ]です。",
        "mean": "중도 채용은 경험은 물론이고 가장 중요시 되고 있는 것은 \"인품\" 입니다"
      },
      {
        "answer": "日中もさることながら",
        "word": "最近は日中もさることながら, 夜も暑さで寝苦しくなりました。",
        "mean": "최근 낮은 물론이고 밤도 더워서 자기 힘들어졌습니다"
      },
      {
        "answer": "才能もさることながら",
        "word": "元々の才能もさることながら努力も怠らないし, 彼女は本当にすごい子だ。",
        "mean": "원래의 재능은 물론이고 노력도 게을리하지 않고 그녀는 정말 굉장한 아이야"
      },
      {
        "answer": "美貌もさることながら",
        "word": "美貌もさることながらスポーツもできるなんて。彼女にあって私に無いものがありすぎる。",
        "mean": "미모는 물론이고 스포츠도 가능하다니. 그녀에게 있어서 나에게는 없는 것들이 너무 많아."
      },
      {
        "answer": "お洋服もさることながら",
        "word": "お洋服もさることながら, モデルさんも素敵だ。",
        "mean": "양복도 물론이고 모델도 멋지다"
      }
    ]
  },
  {
    "id": 227,
    "grammar": "ものを",
    "means": "~텐데,~것을",
    "description":
        "이미 발생한 것에 대해 \"그때 그렇게 헀으면 좋았을텐데.\" 라는 가설이나 가능성을 표현한다\n\n불만, 후회, 유감등의 뉘양스를 갖고있다\n\nのに 와 바꿔 쓸 수 있는데 좀 더 딱딱한 표현\n\n가정법과 사용될 경우~ばいいものを,~たらいいものを 의 형태로 자주 사용된다",
    "connectionWays": "보통형",
    "examples": [
      {
        "answer": "行けばいいものを",
        "word": "車で行けばいいものを, 歩いて行くからそんなことになるんだ。",
        "mean": "자동차로 갔으면 좋았을 것을, 걸어가니까 그런거야"
      },
      {
        "answer": "治るものを",
        "word": "薬を飲めばすぐ治るものを, 意地張って飲まないから悪化したんだ。",
        "mean": "약을 먹었으면 금방 나았을텐데, 고집 부려 안먹어서 악화된 거야"
      },
      {
        "answer": "助けに行ったものを",
        "word": "教えてくれたら, すぐ, 助けに行ったものを。",
        "mean": "알려 줬으면 바로 도와주러 갔을텐데"
      },
      {
        "answer": "ばいいものを",
        "word": "連絡してくれればいいものを, 一人でやるなんて大変だったろうに。",
        "mean": "연락 해줬으면 좋았을걸, 혼자 했다니 힘었겠는걸"
      },
      {
        "answer": "片付いたものを",
        "word": "手を貸してもらえば, すぐ, 片付いたものを。",
        "mean": "도와줬으면 금방 끝났을 걸"
      },
      {
        "answer": "寝ればいいものを",
        "word": "眠くなったら寝ればいいものを, 彼女は[ 寝たら休みが終わっちゃう ]と言って無理やり起きている。",
        "mean": "졸리면 자면 되는 것을 그녀는 \"자면 방학이 끝나버려\" 라고 말하며 무리하게 깨어있다"
      },
      {
        "answer": "死ねばいいものを",
        "word": "一人で死ねばいいものを, 犯人は近くの通行人まで犠牲にして自殺した。",
        "mean": "혼자 죽으면 좋을텐데, 범인은 근처 통행자까지 희생해 자살했다"
      },
      {
        "answer": "寝たらいいもの",
        "word": "明日に備えて, 早く寝たらいいものを。",
        "mean": "내일을 대비해 빨리 자면 좋았을 걸"
      }
    ]
  },
  {
    "id": 228,
    "grammar": "ゆえに",
    "means": "~때문에",
    "description": "い형용사, 동사 뒤에는 がゆえに 형태로 접속하기도 한다",
    "connectionWays": "보통형",
    "examples": [
      {
        "answer": "故だ",
        "word": "自分がモテないのは自分の容姿の悪さ故だ。",
        "mean": "자신이 인기 없는 것은 자신의 외모가 못났기 때문이다"
      },
      {
        "answer": "故だ",
        "word": "彼はよくからかわれているが, それも彼の人柄故だ。",
        "mean": "그에게 자주 놀림 받고 있지만, 그것도 그의 인성 문제다"
      },
      {"answer": "故に", "word": "我思う, 故に我在り", "mean": "나는 생각한다, 고로 존재한다"},
      {
        "answer": "ゆえに",
        "word": "電子レンジは食材を入れて, チンするだけというその手軽さゆえに多くの家庭で重宝されている。",
        "mean": "전자레인지는 재료를 넣고 돌리기만 하면 되는 간편함 때문에 많은 가정에서 편리하다."
      },
      {
        "answer": "故の",
        "word": "未成年も法で裁かれるべきだ。若さ故の過ちにも罰を与えなければならない。",
        "mean": "미성년자도 법으로 심판받아야 한다.젊음으로 인한 잘못에도 벌을 주어야 한다."
      },
      {
        "answer": "故の",
        "word": "叱るという行為は相手を思う故の行為だ。",
        "mean": "꾸짖는 행위는 상대방을 생각하기 때문이다."
      },
      {
        "answer": "故に",
        "word": "この部署は専門性が高すぎるが故に人員補充が難しい。",
        "mean": "이 부서는 전문성이 너무 높아 인력 충원이 어렵다."
      },
      {
        "answer": "故に",
        "word": "貧しさ故に犯した罪は多少同情に値するが, 決して許される行為ではないことには間違いない。",
        "mean": "가난 때문에 저지른 죄는 다소 동정할 만하지만 결코 용서받을 수 있는 행위가 아님에는 틀림없다."
      }
    ]
  },
  {
    "id": 229,
    "grammar": "~をおいて~他にない",
    "means": "제외하고는~없다, 을 두고 달리 없다 ,~밖에 없다",
    "description": "이것 말고는 없다고 높게 평가하거나, 강조하는 표현.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "をおいて",
        "word": "この仕事は彼をおいて他に任せられる人がいない。",
        "mean": "이 일은 그를 두고 달리 맞길 수 있는 사람이 없다"
      },
      {
        "answer": "をおいて",
        "word": "その分野を学びたいなら, この大学をおいて他にはない。",
        "mean": "그 분야를 배우고 싶다면, 그 대학 밖에 없다"
      },
      {
        "answer": "をおいて",
        "word": "僕の学生時代を表すには, 彼女との恋をおいて他にない。",
        "mean": "내 학생 시대를 표현하려면 그녀와의 사랑 밖에 없다"
      },
      {
        "answer": "をおいて",
        "word": "人を育てるもの, それは教育をおいて他にない。",
        "mean": "사람을 성장시키는 것, 그것은 교육 밖에 없다"
      },
      {
        "answer": "をおいて他にいない",
        "word": "この問題を解決できるのは私をおいて他にいないはずだ。",
        "mean": "그 문제가 가능한 것은 나를 밖에 없을 것이다"
      },
      {
        "answer": "をおいて",
        "word": "未来を創造する者は, 君たちをおいて他にいないのです。",
        "mean": "미래를 창조하는 자는 자네 밖에 없습니다"
      },
      {
        "answer": "をおいて他にいない",
        "word": "アニメについて語らせるなら, 彼をおいて他にいない。",
        "mean": "애니메이션에 대해서 말하게 한다면 그를 두로 달리 없다"
      },
      {"answer": "をおいて", "word": "攻め時は今をおいてほかにない。", "mean": "공격할 시간은 지금 밖에 없다"}
    ]
  },
  {
    "id": 230,
    "grammar": "を禁じえない",
    "means": "~을 금할 수가 없다",
    "description":
        "감정에 관한 명사에 접속, 그 감정이 마음으로부터 끓어 올라와서 억누를 수 없는 상태를 표현한다.\n\n驚き, 怒り, 恐怖, 同情, 疑問, 違和感, 涙, 畏怖の念, 焦燥, 戦慄, 笑い, 興奮, 悲しみ, 戸惑い 등",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "驚きを禁じ得ない",
        "word": "まさかの結果に驚きを禁じ得ない。",
        "mean": "설마의 결과에 놀라움을 금할 수 없다"
      },
      {
        "answer": "涙を禁じ得ない",
        "word": "この映画のラストシーンは涙を禁じ得ない。",
        "mean": "그 영화의 마지막 장면은 눈물을 금할 수 없다"
      },
      {
        "answer": "笑いを禁じ得ない",
        "word": "笑ってる場合ではないが, どうにも笑いを禁じ得ない。",
        "mean": "웃고 있을 상황은 아니지만 어떻게 해도 웃지 않을 수 없어"
      },
      {
        "answer": "絶望を禁じ得ない",
        "word": "この社会に絶望を禁じ得ない。",
        "mean": "이 사회에 절망을 금할 수 없다"
      },
      {
        "answer": "嫌悪感を禁じえない",
        "word": "あの人の食べ方は汚くて生理的な嫌悪感を禁じえない。",
        "mean": "저 사람의 식사 방법은 더러워 생리적인 혐오감을 금할 수 없다"
      },
      {
        "answer": "怒りを禁じえない",
        "word": "怒られてもへらへらしている様子に怒りを禁じえない。",
        "mean": "혼나고도 능글능글한 모습에 분노를 금할 수 없다."
      },
      {
        "answer": "驚きを禁じ得ない",
        "word": "こんな人が国会議員であることに驚きを禁じ得ない。",
        "mean": "저런 사람이 국회의원 이란 것에 놀라움을 금할 수 없어"
      },
      {
        "answer": "喜びを禁じ得ない",
        "word": "完全勝利に喜びを禁じ得ない。",
        "mean": "완전 승리에 기쁨을 금할 수 없다"
      },
      {
        "answer": "同情を禁じえない",
        "word": "薄給で働かされる彼らに同情を禁じえない。",
        "mean": "박봉으로 일하고 있는 그에게 동정을 금할 수 없다"
      },
      {
        "answer": "恐怖を禁じえない",
        "word": "この不吉な兆しに恐怖を禁じえない。",
        "mean": "이 불길한 징조에 공포를 금할 수 없다"
      }
    ]
  }
];
List<Map<String, dynamic>> json_grammars_n2 = //
    [
  {
    "id": 1,
    "grammar": "挙句(あげく) / 挙句に / 挙句の果てに",
    "means": "~한 끝에",
    "description":
        "오래 지속된 어떤 상태가 좋지 않은 결말을 맞이하는 것을 나타낸다.\n\n억울함이나 번거로움 등의 부정적인 감정을 포함해 [ 散々, 結局 ] 등으로 호응하기도 함.\n\n[ 挙句に / 挙句の果てに ]의 [ に ]는 생략 가능하다.\n\n~末に와 비슷한 표현으로, ~すえに는 긍정적인 결과, 부정적인 결과 모두 가능하지만, ~あげく는 부정적인 결과가 오는 경우가 많다.\n\n[ 挙句 ]와 [ 挙句の果てに ]는 접속사로 도 사용 가능.",
    "examples": [
      {
        "answer": "たあげく",
        "word": "寝坊して電車に乗り遅れたあげく, 仕事にまで間に合わなかった。",
        "mean": "늦잠을 자서 전철을 놓친 끝에 일까지 늦었다."
      },
      {
        "answer": "あげく",
        "word": "私の友人は不倫をした。あげく子供を捨てて離婚してしまった。",
        "mean": "내 친구는 불륜을 했다.결국 아이를 버리고 이혼하고 말았다."
      },
      {
        "answer": "たあげく",
        "word": "ずっと待ったあげく, 結局彼は来なかった。",
        "mean": "계속 기다린 끝에 결국 그는 오지 않았다."
      },
      {
        "answer": "挙句の果てに",
        "word": "体調不良が続いたので病院で何時間も精密検査したのだが, 挙句の果てには[ 原因が分かりません ]と言われてしまった。",
        "mean": "몸살이 계속되자 병원에서 몇 시간 동안 정밀 검사를 했지만 급기야 원인을 알 수 없다는 말을 듣고 말았다."
      },
      {
        "answer": "た挙句",
        "word": "山で遭難した時は注意が必要だ。むやみやたらに長時間歩いた挙句, 結局最初と同じ場所に戻ってしまうことがある。",
        "mean": "산에서 조난당했을 때는 주의가 필요하다.무작정 장시간 걷다가 결국 처음과 같은 장소로 돌아가 버릴 수 있다."
      },
      {
        "answer": "挙句",
        "word": "一目惚れしたネックレス, 迷った挙句買わなかったことを後悔してる。",
        "mean": "첫눈에 반한 목걸이, 망설이다가 사지 않은 것을 후회하고 있어."
      },
      {
        "answer": "たあげく",
        "word": "画面と睨めっこしながら迷いに迷ったあげくポチった。",
        "mean": "화면과 눈싸움을 하면서 망설임에 헤맨 끝에 잡았다."
      },
      {
        "answer": "たあげく",
        "word": "何食べるか迷ったあげく牛丼にしたのが大正解だった。",
        "mean": "무엇을 먹을지 망설이다 쇠고기 덮밥으로 만든 것이 정답이었다."
      }
    ]
  },
  {
    "id": 2,
    "grammar": "あまり",
    "means": "~한 나머지, 너무~해서",
    "description": "감정, 감각, 상태를 나타내는 명사나 동사에 접속하여 그 정도가 극단적으로 심하다는 것을 나타낸다",
    "examples": [
      {
        "answer": "あまり",
        "word": "激務のあまり, 疲れて仕事が捗らない。",
        "mean": "격무한 나머지 피곤해서 일이 진척되지 않는다."
      },
      {
        "answer": "あまり",
        "word": "高さのあまり足がすくむ。",
        "mean": "높이가 너무 높은 나머지 발이 움츠러들다."
      },
      {
        "answer": "あまり",
        "word": "美しさのあまり, 彼女ばかりに目が行ってしまう。",
        "mean": "너무 아름다워서 그녀에게만 눈길이 가버린다."
      },
      {
        "answer": "あまり",
        "word": "痛みのあまり気を失ってしまった。",
        "mean": "아픈 나머지 정신을 잃고 말았다."
      },
      {
        "answer": "あまり",
        "word": "このゲームは戦略性を追求するあまり, 操作が複雑になっている。",
        "mean": "이 게임은 전략성을 추구한 나머지 조작이 복잡해졌다."
      },
      {
        "answer": "あまり",
        "word": "恐怖のあまり冷静に物事を考えられなくなっている。",
        "mean": "공포에 질린 나머지 냉정하게 생각할 수 없게 되었다."
      },
      {
        "answer": "あまり",
        "word": "眩しさのあまり彼女を直視できない。",
        "mean": "눈이 부신 나머지 그녀를 직시할 수 없다."
      },
      {"answer": "あまり", "word": "動揺のあまり手が震える。", "mean": "동요한 나머지 손이 떨리다."}
    ]
  },
  {
    "id": 3,
    "grammar": "以上(は) ",
    "means": "~한 이상(에는) ",
    "description":
        "화자의 강한 의지나 의무감, 결의를 나타내는 문법.\n\n앞 문장에는 에서는 이미 발생한 사건을 말하고, 그 상황 하에서 해야 할 일을 뒤 문장에서 서술함.",
    "connectionWays":
        "명사＋である以上(は)\n동사 사전형＋以上(は)\nい형용사 보통형＋以上(は)\nな형용사 보통형＋である / な＋以上(は)",
    "examples": [
      {
        "answer": "な以上",
        "word": "本当に好きな以上は仕方ない。",
        "mean": "정말 좋아하는 이상은 어쩔 수 없어."
      },
      {
        "answer": "以上は",
        "word": "給料を貰ってる以上は一生懸命やるのみ。",
        "mean": "월급 받는 이상은 열심히 할 뿐이야."
      },
      {
        "answer": "以上",
        "word": "選ばれた以上, 文句も言っていられない。",
        "mean": "뽑힌 이상 불평할 수 없다."
      },
      {
        "answer": "以上",
        "word": "結局人類が人類である以上差別からは逃れられない。",
        "mean": "결국 인류가 인류인 이상 차별에서 벗어날 수 없다."
      },
      {
        "answer": "以上",
        "word": "ＦＷである以上, まずはゴールを意識しないとダメ。",
        "mean": "공격수인 이상 우선 골을 의식해야 한다."
      },
      {
        "answer": "以上は",
        "word": "試験勉強は一切してないが, 会場に来た以上は全力を出そうと思う。",
        "mean": "시험공부는 일절 하지 않았지만, 회장에 온 이상은 전력을 다하려고 한다."
      },
      {
        "answer": "以上は",
        "word": "証拠が無い以上は無罪だと考えるべきだ。",
        "mean": "증거가 없는 이상 무죄라고 봐야 한다."
      },
      {
        "answer": "以上は",
        "word": "タイムマシンが無い以上は, 歴史の教科書に書かれている憶測が正しいか確認できない。",
        "mean": "타임머신이 없는 이상은 역사교과서에 적혀 있는 억측이 맞는지 확인할 수 없다."
      },
      {
        "answer": "以上は",
        "word": "この仕事を引き受けた以上は責任をもってやり遂げる。",
        "mean": "이 일을 맡은 이상은 책임지고 해내다."
      }
    ]
  },
  {
    "id": 4,
    "grammar": "一方だ",
    "means": "~하기만 한다, ~할 뿐이다",
    "description":
        "무언가가 한 방향으로 계속적으로 변화하고 있음을 나타낸다.\n\n좋은 일에도 나쁜 일에도 사용할 수 있지만 나쁜 일에 사용하는 편이 많다.",
    "connectionWays": "동사 사전형\n명사 + の",
    "examples": [
      {
        "answer": "一方だ",
        "word": "トレーニングしないと運動能力は落ちていく一方だ。",
        "mean": "훈련하지 않으면 운동 능력은 떨어질 뿐이다."
      },
      {
        "answer": "一方だ",
        "word": "関税収入減と共に, 政府の税収は減る一方だ。",
        "mean": "관세 수입 감소와 함께 정부 세수는 줄어들기만 한다."
      },
      {
        "answer": "一方だ",
        "word": "マジで何かしないと太る一方だ。",
        "mean": "진짜 뭐 안 하면 살 찌기만 해."
      },
      {
        "answer": "一方だ",
        "word": "彼女ほど純粋な存在はない。どんどん好きになっていく一方だ。",
        "mean": "그녀만큼 순수한 존재는 없다.점점 좋아지기만 한다."
      },
      {
        "answer": "一方だ",
        "word": "大抵の場合は逃げればその分リスクは大きくなる一方だということを理解しておかなければならない。",
        "mean": "대개 도망치면 그만큼 위험이 커질 수밖에 없다는 것을 알아야 한다."
      },
      {"answer": "一方だ", "word": "このままでは衰退の一方だ。", "mean": "이대로라면 쇠퇴하기만 할 것이다."}
    ]
  },
  {
    "id": 5,
    "grammar": "一方で",
    "means": "1. ~하는 한편\n2. ~하면서",
    "description": "1. 대비 : A는~, 반면에 B는~\n2. 병렬 : A하면서 B를 한다",
    "connectionWays":
        "동사 사전형＋一方(で)\nい형용사 보통형＋一方(で)\nな형용사 어간＋な / である＋一方(で)\n명사＋である＋一方(で)",
    "examples": [
      {
        "answer": "一方で",
        "word": "人口減少が加速する一方で, 東京への人口と富の一極集中が進んでいます。",
        "mean": "인구 감소가 가속화되는 한편, 도쿄로의 인구와 부의 일극 집중이 진행되고 있습니다."
      },
      {
        "answer": "一方で",
        "word": "断られると残念な一方でちょっと嬉しかったりもする。",
        "mean": "거절당하면 안타까운 한편으로 좀 기쁘기도 하다."
      },
      {
        "answer": "一方で",
        "word": "喜びの声が上がる一方で嘆きの声もあった。",
        "mean": "기쁨의 목소리가 높아지는가 하면 탄식의 소리도 있었다."
      },
      {
        "answer": "一方で",
        "word": "大学院生である一方で, 実業家でもある。",
        "mean": "대학원생이면서 기업인이기도 하다."
      },
      {
        "answer": "一方",
        "word": "富裕層はますますお金持ちになる一方, 貧困者は増え続けている。",
        "mean": "부유층은 점점 부자가 되는 반면 빈곤자는 계속 늘고 있다."
      },
      {
        "answer": "一方で",
        "word": "田舎に住みたい人もいる一方で, 大きな都市に住みたい人もいる。",
        "mean": "시골에 살고 싶은 사람도 있는 반면 큰 도시에 살고 싶은 사람도 있다."
      },
      {
        "answer": "一方で",
        "word": "田舎に住みたい人もいるが, 一方で大きな都市に住みたい人もいる。",
        "mean": "시골에 살고 싶은 사람도 있지만, 한편으로는 큰 도시에 살고 싶은 사람도 있다."
      },
      {
        "answer": "一方では",
        "word": "一方ではやり直したい気持ちが, 他方では逃げたい気持ちがあって, 自分でもどっちが本音か分からない。",
        "mean":
            "한편으로는 다시 시작하고 싶은 마음이, 다른 한편으로는 도망치고 싶은 마음이 있어서, 스스로도 어느 쪽이 진심인지 모른다"
      }
    ]
  },
  {
    "id": 6,
    "grammar": "~(た)上で",
    "means": "~한 후에",
    "description": "앞 문장이 완전히 끝나지 않으면 뒷 문장으로 넘어가지 않을 것임을 강조하는 듯한 뉘앙스를 가짐.",
    "connectionWays": "동사 과거형\n명사の",
    "examples": [
      {
        "answer": "た上で",
        "word": "両親と相談した上で, Ａ大学への進学を決めた。",
        "mean": "부모님과 상의한 후, A 대학에의 진학을 결정했다."
      },
      {
        "answer": "した上で",
        "word": "どこが悪いのかしっかり理解した上で謝ってください。",
        "mean": "어디가 나쁜지 잘 이해한 후 사과하세요."
      },
      {"answer": "の上だ", "word": "死ぬことは覚悟の上だ。", "mean": "죽는 것은 각오한 바이다."},
      {
        "answer": "の上",
        "word": "内容をご確認の上, 三日以内にご返信ください。",
        "mean": "내용 확인 후 3일 이내에 회신 부탁드립니다."
      },
      {
        "answer": "た上で",
        "word": "身長とか年収とか, 諸々のことを加味した上で今の彼に決めた。",
        "mean": "키라든가 연수입이라든가, 여러가지를 가미한 후에 지금의 그로 결정했다."
      },
      {
        "answer": "した上で",
        "word": "現状を正確に把握した上で目標を設定することが大事だ。",
        "mean": "현재 상황을 정확히 파악한 후 목표를 설정하는 것이 중요하다."
      },
      {
        "answer": "の上",
        "word": "使用の際はその危険性をしっかりとご理解の上, 自己責任でお願いします。",
        "mean": "사용 시 그 위험성을 잘 이해하시고 자기 책임 하십시요."
      },
      {
        "answer": "た上で",
        "word": "大きな成功は基盤をしっかり整えた上で, 誰もやったことがないことにチャレンジするから手に入れられる。",
        "mean": "큰 성공은 기반을 다지고 아무도 해보지 못한 일에 도전하기 때문에 얻을 수 있다."
      },
      {"answer": "た上で", "word": "酔った上での犯行。", "mean": "취한 다음의 범행"},
      {
        "answer": "た上で",
        "word": "ご理解頂けた上でお声かけ頂けますと幸いです。",
        "mean": "이해하시고 말씀해주시면 감사하겠습니다."
      }
    ]
  },
  {
    "id": 7,
    "grammar": "동사 기본형 + 上で",
    "means": "~하는데 있어서",
    "description":
        "어떤 일을 할 때 생기는 문제에 대해서 말하는 문법.\n\n뒷 내용에서는 어떠한 문제가 생기는 것, 혹은 그 문제에 대한 대응 등이 기술된다.",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "上で",
        "word": "中古車を買う上で注意しなければならないことは何ですか。",
        "mean": "중고차를 살 때 주의해야 할 것은 무엇입니까?"
      },
      {
        "answer": "上で",
        "word": "企画を実施する上で, これは重要だ。",
        "mean": "기획을 실시하는 데 있어 이것은 중요하다."
      },
      {
        "answer": "上で",
        "word": "西洋文化を理解する上で, キリスト教文化は欠かせない。",
        "mean": "서양 문화를 이해하는 데 기독교 문화는 필수다."
      },
      {
        "answer": "上で",
        "word": "あの人は計画を遂行する上でどうしても必要な存在だ。",
        "mean": "저 사람은 계획을 수행하는 데 꼭 필요한 존재야."
      },
      {
        "answer": "上で",
        "word": "成功する上で最も大切なのは己と成功者との距離だ。",
        "mean": "성공하는 데 가장 중요한 것은 자신과 성공자 사이의 거리다."
      },
      {
        "answer": "上で",
        "word": "目的を達成する上で足枷となるものを排除しなければならない。",
        "mean": "목적을 달성하는 데 족쇄가 되는 것을 배제해야 한다."
      },
      {
        "answer": "上で",
        "word": "失敗は人間が成長する上で必ず通る道だ。",
        "mean": "실패는 인간이 성장하는 데 반드시 지나는 길이다."
      },
      {
        "answer": "上で",
        "word": "お酒の場は本音が出やすく, 仕事をする上で重要なことが得られるところだ。",
        "mean": "술자리는 속내를 드러내기 쉽고, 일하는 데 중요한 것을 얻을 수 있는 곳이다."
      },
      {
        "answer": "上で",
        "word": "趣味を継続する上で他人に迷惑かけるなんていうのは以ての外。",
        "mean": "취미를 계속하는 데 있어서 다른 사람에게 폐를 끼친다는 것은 의외다."
      },
      {
        "answer": "上で",
        "word": "音楽はやっぱり生きていく上で不可欠だと思う。",
        "mean": "음악은 역시 살아가는데 필수적이라고 생각해."
      },
      {
        "answer": "上で",
        "word": "成長する上で素直さがあれば, 知らないことに謙虚な姿勢で向き合い教えてもらうことができる。",
        "mean": "성장하는 데 솔직함이 있다면 모르는 것을 겸허한 자세로 마주 보고 배울 수 있다."
      },
      {
        "answer": "上で",
        "word": "筋肉を付ける上で最も重要なのはたんぱく質だ。",
        "mean": "근육을 키우는 데 가장 중요한 것은 단백질이다."
      },
      {
        "answer": "上で",
        "word": "経済を学ぶ上で, まず自国の経済を知っておくことは基本です。",
        "mean": "경제를 배우는데 있어서, 우선 자국의 경제를 알아 두는 것은 기본입니다."
      }
    ]
  },
  {
    "id": 8,
    "grammar": "上(うえ)で",
    "means": "~상으로(는)",
    "description": "어떠한 데이터나 근거를 나타내는 명사에 대해 그것들을 참조하는 것을 나타낸다",
    "connectionWays": "명사＋の上で(は)\n명사＋上",
    "examples": [
      {
        "answer": "上でしか",
        "word": "データ上でしか物事を見るのではなく, 目の前の実態も観察したほうがいい。",
        "mean": "데이터로만 사물을 볼 것이 아니라 눈앞의 실태도 관찰하는 것이 좋다."
      },
      {
        "answer": "の上では",
        "word": "明日から暦の上では新学期が始まる。",
        "mean": "내일부터 달력상으로는 새 학기가 시작된다."
      },
      {
        "answer": "の上では",
        "word": "資料の上では昔ここに墓地があったらしい。",
        "mean": "자료상으로는 옛날에 여기 묘지가 있었대."
      },
      {
        "answer": "の上では",
        "word": "今の情報の上では新たな被害者は確認されていない。",
        "mean": "지금의 정보상으로는 새로운 피해자는 확인되지 않았다."
      },
      {
        "answer": "の上では",
        "word": "富士山は地図の上では静岡県と山梨県に跨がっている。",
        "mean": "후지산은 지도상으로는 시즈오카현과 야마나시현에 걸쳐 있다."
      },
      {
        "answer": "上では",
        "word": "地図上では国境線が引かれているが, 実際そこには線など何もない。",
        "mean": "지도상으로는 국경선이 그어져 있지만 실제로 그곳에는 선이란 아무것도 없다."
      },
      {
        "answer": "の上では",
        "word": "聞いた話の上では厳しい人らしいが, 会ってみると意外に柔和な人だった。",
        "mean": "들은 얘기로는 엄한 사람이라는데 만나보니 의외로 유화적인 사람이었다."
      },
      {
        "answer": "の上で",
        "word": "新型コロナウイルスなど, 長い人類の歴史の上では多くあるうちのほんの１つの流行り病でしかない。",
        "mean": "코로나19 등 오랜 인류 역사상 흔한 중 단 하나의 유행병일 뿐이다."
      }
    ]
  },
  {
    "id": 9,
    "grammar": "(동사 기본형 / 과거형) 上(じょう)は",
    "means": "~한 이상(에는) ",
    "description":
        "화자의 강한 의지나 의무감, 결의를 나타내는 문법.\n\n앞 문장에는 에서는 이미 발생한 사건을 말하고, 그 상황 하에서 해야 할 일을 뒤 문장에서 서술함.\n\n以上(は) 와 같은 문법 이지만 , 동사 사전형과 과거형에 밖에 접속 불가능",
    "connectionWays": "동시 기본형\n동사 과거형",
    "examples": [
      {
        "answer": "上は",
        "word": "給料を貰ってる上は一生懸命やるのみ。",
        "mean": "월급 받는 이상은 열심히 할 뿐이야."
      },
      {"answer": "上", "word": "選ばれた上, 文句も言っていられない。", "mean": "뽑힌 이상 불평할 수 없다."},
      {
        "answer": "上は",
        "word": "試験勉強は一切してないが, 会場に来た上は全力を出そうと思う。",
        "mean": "시험공부는 일절 하지 않았지만, 회장에 온 이상은 전력을 다하려고 한다."
      },
      {
        "answer": "上は",
        "word": "この仕事を引き受けた上は責任をもってやり遂げる。",
        "mean": "이 일을 맡은 이상은 책임지고 해내다."
      }
    ]
  },
  {
    "id": 10,
    "grammar": "上 / 上に ~",
    "means": "~인 데다가",
    "description":
        "어떤 상태나 일의 발생과 더불어 더욱 그보다 정도가 심한 일이 발생했음을 나타낸다.\n\n뒷 내용은 앞 내용보다 정도가 높고, 좋은 내용이든 나쁜 내용이든 사용할 수 있다.\n\n[ その上 ] 는 접속사로도 사용 가능",
    "connectionWays": "동사 사전형＋上に\nい형용사 보통형＋上に\nな형용사 어간＋な / である＋上に\n명사＋である＋上に",
    "examples": [
      {"answer": "上に ~", "word": "今日は寒い上に風が強い。", "mean": "오늘은 추운데다가 바람이 세다."},
      {
        "answer": "その上",
        "word": "風が強くてゴミが舞ってるし, その上目に入って痛い。",
        "mean": "바람이 많이 불어서 쓰레기가 날리고 게다가 눈에 들어가서 아파."
      },
      {
        "answer": "その上",
        "word": "疲労で目が痛いし, その上座りっぱなしで腰も疲れた。",
        "mean": "피로로 눈이 아프고 심지어 앉아만 있어서 허리도 피곤해."
      },
      {
        "answer": "上に",
        "word": "父は腰に持病がある上に, 糖尿病まで患っている。",
        "mean": "아버지는 허리에 지병이 있는 데다 당뇨병까지 앓고 있다."
      },
      {
        "answer": "上",
        "word": "糖尿病の治療は困難な上, 遺伝する可能性もある。",
        "mean": "당뇨병 치료가 어렵운 데다가 유전될 가능성도 있다."
      },
      {
        "answer": "上に",
        "word": "この病は治る可能性は低い上に治療費も高額だ。",
        "mean": "이 병은 나을 가능성이 낮은 데다 치료비도 비싸다."
      },
      {
        "answer": "上に",
        "word": "彼は留学経験があって英語もペラペラな上に有名大学まで卒業している。",
        "mean": "그는 유학 경험이 있고 영어도 유창한데다 유명 대학까지 졸업했다."
      },
      {
        "answer": "上に",
        "word": "調味料の量ミスった上にめっちゃ味濃くなった。",
        "mean": "조미료가 실수한 데다 엄청 진해졌어."
      },
      {
        "answer": "上に",
        "word": "少子化な上に引きこもりなどで労働力にならない若手が増えたら, 一体誰が社会を支えるのでしょう。",
        "mean": "저출산에다 은둔형 외톨이 등으로 노동력이 되지 않는 젊은이가 늘어나면 도대체 누가 사회를 지탱할까요."
      },
      {
        "answer": "上に",
        "word": "酔って頭が痛い上に飯食ってないから腹が減った。",
        "mean": "취해서 머리 아픈데다가 밥을 안먹어서 배고파."
      },
      {
        "answer": "上に",
        "word": "本買いすぎて金欠な上にまだまだ欲しいのが待機してるから震える。",
        "mean": "책을 너무 많이 사서 부족한데다 아직 갖고싶은게 대기중이라 떨린다."
      },
      {
        "answer": "上に",
        "word": "着ていく服がない上に出かける気にもなれない。",
        "mean": "입고 갈 옷이 없는데다 나갈 엄두도 안 난다."
      },
      {
        "answer": "上に",
        "word": "あいつは性格が悪い上に見栄っ張り。",
        "mean": "저 녀석은 성격이 나쁜 데다가 허세."
      },
      {
        "answer": "上に",
        "word": "本人と会えて握手して貰えた上に, 写真も撮って貰えました。",
        "mean": "본인과 만나서 악수도 해주시고 사진도 찍어주셨어요"
      }
    ]
  },
  {
    "id": 11,
    "grammar": "~(よ)うではないか",
    "means": "~하자, ~하지 않을래?",
    "description":
        "자신의 의지를 전하고 찬성하도록 호소할 때 이용되는 문법.\n\n특히 연설, 연설, 선거 거리 연설 등의 장소에서 사용되며 많은 사람들을 향해 무언가를 호소할 때 사용된다.",
    "connectionWays": "동사 의지형",
    "examples": [
      {
        "answer": "ようじゃないか",
        "word": "じゃんけんで決着をつけようじゃないか。",
        "mean": "가위바위보로 결판을 내자."
      },
      {
        "answer": "ようではありませんか",
        "word": "国民の皆さん, 一緒に我が国を変えようではありませんか。",
        "mean": "국민 여러분, 함께 우리나라를 바꾸지 않겠습니까 ?"
      },
      {"answer": "こうじゃないか", "word": "一緒に食べに行こうじゃないか。", "mean": "같이 먹으러 가자."},
      {
        "answer": "ようじゃありませんか",
        "word": "新時代の幕開けを共に迎えようじゃありませんか。",
        "mean": "새 시대의 개막을 함께 맞이 하지 않겠습니까 ?"
      },
      {
        "answer": "ようじゃないですか",
        "word": "一緒に座って話をしようじゃないですか。",
        "mean": "같이 앉아서 얘기를 나누지 않겠습니까."
      },
      {
        "answer": "しましょうではありませんか",
        "word": "落ち着いた議論をしましょうではありませんか。",
        "mean": "차분한 논의를 합시다."
      },
      {
        "answer": "ましょうではありませんか",
        "word": "困った時はお互い助け合って行きましょうではありませんか。",
        "mean": "어려울 때는 서로 도와 나가지 않겠습니까?"
      },
      {"answer": "のうではないか", "word": "武士らしく潔く死のうではないか。", "mean": "무사답게 깨끗이 죽자."},
      {
        "answer": "ろうじゃないか",
        "word": "しょうがないからやってやろうじゃないか。",
        "mean": "어쩔 수 없으니까 해주자!"
      },
      {
        "answer": "ようではありませんか",
        "word": "日本を選挙で変えようではありませんか！",
        "mean": "일본을 선거로 바꾸자구요!"
      }
    ]
  },
  {
    "id": 12,
    "grammar": "~うる・える",
    "means": "~할 수 있다",
    "description": "상황의 가능성만 나타내며, 능력의 가능성은 나타낼 수 없다",
    "connectionWays": "동사 ます 형",
    "examples": [
      {
        "answer": "ありえる",
        "word": "宇宙はこんなにも広いんだから, 宇宙人の存在はきっとありえる話だ。",
        "mean": "우주는 이렇게 넓으니 외계인의 존재는 분명 있을 수 있는 이야기다."
      },
      {
        "answer": "えるだろう",
        "word": "この急カーブではよく曲がりきれず事故になっている。早く対策しなければ今後も起こりえるだろう。",
        "mean": "이 급커브에서는 잘 커프되지 않아 않아 사고가 나고 있다.빨리 대책하지 않으면 앞으로도 일어날 수 있을 것이다."
      },
      {
        "answer": "うる",
        "word": "話しうることは全て話した。あとは結果を待つだけだ。",
        "mean": "할 수 있는 말은 다 했다.이제 결과를 기다리기만 하면 된다."
      },
      {
        "answer": "得る",
        "word": "これは考え得る最悪の事態だ。",
        "mean": "이는 생각할 수 있는 최악의 사태다."
      },
      {
        "answer": "得る",
        "word": "短所は見方を変えると長所となり得る。",
        "mean": "단점은 시각을 바꾸면 장점이 될 수 있다."
      },
      {
        "answer": "得る",
        "word": "安価なネイルは爪を傷める原因になり得る。",
        "mean": "저렴한 네일은 손톱을 상하게 하는 원인이 될 수 있다."
      },
      {
        "answer": "得る",
        "word": "交通事故はいくら自分が注意していても他人あってのことなのでいつでも起こりうる。",
        "mean": "교통사고는 아무리 자신이 주의하고 있어도 남이 있어서의 일이기 때문에 언제든지 일어날 수 있다."
      },
      {
        "answer": "うる",
        "word": "交通事故は誰でも起こりうる問題です。",
        "mean": "교통사고는 누구나 일어날 수 있는 문제입니다."
      },
      {
        "answer": "得る",
        "word": "私の知り得る情報全てを包み隠さず話していきます。",
        "mean": "제가 알 수 있는 모든 정보를 숨김없이 이야기하겠습니다."
      },
      {
        "answer": "得る",
        "word": "男女間の友情ってあり得ると思いますか？",
        "mean": "남녀간의 우정이 있을 수 있다고 생각합니까?"
      },
      {
        "answer": "得る",
        "word": "人類が持ち得る戦力を結集させないと宇宙人には勝てない。",
        "mean": "인류가 가질 수 있는 전력을 결집시키지 않으면 외계인을 이길 수 없다."
      }
    ]
  },
  {
    "id": 13,
    "grammar": "おきに",
    "means": "~간격으로, ~걸러",
    "description": "시간이나 거리를 나타내는 명사에 붙는다\n２日おきに：〇XX〇XX〇X\n２日ごとに：〇X〇X〇X〇X",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "おきに",
        "word": "２日おきにしかシャワーを浴びない。",
        "mean": "이틀 간격으로만 샤워를 한다."
      },
      {
        "answer": "おきに",
        "word": "医者から１か月おきに通院するように言われている。",
        "mean": "의사로부터 1개월 간격으로 통원하라는 말을 듣고 있다."
      },
      {
        "answer": "おきに",
        "word": "多くのマラソン大会では５ｋｍおきに給水ポイントが設けられている。",
        "mean": "많은 마라톤 대회에서는 5km 간격으로 급수 포인트가 마련되어 있다."
      },
      {"answer": "おきに", "word": "５メートルおきに植樹する。", "mean": "5미터 간격으로 식수하다."},
      {
        "answer": "おきに",
        "word": "駅へ向かうバスは１５分おきに出ている。",
        "mean": "역으로 향하는 버스는 15분 간격으로 출발한다."
      }
    ]
  },
  {
    "id": 17,
    "grammar": "に/が欠かせない",
    "means": "빠뜨릴 수 없다",
    "description":
        "조건이나 양 등이 부족하면 성립되지 않는다, 즉 절대로 없어서는 안 된다는 것을 나타낸다.\n\n[ ~にとってなくてはならない, ~になくてはならない ] 로 바꿔 말할 수 있다.",
    "examples": [
      {
        "answer": "が欠かせない",
        "word": "この年になると晩酌が欠かせない。",
        "mean": "이 나이가 되면 저녁 반주를 빼놓을 수 없다."
      },
      {
        "answer": "のに欠かせない",
        "word": "ケーキはクリスマスを過ごすのに欠かせない。",
        "mean": "케이크는 크리스마스를 보내는 데 필수적이다."
      },
      {
        "answer": "が欠かせない",
        "word": "カイロが欠かせない季節になった。",
        "mean": "핫팩이 빠질 수 없는 계절이 됐다."
      },
      {
        "answer": "のに欠かせない",
        "word": "たんぱく質は筋肉を作るのに欠かせないものだ。",
        "mean": "단백질은 근육을 만드는 데 필수적인 것이다."
      }
    ]
  },
  {
    "id": 18,
    "grammar": "~限り / ない限り",
    "means": "~한 바로는, 하지 않는 한",
    "description":
        "~限り, ~限りでは : 범위를 한정하는 표현\n\n~ない限り : 앞 부분이 성립되야 뒷부분도 성립된다는 의미",
    "connectionWays": "명사 접속에 준함",
    "examples": [
      {
        "answer": "限り",
        "word": "ここに居る限り, 台風にも地震にも脅かされることはないだろう。",
        "mean": "여기에 있는 한 태풍이나 지진에도 위협을 받지는 않을 것이다."
      },
      {
        "answer": "限り",
        "word": "生きている限り, 必ず希望は訪れる。",
        "mean": "살아 있는 한 희망은 반드시 찾아온다."
      },
      {
        "answer": "限り",
        "word": "男である限り, ”性欲”という呪縛からは逃れられない。",
        "mean": "남자인 한 성욕이라는 주박에서 벗어날 수 없다."
      },
      {
        "answer": "限り",
        "word": "たとえ親でも教師でも, 人間である限り, その行いが絶対に正しいとは限らない。",
        "mean": "비록 부모든 교사든 인간인 한, 그 행동이 절대로 옳다고 할 수는 없다."
      },
      {
        "answer": "限り",
        "word": "上層部が無能な限り, この会社は何も変わらない。",
        "mean": "윗선이 무능한 한 이 회사는 아무것도 변하지 않는다."
      },
      {
        "answer": "ない限り",
        "word": "何か特別な理由等がない限りは, 決して休んではいけません。",
        "mean": "특별한 이유 등이 없는 한 결코 쉬어서는 안 됩니다."
      },
      {
        "answer": "ない限り",
        "word": "相手から連絡がない限り, 私から連絡することはない。",
        "mean": "상대방으로부터 연락이 없는 한 내가 연락할 일은 없다."
      },
      {
        "answer": "ない限り",
        "word": "強い確信がない限り, 彼を変に疑うようなことはいえない。",
        "mean": "강한 확신이 없는 한 그를 이상하게 의심하는 말은 할 수 없다."
      },
      {
        "answer": "ない限り",
        "word": "よほどのことがない限り, 行けたら行く。",
        "mean": "어지간한 일이 없는 한 갈 수 있으면 간다."
      },
      {
        "answer": "ない限り",
        "word": "この問題を解決しない限り, 先には進めない。",
        "mean": "이 문제를 해결하지 않는 한 앞으로 나아갈 수 없다."
      }
    ]
  },
  {
    "id": 19,
    "grammar": "~かけ / ~かけの / ~かける",
    "means": "~하다 말다 ; ~해 가고 있다 ; ~뻔 하다",
    "description":
        "아직 중간에 완전히 끝나지 않은 상태를 나타낸다.\n\n예를 들어 [ 壊れかけ ] 은 아직 완전히 깨지지는 않았지만 완전히 망가진 상태로 진행되고 있는 상태를 말한다.",
    "connectionWays": "동사 ます 형",
    "examples": [
      {"answer": "かけの", "word": "作りかけのパズル", "mean": "만들다 만 퍼즐"},
      {"answer": "かけの", "word": "食べかけのチョコレートケーキ", "mean": "먹다 만 초콜릿 케이크"},
      {"answer": "かけの", "word": "壊れかけの廃屋", "mean": "부서지기 직전의 폐옥"},
      {
        "answer": "かけている",
        "word": "彼の様子を見るに, 熱中症になりかけている。",
        "mean": "그의 모습을 보니 열사병에 걸려들고 있다."
      },
      {
        "answer": "かけの",
        "word": "やりかけの宿題があるから遊びに行けない。",
        "mean": "하던 숙제가 있어서 놀러 갈 수 없다."
      },
      {
        "answer": "かけている",
        "word": "水質が悪く, 魚が死にかけている。",
        "mean": "수질이 나빠 물고기가 죽어가고 있다."
      },
      {
        "answer": "かけてきている",
        "word": "あまりの暑さで買ったばかりのソフトクリームも溶けかけてきている。",
        "mean": "너무 더워서 산 지 얼마 안 된 소프트 아이스크림도 녹아가고 있다."
      },
      {
        "answer": "かけている",
        "word": "そのリンゴ, 腐りかけているから食べない方がいいよ。",
        "mean": "그 사과 썩어가고 있으니까 안 먹는 게 좋아."
      },
      {
        "answer": "かけたが",
        "word": "彼女は何か言いかけたが, うつむいて結局何も言わなかった。",
        "mean": "그녀는 뭔가 말을 하려고 했지만 고개를 숙이고 결국 아무 말도 하지 않았다."
      },
      {
        "answer": "かけている",
        "word": "USBが壊れてしまったのか, データが消えかけている。",
        "mean": "USB가 망가져 버린 것인지, 데이터가 사라져 가고 있다."
      },
      {"answer": "かけている", "word": "水が沸騰しかけている。", "mean": "물이 끓고 있다."}
    ]
  },
  {
    "id": 20,
    "grammar": "がち",
    "means": "자주~하다, ~하는 경향이 있다",
    "description":
        "나쁜 경향이 있음을 나타내며, 그 상태가 이전부터 여러 번 발생했음을 암시함.\n\n좋은 것에 대해서는 사용할 수 없다.",
    "connectionWays": "동사 ます 형\n명사에 직접 접속",
    "examples": [
      {
        "answer": "がちだ",
        "word": "学校を卒業すると, かつての友達とは疎遠になりがちだ。",
        "mean": "학교를 졸업하면 옛 친구들과는 소원해지기 쉽다."
      },
      {
        "answer": "がちで",
        "word": "暑いときは冷たいものを食べがちで, よくお腹を壊す。",
        "mean": "더울 때는 차가운 것을 먹기 쉬워서 자주 배탈이 난다."
      },
      {
        "answer": "がちになる",
        "word": "年を取るとやっぱり病気がちになる。",
        "mean": "나이가 들면 역시 병이 생기기 쉽다."
      },
      {
        "answer": "がちになる",
        "word": "天気が悪いと気持ちが沈みがちになる。",
        "mean": "날씨가 나쁘면 기분이 가라앉기 쉽다."
      },
      {
        "answer": "がちだ",
        "word": "食生活の乱れからか, 便秘がちだ。",
        "mean": "식생활의 혼란 때문인지 변비가 심하다."
      },
      {
        "answer": "がちだ",
        "word": "女性は少食だと思われがちだが, 実はそうではない。",
        "mean": "여성들은 소식 한다고 생각하기 쉽지만 사실은 그렇지 않다."
      },
      {
        "answer": "がち",
        "word": "人は自分に好意を示してくれた人を好きになりがち。",
        "mean": "사람들은 자신에게 호의를 보여준 사람을 좋아하기 쉽다."
      },
      {
        "answer": "がちな",
        "word": "今日は朝から曇りがちな天気です。",
        "mean": "오늘은 아침부터 흐리기 쉬운 날씨입니다."
      }
    ]
  },
  {
    "id": 21,
    "grammar": "~かと言うと / かと言えば",
    "means": "~하는가 하면, ~하냐 하면",
    "description":
        "1 실은 그렇지 않다\n 앞 문장에서 전제가 되는 사실을 말하고, 그 사실로부터 필연적으로 도출되는 결과를 부정함\n\n2-1 .~에 대해 설명하자면 (의문사 뒤에 접속)\n\n2-2  ~둘 중에 하나를 고르자면 (의문사 뒤에 접속)",
    "connectionWays":
        "동사 사전형＋(の)かと言うと\nい형용사 보통형＋(の)かと言うと\nな형용사 어간＋(なの)かと言うと\n명사＋(なの / であるの)かと言うと",
    "examples": [
      {
        "answer": "かと言えば",
        "word": "絵が上手であれば誰でも漫画家になれるかと言えば, そうとは限らない。",
        "mean": "그림을 잘 그리면 누구나 만화가 될 수 있느냐고 하면, 그렇지는 않다."
      },
      {
        "answer": "かというと",
        "word": "付き合っているからと言って二人の関係が必ずしも良いかというとそういうわけでもない。",
        "mean": "사귀고 있다고 해서 둘의 관계가 꼭 좋냐면 그런 것도 아니다."
      },
      {
        "answer": "かというと",
        "word": "資格を取ったからと言って, すぐ希望の仕事に就けるかというとそうではない。",
        "mean": "자격증을 땄다고 해서 바로 원하는 직업을 가질 수 있냐면 그렇지 않다."
      },
      {
        "answer": "かと言うと",
        "word":
            "長く付き合ったからと言って結婚後幸せになれるかと言うとそうではないし, 短いお付き合いで結婚してすぐ別れることになるかというとそういうわけでもない。",
        "mean":
            "오래 사귄다고 결혼 후 행복할 수 있냐면 그렇지 않고 짧은 교제로 결혼해서 바로 헤어지느냐 하면 그런 것도 아니다."
      },
      {
        "answer": "かと言うと",
        "word": "努力したからと言ってみんなが成功するかと言うと, そうとは限らない。",
        "mean": "노력한다고 해서 모두가 성공하느냐고 하면, 그렇다고는 할 수 없다."
      },
      {
        "answer": "かと言うと",
        "word": "１か月も経たずに仕事を辞めた。会社に不満があったかと言うとそういうわけでもないが, 何だか自分には合わない気がした。",
        "mean":
            "한 달도 안 돼 일을 그만두었다.회사에 불만이 있었냐면 그런 것도 아니지만 왠지 자신에게는 맞지 않는 것 같았다."
      },
      {
        "answer": "かと言うと",
        "word": "私はどっちかと言うと前向き思考な人間。",
        "mean": "나는 어느 쪽이냐 하면 긍정적 사고인 사람."
      },
      {
        "answer": "どっちかといえば",
        "word": "どっちかといえば子供は苦手。",
        "mean": "어느 쪽인가 하면 아이는 질색이야."
      },
      {
        "answer": "かといえば",
        "word": "うどん派かそば派かといえばうどん派。",
        "mean": "우동파냐 메밀파냐 하면 우동파."
      },
      {
        "answer": "かといえば",
        "word": "自分がいつ変わったかといえば, 新卒で入った会社を辞めた時です。",
        "mean": "내가 언제 바뀌었냐하면, 신졸로 들어간 회사를 그만뒀을 때입니다."
      },
      {
        "answer": "どっちかというと",
        "word": "見るだけだと分からないけど, 彼女はどっちかというと日本人っぽい。",
        "mean": "보기만 하면 모르겠지만, 그녀는 어느 쪽이냐 하면 일본인 같다."
      },
      {
        "answer": "かというと",
        "word": "成功を手にした人たちは何が違うのかというと[ 行動を起こしている ]ということです。",
        "mean": "성공을 거둔 사람들은 무엇이 다르냐면 행동을 일으키고 있다는 것입니다."
      },
      {
        "answer": "かというと",
        "word": "一度も海外に行った事がない。なぜかというと日本語しか話せないからだ。",
        "mean": "한 번도 해외에 가본 적이 없어.왜냐하면 일본어밖에 못하기 때문이다."
      },
      {
        "answer": "かと言えば",
        "word": "Ａさんは３０歳で退職した。辞めて何をするかと言えば, 自分で起業するらしい。",
        "mean": "A 씨는 30세에 퇴직했다.그만두고 뭐하냐면 자기가 창업하나봐."
      },
      {
        "answer": "かというと",
        "word": "雪を見たことがない。なぜかというと南国生まれだからだ。",
        "mean": "눈을 본 적이 없어.왜냐하면 남국 태생이기 때문이다."
      }
    ]
  },
  {
    "id": 22,
    "grammar": "かのようだ",
    "means": "마치 ~인 듯 하다",
    "description": "실제는 그렇지 않지만 ‘~처럼 보인다, ~같다’ 무언가에 비유할 때 사용하는 표현",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 보통형\n명사である",
    "examples": [
      {
        "answer": "かのようですね",
        "word": "３月なのにまた, 寒くなりましたね。まるで真冬に戻ったかのようですね。",
        "mean": "3월인데도 다시 추워졌네요. 마치 한겨울로 돌아간 것 같네요."
      },
      {
        "answer": "かのように",
        "word": "妻は付き合って初めてあげたネックレスを１０年経った今でも, 宝物かのように大切にしている。",
        "mean": "아내는 사귀고 처음 준 목걸이를 10년이 지난 지금도 보물처럼 아끼고 있다."
      },
      {
        "answer": "かのように",
        "word": "彼はまるで全てを知っているかのように話しているが, 全て彼の想像にすぎない。",
        "mean": "그는 마치 모든 것을 알고 있는 것처럼 말하고 있지만, 모두 그의 상상일 뿐이다."
      },
      {
        "answer": "かのような",
        "word": "彼は今日初めて会うのに, 前に何度も会ったことがあるかのような態度で話してくる。",
        "mean": "그는 오늘 처음 만나는데 전에 몇 번이나 만난 적이 있는 것 같은 태도로 얘기해 온다."
      },
      {
        "answer": "かのようだ",
        "word": "Instagramでたくさんの人にフォロワーされると, まるで有名人にでもなったかのようだ。",
        "mean": "인스타그램에서 많은 사람들에게 팔로워를 당하면 마치 유명인사라도 된 것 같다."
      },
      {
        "answer": "かのように",
        "word": "彼女は辛い出来事があったにもかかわらず, 何事もなかったかのように明るく振舞っていた。",
        "mean": "그녀는 힘든 일이 있었음에도 불구하고 아무 일도 없었던 것처럼 밝게 행동하고 있었다."
      }
    ]
  },
  {
    "id": 23,
    "grammar": "からして",
    "means": "~부터가, ~으로 보아",
    "description":
        "~부터가 : 이것도 그렇지만 나머지도 그렇다.\n\n~으로 보아 : ~からすると, ~からして와도 바꿔 쓸 수 있다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "からして",
        "word": "声とかからしてめっちゃモテそう。",
        "mean": "목소리 따위부터가 봐서 엄청 인기 많을 것 같아."
      },
      {"answer": "からして", "word": "彼は服装からして独特だ。", "mean": "그는 복장부터가 독특하다."},
      {
        "answer": "からして",
        "word": "名前からして面白そうな映画だ。",
        "mean": "이름부터 재미있을 것 같은 영화다."
      },
      {
        "answer": "からして",
        "word": "彼女は雰囲気からして天使みたいな女の子だった。",
        "mean": "그녀는 분위기부터가 천사 같은 여자였다."
      },
      {
        "answer": "からして",
        "word": "サイコロで100回連続6を出すのは, 確率に支配されたこの世界の仕組みからしてまず実現しないはずだ。",
        "mean": "주사위로 100회 연속 6을 내는 것은 확률에 지배된 이 세계의 구조으로 보아 우선 실현되지 않을 것이다."
      },
      {
        "answer": "からして",
        "word": "横浜流星。名前の響きからしてカッコいい。",
        "mean": "요코하마 유성 이름의 울림부터 멋있다."
      },
      {
        "answer": "からして",
        "word": "オリンピック選手と私たちは体のつくりからして違う。",
        "mean": "올림픽 선수와 우리는 몸만들기부터 다르다."
      },
      {
        "answer": "からして",
        "word": "この香水は香りからして他と全然違うのが素人でも分かる。",
        "mean": "이 향수는 향으로 보아 다른 것과 전혀 다른 것을 아마추어도 알 수 있다."
      },
      {
        "answer": "からして",
        "word": "試合前だが, 彼のその表情からしてすでに負けは決まっているようなものだ。",
        "mean": "경기 전이지만 그의 표정으로 보아 이미 패배는 결정된 것과 같다."
      }
    ]
  },
  {
    "id": 24,
    "grammar": "~からすると / からすれば / からしたら",
    "means": "~로 보아, ~(의 입장에서) 보아, ~의 입장에서 생각하면",
    "description": "어떤 사건으로 평가 / 판단 할 때 사용되는 문법",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "からすれば",
        "word": "経験者からすれば天と地の差だ。",
        "mean": "경험자 입장에서는 하늘과 땅의 차이다."
      },
      {
        "answer": "からすれば",
        "word": "富裕層は世界全体の人口からすれば, 本当に一握りでしかない。",
        "mean": "부유층은 세계 전체 인구로 보면 정말 소수일 뿐이다."
      },
      {
        "answer": "からすれば",
        "word": "雪国育ちの私からすれば, この程度の寒さは寒くない。",
        "mean": "설국에서 자란 나로서는 이 정도 추위가 춥지 않다."
      },
      {
        "answer": "からすれば",
        "word": "跳び箱は運動神経が無い人からすれば絶対にできない。",
        "mean": "뜀틀은 운동신경이 없는 사람 입장에서는 절대 못해."
      },
      {
        "answer": "からすれば",
        "word": "他人からすれば羨ましく思うかもしれない。",
        "mean": "남들이 보면 부러워할 수도 있어."
      },
      {
        "answer": "からすれば",
        "word": "私の感覚からすれば受け入れがたいものです。",
        "mean": "제 감각으로는 받아들이기 어려운 것입니다."
      },
      {
        "answer": "からすると",
        "word": "食べても太らないなんて, 私からすると夢のような話です。",
        "mean": "먹어도 살이 찌지 않는다니 제가 보기엔 꿈같은 얘기예요."
      },
      {
        "answer": "からしたら",
        "word": "喫煙者の私からしたら, 街中であちこち禁煙になってつらい。",
        "mean": "흡연자인 나로서는 거리에서 여기저기 금연이 되어 괴롭다."
      }
    ]
  },
  {
    "id": 25,
    "grammar": "~からみると・~からみれば・~からみて",
    "means": "~로 보아, ~(의 입장에서) 보아, ~의 입장에서 생각하면",
    "description":
        "인물을 나타내는 말에 접속 하면 그 인물이 본 판단을 나타낸다.\n\n상황이나 상태를 나타내는 말에 붙으면, 후건에서 말하는 판단의 근거가 되는 것을 나타낸다\n\n비슷한 문형에 [ ~から言うと / から言えば / から言ったら / から言って ] 있는데, 이쪽은 인물을 나타내는 말에는 접속할 수 없다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "から見ると",
        "word": "私から見ると彼は良い人には見えない。",
        "mean": "내가 보기에 그는 좋은 사람으로 보이지 않아."
      },
      {
        "answer": "から見ると",
        "word": "色んな角度から見ると, 物事の見え方も変わる。",
        "mean": "여러 각도에서 보면 사물이 보이는 방식도 달라진다."
      },
      {
        "answer": "から見れば",
        "word": "絵心がない私から見れば, この絵は正に神の領域だ。",
        "mean": "그림 마음이 없는 내가 보기에 이 그림은 바로 신의 영역이다."
      },
      {
        "answer": "から見れば",
        "word": "感染者数から見れば, スペイン風邪が人類史上最悪の感染症である。",
        "mean": "확진자 수로 보면 스페인 독감이 인류 역사상 최악의 감염병이다."
      },
      {
        "answer": "から見て",
        "word": "彼はいつもお金の点から見て物事を考えている。",
        "mean": "그는 항상 돈의 관점에서 생각하고 있다."
      },
      {
        "answer": "から見て",
        "word": "私の職場では, 誰の目から見ても明らかな不当人事が行われている。",
        "mean": "내 직장에서는 누가 봐도 명백한 부당 인사가 이뤄지고 있다."
      },
      {
        "answer": "から見ても",
        "word": "Ａさんは男性にも人気があるけど, 女性から見ても魅力的です。",
        "mean": "A씨는 남자들에게도 인기가 있지만 여자들이 보기에도 매력적이에요."
      },
      {
        "answer": "から見ても",
        "word": "この作品の素晴らしさは素人から見ても分かる。",
        "mean": "이 작품의 훌륭함은 아마추어가 봐도 알 수 있다."
      }
    ]
  },
  {
    "id": 26,
    "grammar": "~から言うと / から言えば / から言ったら / から言って",
    "means": "~로 보아, ~(의 입장에서) 보아, ~의 입장에서 생각하면",
    "description":
        "어떤 입장에서 본 판단, 평가, 시각을 나타낸다.\n\n인물을 나타내는 명사에는 접속할 수 없기 때문에 주의가 필요함.\n\n✕　自分から言うと, これは失敗する。\n◯　自分の経験から言うと, これは失敗する。\n\n비슷한 문형에 [~から見ると / から見れば / から見て / から見ても] 있는데, 이쪽은 인물을 나타내는 말에 접속할 수 있다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "から言うと",
        "word": "自分自身の経験から言うと, 行動することが最も勇気がいる。",
        "mean": "자신의 경험으로 봤을 때 행동하는 것이 가장 용기 있다."
      },
      {
        "answer": "から言うと",
        "word": "個人的な経験から言うと, 東北の人は大らかで人懐っこいと思う。",
        "mean": "개인적인 경험으로 봤을 때 동북쪽 사람들은 너그럽고 친근하다고 생각한다."
      },
      {
        "answer": "から言うと",
        "word": "今までの流れから言うとこのまま負けるパターンが多い。",
        "mean": "지금까지의 흐름으로 봤을 때 이대로 지는 패턴이 많다."
      },
      {
        "answer": "から言えば",
        "word": "彼の性格から言えば, 教師に向いているとは到底思えない。",
        "mean": "그의 성격으로 보면 교사로 적합하다고는 도저히 생각되지 않는다."
      }
    ]
  },
  {
    "id": 27,
    "grammar": "~からといって\r",
    "means": "~라고 해서",
    "description":
        "전항에서 말하는 원인 하나만으로는 후항은 충분히 성립되지 않는다는 것, 그렇게 말할 수 없음을 나타낸다.\n\n회화체로는 [からって] 문어체로는 [からとて] 가 있다",
    "connectionWays": "동사 사전형동사 기본형\nい형용사 기본형\nな형용사 기본형\n명사だ",
    "examples": [
      {
        "answer": "からといって",
        "word": "電車やバスで席を譲らなかったからといって, わざわざ批判されるようなことではない。",
        "mean": "전철이나 버스에서 자리를 양보하지 않았다고 해서 굳이 비판받을 일은 아니다."
      },
      {
        "answer": "からって",
        "word": "自分が好きだからって, 相手にそれを押し付けるべきではない。",
        "mean": "자신이 좋다고 해서 상대방에게 그것을 강요해서는 안 된다."
      },
      {
        "answer": "からとて",
        "word": "数学では, 解答を見て理解できるからとて自分で解けるとは限らない。",
        "mean": "수학에서는 해답을 보고 이해할 수 있다고 해서 스스로 풀 수는 없다."
      },
      {
        "answer": "からといって",
        "word": "頑張ったからといって全ての人が必ず報われるわけではない。",
        "mean": "열심히 한다고 해서 모든 사람이 반드시 보답을 받는 것은 아니다."
      },
      {
        "answer": "からといって",
        "word": "暑いからといって, 冷たいものは飲み過ぎないほうがいい。",
        "mean": "덥다고 해서 차가운 것은 과음하지 않는 것이 좋다."
      },
      {
        "answer": "からといって",
        "word": "彼の障害があるからといって落ち込まないその姿に感動させられた。",
        "mean": "그의 장애가 있다고 해서 우울해하지 않는 그 모습에 감동을 받았다."
      },
      {
        "answer": "からといって",
        "word": "負けたからといって頭を抱える必要はない。 勝ったからといって大喜びする必要もない。 最善をつくしたならば。",
        "mean": "졌다고 해서 머리를 싸맬 필요는 없다. 이겼다고 크게 기뻐할 필요도 없다. 최선을 다했다면."
      },
      {
        "answer": "からといって",
        "word": "学校での成績がよいからといって, 社会で認められるとは限らない",
        "mean": "학교에서의 성적이 좋다고 해서 사회에서 인정받는다고는 할 수 없다"
      },
      {
        "answer": "からといって",
        "word": "良い授業を受けたからといって, 必ず成績が上がるわけでもない。",
        "mean": "좋은 수업을 듣는다고 해서 꼭 성적이 오르는 것도 아니다."
      },
      {
        "answer": "からといって",
        "word": "考えたからといってすぐ答えが出るものではない。",
        "mean": "생각한다고 해서 바로 답이 나오는 것은 아니다."
      }
    ]
  },
  {
    "id": 28,
    "grammar": "からには",
    "means": "~한 이상에는",
    "description":
        "전항에서는 어떠한 책임이나 결의 / 결심을 나타내고, 후항에서는 그 전항에 대한 책임이나 의무를 다하는 내용이 기술된다.\n\n대부분의 경우, 후항에서는 [~なければならない, ~べき, ~つもり ] 등 의무나 결의 등을 나타내는 의지성이 강한 표현이 사용된다.\n\n문법 [~以上 / 以上は] 와 접속형태는 거의 비슷하고, 의미는 같다.",
    "connectionWays": "동사 기본형\n동사 과거형\n명사である",
    "examples": [
      {"answer": "からには", "word": "やるからには１位を取りたい。", "mean": "한 이상에는 1등을 하고 싶다."},
      {
        "answer": "からには",
        "word": "言い出したからには実行してもらいたい。",
        "mean": "말을 꺼낸 이상 실행해 주었으면 한다."
      },
      {
        "answer": "からには",
        "word": "この年になると, 付き合うからには結婚のことも考えなければいけない。",
        "mean": "이 나이가 되면 사귈 바에야 결혼 생각도 해야 한다."
      },
      {
        "answer": "からには",
        "word": "ご連絡頂いたからには誠心誠意対応させていただきます。",
        "mean": "연락주신 이상 성심성의껏 대응하겠습니다."
      },
      {
        "answer": "からには",
        "word": "この世に生まれたからには, 自分の生きた証を残したい。",
        "mean": "이 세상에 태어난 이상 자신의 살아있는 증거를 남기고 싶다."
      },
      {
        "answer": "からには",
        "word": "どうせ行くからには楽しまなきゃ損。",
        "mean": "이왕 갈 바에는 즐기지 않으면 손해."
      },
      {
        "answer": "からには",
        "word": "責任は果たすものだ。頼まれたからにはちゃんとやる。",
        "mean": "책임은 다하는 법이다.부탁받은 이상 제대로 하겠다."
      },
      {
        "answer": "からには",
        "word": "秘密を知られたからには生かしてはおけない。",
        "mean": "비밀을 알게 된 이상 살려둘 수 없다."
      }
    ]
  },
  {
    "id": 29,
    "grammar": "がる",
    "means": "~がる　~워하다\n~がっている ~워하고 있다\n~がらずに, ~がらないで ~워하지 말고",
    "description":
        "감정·감각 형용사에 접속하여 2인칭, 3인칭의 감정이나 감각을 나타낸다.\n\n1인칭으로는 사용할 수 없다.\n\n이 문법은 형용사를 5단 동사화하기 때문에\n[[ 寒がり, 暑がり, 寂しがり, 恥ずかしがり, 怖がり] 등의 명사가 생겨나고 있는 것.",
    "connectionWays": "い형용사 어간＋がる / がっている\nな형용사 어간＋がる / がっている",
    "examples": [
      {
        "answer": "怖がっている",
        "word": "彼は死ぬことを怖がっている。",
        "mean": "그는 죽는 것을 두려워하고 있다."
      },
      {"answer": "がっている", "word": "みんなが不思議がっている。", "mean": "모두가 신기해하고 있다."},
      {
        "answer": "嫌がる",
        "word": "うちの猫は爪切られるのをとても嫌がる。",
        "mean": "우리 고양이는 손톱 깎이는 걸 너무 싫어해."
      },
      {
        "answer": "寒がっている",
        "word": "猫が寒がっているので暖房をつけた。",
        "mean": "고양이가 추워해서 난방을 틀었다."
      },
      {
        "answer": "ずかしがらなくても",
        "word": "恥ずかしがらなくてもいいです。",
        "mean": "부끄러워하지 않아도 돼요."
      },
      {"answer": "寂しがり", "word": "彼女は寂しがり屋だ。", "mean": "그녀는 외로움을 많이 탄다."},
      {
        "answer": "暑がっている",
        "word": "彼は室温２０度でも暑がっている。",
        "mean": "그는 실온 20도에서도 더워하고 있다."
      }
    ]
  },
  {
    "id": 30,
    "grammar": "気味",
    "means": "~기미, ~느낌, ~기운,~경향",
    "description": "화자가 약간 느끼는 감각을 나타내는 문법.\n\n일반적으로 좋지 않은 것에 대해 사용된다.",
    "connectionWays": "명사 직접 접속\n동사 ます형",
    "examples": [
      {
        "answer": "気味",
        "word": "少し風邪気味だから, 外出は控えようと思う。",
        "mean": "감기 기운이 조금 있어서 외출은 자제하려고 해."
      },
      {
        "answer": "気味",
        "word": "治りかけだったけど, 少し無理をしてしまって若干悪化気味だ。",
        "mean": "나을 뻔했지만, 조금 무리를 해서 약간 악화 기미가 보인다."
      },
      {
        "answer": "気味",
        "word": "変なものを食べたせいで下痢気味だ。",
        "mean": "이상한 걸 먹은 탓에 설사 기운이 난다."
      },
      {
        "answer": "気味",
        "word": "顔を見る限り, 彼女はちょっとお疲れ気味だ。",
        "mean": "얼굴을 보는 한, 그녀는 조금 피곤한 기색이다."
      },
      {"answer": "気味", "word": "最近太り気味なので運動しないと。", "mean": "요즘 살쪄서 운동해야겠다."},
      {
        "answer": "気味",
        "word": "何度やっても失敗するから, 半ば諦め気味だ。",
        "mean": "몇 번을 해도 실패하니까, 반쯤 포기하는 경향이 있어."
      },
      {
        "answer": "気味",
        "word": "彼女は内気で, 何をするにも遠慮気味だ。",
        "mean": "그녀는 내성적이고, 무엇을 하든 사양하는 경향이 있다."
      },
      {
        "answer": "気味",
        "word": "季節の変わり目は体調を崩し気味だ。",
        "mean": "환절기는 컨디션이 나빠지는 경향이 있다."
      }
    ]
  },
  {
    "id": 31,
    "grammar": "~たきり / ~たっきり",
    "means": "~한 채, ~이후로, ~뿐",
    "description": "전항이 발생한 이후 후항이 한 번도 발생하지 않았음을 나타낸다.",
    "connectionWays":
        "동사 た형 ＋きり~(ない) / っきり~(ない)\n시간 표현하는 명사＋きり~(ない) / っきり~(ない)\n(시간을 표현하는 )これ / それ / あれ＋きり~(ない) / っきり~(ない)",
    "examples": [
      {
        "answer": "したっきり",
        "word": "彼とは数年前卒業したっきり連絡もない。",
        "mean": "그와는 몇 년 전 졸업한 이후로 연락도 없다."
      },
      {"answer": "っきりだ", "word": "花火大会は今年っきりだそうだ。", "mean": "불꽃놀이는 올해뿐이라고 한다."},
      {
        "answer": "したっきり",
        "word": "本を誰かに貸したっきり行方が分からなくなってしまった。",
        "mean": "책을 누군가에게 빌려준 후 행방이 묘연해졌다."
      },
      {"answer": "それっきり", "word": "それっきり音沙汰が無い。", "mean": "그 이후로 소식이 없다."},
      {
        "answer": "っきりだ",
        "word": "沖縄は新婚旅行で行ったっきりだ。",
        "mean": "오키나와는 신혼여행으로 갔을 뿐이다"
      },
      {
        "answer": "っきり",
        "word": "トイレ行くといったっきり帰ってこない。",
        "mean": "화장실 간다고 말 한채 돌아오지 않는다."
      },
      {
        "answer": "ったっきり",
        "word": "子供が出てったっきり帰ってこない。",
        "mean": "아이가 나간 채 돌아오지 않는다."
      },
      {
        "answer": "たきり",
        "word": "お粥なんて子供の時に食べたきり食べてない。",
        "mean": "죽 같은 건 어렸을 때 먹은 이후로 안 먹었어."
      }
    ]
  },
  {
    "id": 32,
    "grammar": "からこそ",
    "means": " ~이기 때문에\r",
    "description":
        "이유나 원인을 강조하는 문법.\n\n이유는 바로 그것이지 그 외에는 아니라는 뉘앙스를 가진다.\n\n주로 좋은 내용에 사용하며 주관적인 판단에 근거한 것.",
    "connectionWays":
        "명사＋だからこそ\nい형용사 보통형＋からこそ\nな형용사 어간＋だ / である＋からこそ\n동사 사전형＋からこそ",
    "examples": [
      {
        "answer": "からこそ",
        "word": "普段こういったことは言わないけど, 好きな人だからこそ言っておきたかった。",
        "mean": "평소에 이런 말은 하지 않지만 좋아하는 사람이기 때문에 해두고 싶었다."
      },
      {
        "answer": "からこそ",
        "word": "雨だからこそ, テンション上げて行こう。",
        "mean": "비가 오니까 텐션 올리고 가자."
      },
      {
        "answer": "からこそ",
        "word": "目的があるからこそ, 達成や失敗がある。",
        "mean": "목적이 있기에 달성과 실패가 있다."
      },
      {
        "answer": "からこそ",
        "word": "分かりあってるからこそ言い合える。",
        "mean": "서로 알고 있기에 말할 수 있다."
      },
      {
        "answer": "からこそ",
        "word": "非常事態だからこそ力を合わせるべきだ。",
        "mean": "비상사태이기 때문에 힘을 모아야 한다."
      },
      {
        "answer": "からこそ",
        "word": "能力があるからこそ彼にはリーダーをしてほしいと思っている。",
        "mean": "능력이 있기 때문에 그가 리더를 했으면 좋겠다고 생각한다."
      },
      {
        "answer": "からこそ",
        "word": "あの時の努力があるからこそ今の結果がある。",
        "mean": "그때의 노력이 있기에 지금의 결과가 있다."
      },
      {
        "answer": "からこそ",
        "word": "気持ちが分かるからこそ, 彼女にかける言葉が見つからない。",
        "mean": "마음을 알기 때문에 그녀에게 할 말을 찾을 수 없다."
      }
    ]
  },
  {
    "id": 33,
    "grammar": "ことから\n",
    "means": "~로 인해, ~때문에, ~이유로",
    "description":
        "원인이나 이유, 근거를 나타낸다.\n\n후항에서는 전항에서 제시된 원인이나 근거에 의해 인도되는 결과가 기술된다.",
    "connectionWays": "명사 접속 형태 따름",
    "examples": [
      {
        "answer": "ことから\n",
        "word": "[ ねこ ]は昼間よく寝ることから, [ 寝子 ]と名付けられたことに由来する。",
        "mean": "고양이'는 낮에 잠을 잘 잔다는 이유로 '잠꾸러기'라는 이름이 붙은 데서 유래했다."
      },
      {
        "answer": "ことから\n",
        "word":
            "人間ドックの[ ドック ]は犬という意味ではなく, 船を修理・点検する英語の[ dock ]に由来することから, 人に対する精密検査を表すようになった。",
        "mean":
            "종합건강검진의 '독'은 개라는 뜻이 아니라 배를 수리·점검하는 영어 'dock'에서 유래한 것이기 때문에 사람에 대한 정밀검사를 나타내게 됐다."
      },
      {
        "answer": "ことから\n",
        "word": "これらの内容を参考にしたことから生じたいかなる損害に対しても, 一切の責任を負いかねます。",
        "mean": "이러한 내용을 참고함으로써 발생한 어떠한 손해도 책임지지 않습니다."
      },
      {
        "answer": "ことから\n",
        "word": "近年児童数が急激に減少していることから, 各地で公立小中学校の統廃合が進んでいる。",
        "mean": "최근 학생 수가 급격히 감소로 인해 각지에서 공립 초중학교의 통폐합이 진행되고 있다."
      },
      {
        "answer": "ことから\n",
        "word": "この問題は緊急性が低いことから, 今まであまり注目されてこなかった。",
        "mean": "이 문제는 시급성이 낮기 때문에 지금까지 별로 주목받지 못했다."
      },
      {
        "answer": "ことから\n",
        "word": "大量の警察官を動員していることから, 今回のサミットの重要性が分かる。",
        "mean": "경찰관을 대거 동원하고 있다는 점에서 이번 정상회의의 중요성을 알 수 있다."
      }
    ]
  },
  {
    "id": 34,
    "grammar": "~ことはない / こともない",
    "means": "할 필요는 없다\n할 필요도 없다",
    "description": "~할 필요 없다’는 의미로 충고 / 조언의 역할을 한다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "こともない",
        "word": "まだ時間があるので急ぐこともない。",
        "mean": "아직 시간이 있으니 서두를 것도 없다."
      },
      {"answer": "ことはないよ", "word": "気にすることはないよ。", "mean": "신경 쓸 거 없어."},
      {
        "answer": "ことはありません",
        "word": "気軽に何でもおっしゃってください。 遠慮することはありません。",
        "mean": "편하게 뭐든지 말씀해주세요. 사양할 것 없어요."
      },
      {
        "answer": "ことはない",
        "word": "自分に嘘をついてまで無理することはない。",
        "mean": "자신에게 거짓말을 하면서까지 무리할 것은 없다."
      },
      {
        "answer": "ことはない",
        "word": "『悩んでも悩まない, そういうように感じることができれば, 人生は決して心配することはない』",
        "mean": "고민해도 고민하지 않는다, 그렇게 느낄 수 있다면 인생은 결코 걱정할 일이 없다."
      },
      {
        "answer": "ことはない",
        "word": "人生, 悪いことばかりでないから悲観することはない。",
        "mean": "인생, 나쁜 일만 있는 것이 아니기 때문에 비관할 것은 없다."
      },
      {
        "answer": "ことはない",
        "word": "人事を尽くしたなら, なにも心配することはない。",
        "mean": "인사를 다했다면 걱정할 것이 없다."
      },
      {
        "answer": "ことはない",
        "word": "断られても気にすることはない。きっとどこかで, 別の人が待ってくれている。",
        "mean": "거절당해도 신경 쓸 것 없다.분명 어딘가에서 다른 사람이 기다려주고 있을 거야."
      },
      {
        "answer": "ことはないんだよ",
        "word": "泣きたいなら我慢することはないんだよ。",
        "mean": "울고 싶으면 참지 않아도 돼"
      },
      {
        "answer": "こともない",
        "word": "自分の価値観は大切にすべきで, 誰かのために無理することもない。",
        "mean": "자신의 가치관은 소중히 여겨야지 누군가를 위해 무리할 일도 없다."
      },
      {
        "answer": "ことはないんじゃないかな",
        "word": "夢がないからって自分を卑下することはないんじゃないかな。",
        "mean": "꿈이 없다고 자신을 비하하는 일은 없지 않을까?"
      }
    ]
  },
  {
    "id": 35,
    "grammar": "~最中 / 真っ最中",
    "means": "한창 ~ 중에",
    "description":
        "동작의 계속을 나타내지만, [最中] 이란 특히 그 동작의 가장 들떠 있는 시간대를 가리키고 있다.\n\n[食事の最中] 이라고 하면 식사를 할 때 가장 즐거울 때를 말하지만 [水を飲んでいる最中] 이라고는 보통 말할 수 없다. \n왜냐하면 동작에 흥이 날만한 장면이 없기 때문이다.\n\n흔히 [ている最中に, ~た] 의 형태로 사용되며, 후항에는 갑자기 발생한 현상이나 예상치 못한 현상이 나타난다.\n\n또 특히 강조하는 말투로 [真っ最中 ] ] 가 있다.",
    "connectionWays": "동사 て형\n명사 + の",
    "examples": [
      {
        "answer": "いる最中",
        "word": "今は小説を読んでいる最中なんで話しかけないでください。",
        "mean": "지금은 소설을 읽는 중이니 말을 걸지 마세요."
      },
      {"answer": "ている", "word": "映画を見ている最中に停電した。", "mean": "영화를 보다가 정전이 되었다."},
      {
        "answer": "最中です",
        "word": "現在ネットワークに関する問題が発生しており, 調査を行っている最中です。",
        "mean": "현재 네트워크 관련 문제가 발생하고 있어 조사 중입니다."
      },
      {
        "answer": "最中に",
        "word": "夜は室内も寒いですから, 寝ている最中に風邪を引かないよう十分お気をつけください。",
        "mean": "밤에는 실내도 춥기 때문에 주무시는 동안 감기에 걸리지 않도록 충분히 주의하시기 바랍니다."
      },
      {
        "answer": "の最中に",
        "word": "帰宅の最中に会社から呼び出されて気分最悪。",
        "mean": "퇴근길에 회사에서 호출되어 기분 최악."
      },
      {
        "answer": "の最中に",
        "word": "登山の最中にトイレに行きたくなったら, 辺りの茂みでするしか方法はない。",
        "mean": "등산을 하다가 화장실에 가고 싶으면 주변 덤불에서 하는 수밖에 없다."
      },
      {
        "answer": "の最中に",
        "word": "デートの最中に雪が降ってきて２人ではしゃいだ。",
        "mean": "데이트 중에 눈이 와서 둘이서 떠들었어."
      },
      {
        "answer": "最中に",
        "word": "電車に乗ってる最中にお腹が痛くなった。",
        "mean": "전철을 타다가 배가 아팠다."
      },
      {
        "answer": "真っ最中に",
        "word": "人が気持ちよく歌っている真っ最中に話しかけんな。",
        "mean": "사람들이 기분 좋게 노래하고 있는 와중에 말을 걸지 마."
      },
      {
        "answer": "最中だ",
        "word": "私は今頭を抱えながら卒論を書いている最中だ。",
        "mean": "나는 지금 머리를 싸매고 졸업 논문을 쓰는 중이야."
      }
    ]
  },
  {
    "id": 36,
    "grammar": "さえ",
    "means": "~ 조차",
    "description":
        "어떤 극단적인 예에서 기타 사물에 대해 유추하는 문법.\n\nも로 바꿔 말할 수 있는데,　すら는 이보다 더 강조하는 표현.\n\n[ただでさえ (그렇지 않아도)] 라고 하는 말도 있다.",
    "connectionWays":
        "명사 + さえ / さえも\n조사(に / から / で / の / と)＋さえ / さえも\n인물 명사＋(で)＋さえ / さえも",
    "examples": [
      {"answer": "でさえ", "word": "プロでさえ失敗することもある。", "mean": "프로조차 실패할 수 있다."},
      {
        "answer": "さえ",
        "word": "このまま終わらない可能性さえある。",
        "mean": "이대로 끝나지 않을 가능성마저 있다."
      },
      {
        "answer": "でさえ",
        "word": "日本人でさえも知らない言葉を, 外国人が勉強する必要はない。",
        "mean": "일본인조차 모르는 말을 외국인이 공부할 필요는 없다."
      },
      {
        "answer": "さえ",
        "word": "当時は泳ぐことさえできなかったのに, 今ではトライアスロンを完走するくらいにまで成長した。",
        "mean": "당시에는 수영조차 못했는데 이제는 트라이애슬론을 완주할 정도로 성장했다."
      },
      {
        "answer": "さえ",
        "word": "学生の今でさえ大変なのに, 卒業して社会人になったらどうなるのだろう。",
        "mean": "학생인 지금도 힘든데 졸업하고 사회인이 되면 어떻게 될까."
      },
      {
        "answer": "さえ",
        "word": "上司の命令で, 土日さえも出勤しなければならなくなった。",
        "mean": "상사의 명령으로 주말조차도 출근해야 했다."
      },
      {"answer": "さえ", "word": "水を飲み込むのさえ痛い。", "mean": "물 삼키는 것조차 아프다."},
      {"answer": "さえ", "word": "大寒波で家の中さえ寒い。", "mean": "대한파로 집안마저 춥다."},
      {
        "answer": "ただでさえ",
        "word": "ただでさえ時間がないのに, 子供が熱を出して大変だ。",
        "mean": "가뜩이나 시간이 없는데 아이가 열이 나서 힘들다."
      },
      {
        "answer": "ただでさえ",
        "word": "ただでさえ人が多いのに, 大型連休ともなるとその込み具合は尋常ではなくなる。",
        "mean": "그렇지 않아도 사람이 많은데 황금연휴만 되면 붐비는 모습이 심상치 않다."
      }
    ]
  },
  {
    "id": 37,
    "grammar": "すら",
    "means": "조차",
    "description":
        "대부분의 경우 좋지 않은 일에 사용.\n최소한의 일을 할 수 없는 등 대상에 대한 멸시나 경시의 감정이 포함되는 것이 특징.\n후건에는 부정형이 호응함.",
    "connectionWays": "명사 + (조사) + すら + ない\n동사　て형 + すら + ない",
    "examples": [
      {
        "answer": "すら",
        "word": "体調が悪くて水すら喉を通らない。",
        "mean": "몸이 안 좋아서 물조차 목구멍을 통과하지 않는다."
      },
      {
        "answer": "すら",
        "word": "謝りたいけど会ってすらくれなくなった。",
        "mean": "사과하고 싶지만 만나서 불편해졌어."
      },
      {
        "answer": "すら",
        "word": "残業続きで寝る時間すら確保できない。",
        "mean": "잔업이 계속되어 잘 시간조차 확보할 수 없다."
      },
      {
        "answer": "すら",
        "word": "本当に嫌いな奴には[ 嫌い ]という言葉すら出ない。",
        "mean": "정말 싫어하는 놈에겐 싫다는 말조차 안 나온다."
      },
      {"answer": "すら", "word": "眠くて足し算すらできない。", "mean": "졸려서 덧셈조차 못하다."},
      {
        "answer": "すら",
        "word": "起きてからまだ着替えてもないし, 顔も洗ってすらない。",
        "mean": "일어나서 아직 옷 갈아입지도 않았고 세수도 안 해."
      },
      {
        "answer": "すら",
        "word": "笑ってるところも可愛いが, 怒っているところすら可愛い。",
        "mean": "웃는 있는 것도 귀엽지만 화난 것조차 귀여워."
      },
      {
        "answer": "すら",
        "word": "私はスマホすら満足に使えない機械音痴だ。",
        "mean": "나는 스마트폰조차 만족스럽게 사용할 수 없는 기계치야."
      },
      {
        "answer": "すら",
        "word": "料理したことはないし, 包丁すらも持ったことがない。",
        "mean": "요리해본 적도 없고 칼조차 들어본 적이 없어."
      },
      {
        "answer": "すら",
        "word": "冷静に話し合いすらできないようなら, 交渉はできません。",
        "mean": "냉정하게 대화조차 못할 것 같으면 협상은 할 수 없습니다."
      },
      {"answer": "すら", "word": "夢ですらモテない。", "mean": "꿈에서조차 인기가 없다."},
      {
        "answer": "すら",
        "word": "真面目にやっている人が損をするこの社会は, 正直おかしいとすら思っている。",
        "mean": "성실하게 하는 사람이 손해를 보는 이 사회는 솔직히 이상하다고까지 생각한다."
      }
    ]
  },
  {
    "id": 38,
    "grammar": "~さえ~ば",
    "means": "~만 ~하면",
    "description":
        "어떤 한 가지 조건이 충족되면 그 이외의 것도 성립한다는 것을 나타낸다.\n\n반대로 그 한 가지 조건이 충족되지 않으면 모든 것이 성립되지 않는다.",
    "connectionWays":
        "동사 ます형 + 가정법ば\nい형용사 어간 + 가정법ば\nな형용사 어간 + 가정법ば\n명사 + 가정법ば",
    "examples": [
      {
        "answer": "さえあれば",
        "word": "メールアドレスさえあれば, 誰でも登録できます。",
        "mean": "이메일 주소만 있으면 누구나 등록할 수 있습니다."
      },
      {
        "answer": "さえあれば",
        "word": "きっかけさえあれば, 人はいつでも変わることができる。",
        "mean": "계기만 있으면 사람은 언제든지 변할 수 있다."
      },
      {
        "answer": "さえいれば",
        "word": "悲しみを分かち合える友達さえいれば, 辛い事があっても乗り越えられる。",
        "mean": "슬픔을 나눌 수 있는 친구만 있다면 힘든 일이 있어도 이겨낼 수 있다."
      },
      {
        "answer": "かれば",
        "word": "この問題さえ分かれば満点だったのに。",
        "mean": "이 문제만 알면 만점이었는데."
      },
      {
        "answer": "掴めれば",
        "word": "この仕事はやり方やコツさえ掴めれば誰にだってできる。",
        "mean": "이 일은 방법이나 요령만 알면 누구나 할 수 있다."
      },
      {
        "answer": "さえすれば",
        "word": "辛くても生きていさえすれば人生はどうにかなるものだ。",
        "mean": "힘들어도 살기만 하면 인생은 어떻게 되는 법이다."
      },
      {
        "answer": "ければ",
        "word": "バイトさえ無ければすぐにでも君に会いにいくつもりだった。",
        "mean": "아르바이트만 없다면 당장이라도 널 보러 갈 생각이었어."
      },
      {
        "answer": "さえすれば",
        "word": "レポートの内容に関わらず, 提出さえすれば単位がもらえる。",
        "mean": "리포트 내용에 상관없이 제출만 하면 학점을 받을 수 있다."
      },
      {
        "answer": "さえあれば",
        "word": "暇さえあればアニメを見ている。",
        "mean": "틈만 나면 애니메이션을 보고 있다."
      },
      {
        "answer": "ければ",
        "word": "金欠だから, 時給さえ高ければどんな仕事にでも今すぐ行きたい。",
        "mean": "돈이 부족하니 시급만 비싸면 무슨 일이든 당장 가고 싶다."
      }
    ]
  },
  {
    "id": 39,
    "grammar": "~しか~ない",
    "means": "~밖에 ~ 없다",
    "description":
        "명사나 수량사 뒤에 붙어서 사물이 한정적이라는 것을 나타낸다.\n\n화자의 불만이나 안타까운 감정을 포함.\n\n더 강조하는 표현으로는 [だけしか~ない]가 있다.\n\n수량이 적은 것을 객관적이고 불만의 감정을 포함하지 않고 나타내려면 [~だけ]를 사용.",
    "connectionWays": "명사 (+조사) + しか ~ ない",
    "examples": [
      {
        "answer": "しか",
        "word": "お互い忙しくて, １ヶ月で１回しか会えていない。",
        "mean": "서로 바빠서 한달에 한번밖에 못봤어."
      },
      {"answer": "しか", "word": "雑誌でしか見たことが無い。", "mean": "잡지에서만 봤다."},
      {
        "answer": "しか",
        "word": "彼は手伝いもせずに文句しか言わない。",
        "mean": "그는 도와주지도 않고 불평밖에 하지 않는다."
      },
      {
        "answer": "しかない",
        "word": "出発まであと１０分しかない。",
        "mean": "출발까지 앞으로 10분밖에 안 남았어."
      },
      {
        "answer": "しか",
        "word": "事前に予約した方しか食べられない限定スイーツ。",
        "mean": "미리 예약하신 분만 먹을 수 있는 한정 디저트."
      },
      {
        "answer": "しかいなかった",
        "word": "今回の試験で, 満点は１人しかいなかった。",
        "mean": "이번 시험에서 만점은 1명밖에 없었다."
      },
      {
        "answer": "しか",
        "word": "一社しか受けていないので, 落ちてしまったら滑り止めもない。",
        "mean": "한 회사 밖에 면접 보지 않았기 때문에 떨어져 버리면 갈 회사가 없다 (의역)"
      },
      {
        "answer": "しか",
        "word": "注文したものは家まで送ってくれず, コンビニでしか受け取れないらしい。",
        "mean": "주문한 물건은 집까지 데려다주지 않고 편의점에서만 받을 수 있다고 해."
      },
      {
        "answer": "だけしか",
        "word": "若い時は”今だけしかできないこと”になかなか気付けない。",
        "mean": "젊었을 때는 \"지금밖에 할 수 없는 것\"을 좀처럼 눈치채지 못한다."
      },
      {"answer": "しかない", "word": "財布の中には５００円しかない。", "mean": "지갑 속에는 500엔밖에 없다."}
    ]
  },
  {
    "id": 40,
    "grammar": "しかない",
    "means": " ~밖에 없다",
    "description":
        "다른 방법이나 선택지가 없고 그 외 가능성도없다 라는 의미를 나타낸다.\n\n[~しかない] 에는 비관적인 뉘앙스가 포함되지만 일상 대화에서는 긍정적인 의미로도 사용될 수 있다\n\n플러스의 의미로 사용되는 비슷한 문형에 [ただ~あるのみだ] 가 있다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {"answer": "しかない", "word": "寂しいけど我慢するしかない。", "mean": "외롭지만 참을 수 밖에 없어."},
      {
        "answer": "しかありません",
        "word": "先輩には感謝しかありません。",
        "mean": "선배님께는 감사밖에 없어요."
      },
      {
        "answer": "しかないでしょう",
        "word": "今なら半額なんだから行くしかないでしょう。",
        "mean": "지금이라면 반값이니까 갈 수밖에 없잖아요."
      },
      {
        "answer": "するしかない",
        "word": "他人に教えてもらったとしても, 結局は自分で試行錯誤するしかない。",
        "mean": "남에게 배운다고 해도 결국은 스스로 시행착오를 겪을 수밖에 없다."
      },
      {
        "answer": "しかない",
        "word": "ここまで来たら, もうやるしかない。",
        "mean": "여기까지 오면 이제 하는 수밖에 없어."
      },
      {
        "answer": "しかなくなった",
        "word": "自転車が壊れてしまい, 歩いて帰るしかなくなった。",
        "mean": "자전거가 고장나서 걸어서 돌아갈 수밖에 없게 되었다."
      }
    ]
  },
  {
    "id": 41,
    "grammar": "명사 + 次第だ",
    "means": "~에 달려 있다, ~에 달려있다",
    "description": "결과나 상황의 변화가 그 자체의 성질이나 의향에 맡겨져 있음을 나타낸다.",
    "connectionWays": "명사 +　次第だ",
    "examples": [
      {
        "answer": "次第です",
        "word": "信じるか信じないかはあなた次第です。",
        "mean": "믿느냐 안 믿느냐는 당신에게 달려 있어요."
      },
      {
        "answer": "次第で",
        "word": "お米は天候次第で収穫量が大きく影響される。",
        "mean": "쌀은 날씨에 따라 수확량이 크게 영향을 받는다."
      },
      {"answer": "次第で", "word": "努力次第で人生は変わる。", "mean": "노력에 따라 인생은 달라진다."},
      {"answer": "次第だ", "word": "全ては結局自分次第だ。", "mean": "모든 것은 결국 자신에게 달렸다."},
      {
        "answer": "次第ですが",
        "word": "来年も旅してみようかなと思ってる。貯金次第ですが。",
        "mean": "내년에도 여행해볼까 생각중이야.저금하기 나름입니다만."
      },
      {
        "answer": "次第",
        "word": "大雨で被災した方々, もうこれ以上被害が無ければいいんですが, こればかりはお天道様次第ですね。",
        "mean": "폭우로 피해를 입은 분들, 이제 더 이상 피해가 없었으면 좋겠습니다만, 이것만은 천도님 나름이네요."
      },
      {
        "answer": "次第である",
        "word": "他人を思いやれるような子供に育つかどうかは, ひとえに親次第である。",
        "mean": "다른 사람을 배려할 수 있는 아이로 자랄지는 전적으로 부모에게 달려 있다."
      },
      {
        "answer": "次第です",
        "word": "医者[ 食欲はありますか？ ]　患者[ おかず次第です ]",
        "mean": "의사: \"식욕 있어요?\" 환자: \"반찬 나름이에요.\""
      },
      {
        "answer": "次第です",
        "word": "彼と結婚するかどうかは, 体の相性次第です。",
        "mean": "그와 결혼할지 말지는 몸의 궁합에 달려 있습니다."
      },
      {
        "answer": "次第で",
        "word": "状況は自分の行動力次第でいくらでも変えられます。",
        "mean": "상황은 자신의 행동력에 따라 얼마든지 바꿀 수 있습니다."
      }
    ]
  },
  {
    "id": 42,
    "grammar": "ます형 + 次第",
    "means": "~하는대로, ~하자마자",
    "description":
        "순접 가정 조건 표현.\n\n움직이는 형태나 동작성 명사에 접속해, 전건이 성립했을 경우, 즉시 후건을 실시하는 것을 나타낸다.\n\n일상 대화에서는 잘 사용되지 않으며 주로 비즈니스 등의 상황에서 사용.",
    "connectionWays": "동사 ます + 次第, ~する\n동작성 명사 次第, ~する",
    "examples": [
      {
        "answer": "でき次第",
        "word": "準備でき次第また連絡致します。",
        "mean": "준비되는 대로 다시 연락드리겠습니다."
      },
      {
        "answer": "次第",
        "word": "数量限定販売商品の為, 在庫無くなり次第終了となります。",
        "mean": "수량 한정 판매 상품이므로 재고가 소진되는 대로 종료됩니다."
      },
      {"answer": "終わり次第", "word": "仕事終わり次第伺います。", "mean": "일 끝나는 대로 찾아뵙겠습니다."},
      {
        "answer": "まとまり次第",
        "word": "話がまとまり次第, 追ってご連絡いたします。",
        "mean": "이야기가 마무리되는 대로 추후 연락드리겠습니다."
      },
      {
        "answer": "でき次第",
        "word": "入金確認でき次第, 売買契約成立とし, 商品を発送致します。",
        "mean": "입금확인 되는대로 매매계약 성립하고 상품 발송하겠습니다."
      },
      {
        "answer": "ができ次第",
        "word": "保険証は本人確認ができ次第, 即日交付します。",
        "mean": "보험증은 본인 확인이 되는 대로 당일 교부합니다."
      },
      {
        "answer": "集まり次第",
        "word": "メンバーが集まり次第, 会議を始めよう。",
        "mean": "멤버들 모이는 대로 회의를 시작하자."
      },
      {
        "answer": "決まり次第",
        "word": "同窓会の場所や日程は参加者が決まり次第決定します。",
        "mean": "동창회 장소나 일정은 참가자가 정해지는 대로 결정합니다."
      },
      {
        "answer": "落ち着き次第",
        "word": "まだまだ忙しい日々が続きますが, お互い落ち着き次第飲みに行きましょう。",
        "mean": "아직 바쁜 나날이 계속되지만, 서로 진정되는 대로 마시러 갑시다."
      }
    ]
  },
  {
    "id": 43,
    "grammar": "동사 사전형 +次第",
    "means": " ~한 것이다 (어떤 이유가 있어 이런 결과가 된 것이다)",
    "description":
        "자신이 그 행위를 하게 된 경위, 일의 경과나 이유, 사정을 설명하거나 할 때 사용.\n\n[ ~次第です ] 라고 단언하는 형태로 사용되는 경우가 많다.\n\n일상 대화에서는 많이 사용되지 않으며 주로 비즈니스 등의 장면",
    "connectionWays": "동사 사전형 + 次第だ",
    "examples": [
      {
        "answer": "した次第です",
        "word": "そうしろと言われたので, その通りにした次第です。",
        "mean": "그렇게 하라고 하셔서 그대로 한 것 입니다."
      },
      {
        "answer": "次第でございます",
        "word": "丁寧なご対応をしていただき, 感謝申し上げる次第でございます。",
        "mean": "친절하게 응대해 주셔서 감사드리는 것 입니다."
      },
      {
        "answer": "した次第です",
        "word": "お聞きしたいことがあり, コメントした次第です。",
        "mean": "여쭤보고 싶은 게 있어서 댓글을 작성 한 것입니다."
      },
      {
        "answer": "した次第です",
        "word": "今日は珍しく昼間に起きたけど, 私は昼間は活動できないんだと痛感した次第です。やっぱり夜型だって確信しました。",
        "mean":
            "오늘은 드물게 낮에 일어났지만, 저는 낮에는 활동할 수 없다는 것을 절감한 것 입니다.역시 밤형이라고 확신했어요."
      },
      {
        "answer": "次第です",
        "word": "あまり詳しいことを考えずに株を買ってしまいました。もうちょっと考えればよかったと後悔してる次第です。",
        "mean": "별로 자세한 생각을 하지 않고 주식을 사 버렸어요.조금만 더 생각할 걸 후회하는 바입니다."
      },
      {
        "answer": "した次第です",
        "word": "面白い話が聞けました。自分はそんなことも知らなかったと驚愕した次第です。",
        "mean": "재미있는 이야기를 들을 수 있었습니다.자신은 그런 것도 몰랐다고 경악한 바입니다."
      },
      {
        "answer": "次第でございます",
        "word": "電話では詳しい話ができないと思い, 直接伺った次第でございます。",
        "mean": "전화로는 자세한 이야기를 할 수 없을 것 같아 직접 찾아뵙게 되 것입니다."
      },
      {
        "answer": "次第です",
        "word": "マスコミには視聴者の不安を煽るだけではなく, 正しい情報を広めて欲しいと思う次第です。",
        "mean": "언론에는 시청자의 불안을 부추길 뿐만 아니라 올바른 정보를 퍼뜨렸으면 하는 바입니다."
      },
      {
        "answer": "次第です",
        "word":
            "今回熱中症で倒れて気づきました。夏場の水分補給は具合が悪くなってからではもう遅い, 頻繁に行わなければいけないなと思った次第です。",
        "mean":
            "이번에 열사병으로 쓰러져서 깨달았어요.여름철 수분 보충은 상태가 나빠지고 나서는 이미 늦다, 자주 실시하지 않으면 안 된다고 생각한 바입니다."
      },
      {
        "answer": "次第です",
        "word": "このアイドルグループはこんなにもファンを大事にする細かい配慮をしているのかと感動した次第です。",
        "mean": "이 아이돌 그룹은 이렇게 팬들을 아끼는 세심한 배려를 하고 있는지 감동한 바입니다."
      }
    ]
  },
  {
    "id": 44,
    "grammar": "~末(に) / 末の",
    "means": "~한 끝에",
    "description":
        "여러가지 어려움을 거친 후의 좋은 결과와 중립적인 결과를 나타내어 결과에 도달하기까지의 과정의 길이와 어려움을 강조하고 있다.\n\n비슷한 문형에 [~あげく] 있는데, 이쪽은 나쁜 결과에 대해서 사용됩니다.",
    "connectionWays": "명사 +の＋末(に)\n동사 과거형 + 末(に)",
    "examples": [
      {
        "answer": "末に",
        "word": "原材料の価格高騰の為, 迷った末に今回の値上げを決断しました。",
        "mean": "원자재 가격 급등 때문에 망설인 끝에 이번 가격 인상을 결정했습니다."
      },
      {
        "answer": "末に",
        "word": "悩みに悩んだ末, 親元を離れて留学することに決めた。",
        "mean": "고민 끝에 부모 곁을 떠나 유학을 가기로 결정했다."
      },
      {
        "answer": "の末に",
        "word": "白熱した議論の末に, 両親は猫を飼うことを許してくれた。",
        "mean": "열띤 논의 끝에 부모님은 고양이를 키우는 것을 허락해 주셨다."
      },
      {
        "answer": "末に",
        "word": "長い時間考えた末に今の考えがある。",
        "mean": "오랜 시간 생각 끝에 지금 생각이 있어."
      },
      {
        "answer": "の末に",
        "word": "プロの技術は弛まぬ努力と鍛錬の末に成り立つ。",
        "mean": "프로의 기술은 끊임없는 노력과 단련 끝에 이루어진다."
      },
      {
        "answer": "末の",
        "word": "本人が色々考えた末の結論は誰にも否定する権利はない。",
        "mean": "본인이 여러모로 생각한 끝에 결론은 누구에게도 부정할 권리가 없다."
      }
    ]
  },
  {
    "id": 45,
    "grammar": "~せいで / せいか / せいだ / せいにする",
    "means": "탓에 , 탓으로 / 탓인지 / 탓이다 / 탓이다",
    "description":
        "전항에 원인을, 후항에는 그 원인으로부터 발생한 좋지 않은 결과를 기술한다.\n\n나쁜 결과나 나쁜 원인을 나타낼 때 사용하며 화자의 아쉬움이나 후회하는 마음을 나타낸다.다.\n\n[~を~のせいにする, ~のは~のせいだ] 등의 형태로 사용된다.\n\n비슷한 문법 [~おかげで / おかげだ] 에는 비꼬는 용법은 없다",
    "connectionWays": "명사 접속형에 따름",
    "examples": [
      {"answer": "せいで", "word": "雨降ったせいでめっちゃ寒い。", "mean": "비오는 바람에 엄청 추워."},
      {
        "answer": "せいで",
        "word": "好き嫌いが多いせいで, 外食しても食べられるものが少ない。",
        "mean": "호불호가 많은 탓에 외식해도 먹을 수 있는 게 적다."
      },
      {
        "answer": "せいか",
        "word": "徹夜してゲームしていたせいか, 目が痛い。",
        "mean": "밤새워 게임해서 그런지 눈이 아파."
      },
      {
        "answer": "せいか",
        "word": "年を取ったせいか, 涙脆くなってきた。",
        "mean": "나이가 들어서 그런지 눈물이 여리기 시작했다."
      },
      {
        "answer": "せいだ",
        "word": "喉が痛いのは部屋が乾燥しているせいだ。",
        "mean": "목이 아픈 건 방이 건조한 탓이야."
      },
      {
        "answer": "せいだ",
        "word": "夏場の電気代が高いのは, エアコンが古いせいだ。",
        "mean": "여름철 전기세가 비싼 것은 에어컨이 오래된 탓이다."
      },
      {
        "answer": "せいにする",
        "word": "彼は自分にとって都合の悪いことを全て他人のせいにする。",
        "mean": "그는 자신에게 불편한 일을 모두 남의 탓으로 돌린다."
      },
      {
        "answer": "のせい",
        "word": "甘やかされて育てられた人は失敗を人のせいにしがちだ。",
        "mean": "응석받이로 자란 사람은 실패를 남 탓으로 돌리는 경향이 있다."
      },
      {
        "answer": "せいで",
        "word": "慣れない靴で散歩したせいで足が痛い。",
        "mean": "익숙하지 않은 신발로 산책하는 바람에 다리가 아파."
      },
      {
        "answer": "せいで",
        "word": "寝る前にお腹いっぱい食べたせいで, 逆に寝れなくなってしまった。",
        "mean": "자기 전에 배불리 먹은 탓에 거꾸로 잠을 잘 수 없게 되어 버렸다."
      },
      {
        "answer": "せいで",
        "word": "会社で嫌な事があったせいで, つい飲み過ぎてしまった。",
        "mean": "회사에서 싫은 일이 있었던 탓에 그만 과음하고 말았다."
      },
      {
        "answer": "せいで",
        "word": "タバコのせいで, 多くの人が健康を害している。",
        "mean": "담배 때문에 많은 사람들이 건강을 해치고 있다."
      },
      {
        "answer": "せいだ",
        "word": "こんな時間まで寝てるのは, 昨晩仕事で徹夜していたせいだ。",
        "mean": "이런 시간까지 자는 건 어젯밤에 일하느라 밤을 새운 탓이야."
      },
      {
        "answer": "せいで",
        "word": "私は口下手なせいで人をあまりうまく褒めたりできない。",
        "mean": "나는 말주변이 없어서 사람들을 칭찬을 잘 못해."
      },
      {
        "answer": "せいで",
        "word": "私が優柔不断なせいで, チームのみんなにはいつも迷惑をかけている。",
        "mean": "내가 우유부단한 탓에 팀 모두에게 항상 폐를 끼치고 있다."
      },
      {
        "answer": "せいで",
        "word": "脂っこいものが好きなせいで高脂血症を患ってい",
        "mean": "기름진 음식을 좋아하는 탓에 고지혈증을 앓고 있고"
      }
    ]
  },
  {
    "id": 46,
    "grammar": "だけ",
    "means": "1. ~만큼, ~대로\n2. ~하는 데까지 하다",
    "description":
        "주로 객관적인 표현에 사용된다.\n\n그래서 시간이나 정도, 범위 등 수량이 적은 것에 대한 화자의 불만 뉘앙스는 거의 없다.\n\n주관적이고 수량이 적은 것에 대한 불만을 나타내기 위해서는 しかない를 이용해야한다.",
    "connectionWays": "1. 동사 사전형 \n2. 동사 가능형",
    "examples": [
      {
        "answer": "だけ",
        "word": "やるだけやった。あとは結果を待つだけだ。",
        "mean": "할 만큼 했어.이제 결과를 기다리기만 하면 된다."
      },
      {
        "answer": "だけ",
        "word": "ウイルスに感染しないようにできるだけのことはしてるけどやっぱり怖い。",
        "mean": "바이러스에 감염되지 않도록 할 수 있는 만큼은 하고 있지만 역시 무서워."
      },
      {
        "answer": "だけ",
        "word": "試食品を食べるだけ食べて, 商品を買っていかないお客もいる。",
        "mean": "시식품 먹을 만큼 먹고 상품을 사가지 않는 손님도 있다."
      },
      {
        "answer": "だけ",
        "word": "相談したいことがあるんだけど, 聞くだけ聞いてもらえる？",
        "mean": "상의하고 싶은 게 있는데 듣을 만큼 들어줄래?"
      },
      {
        "answer": "だけ",
        "word": "子供作るだけ作って, 育児は祖母に任せる。",
        "mean": "아이 낳을 만큼 만들고 육아는 할머니에게 맡긴다."
      },
      {
        "answer": "だけ",
        "word": "ご飯は炊けるだけ炊いて, 毎回食べたい量に小分けにして冷凍している。食べるときはチンして食べると手間もかからない。",
        "mean":
            "밥은 할 수 있을 만큼 짓고, 매번 먹고 싶은 양으로 소분해서 냉동하고 있다.먹을 때는 돌려 먹으면 손도 덜 간다."
      },
      {
        "answer": "だけ",
        "word": "子供が手に持てるだけのお菓子を持っている。",
        "mean": "아이가 손에 들 수 있을 만큼 과자를 가지고 있다."
      },
      {
        "answer": "だけ",
        "word": "冷蔵庫の中にある材料で餃子を作れるだけ作った。",
        "mean": "냉장고 안에 있는 재료로 만두를 만들 수 있을 만큼 만들었어."
      },
      {
        "answer": "だけ",
        "word": "次の試合では, 出せるだけの力を出すつもりだ。",
        "mean": "다음 경기에서는 낼 수 있는 만큼 힘을 낼 생각이다."
      },
      {
        "answer": "だけ",
        "word": "今度飲み会があるから, 人を集められるだけ集めておいてください。",
        "mean": "다음에 회식이 있으니까 사람들을 모을 수 있을 만큼 모아 두세요."
      },
      {
        "answer": "だけ",
        "word": "好きなものを食べられるだけ食べたい。",
        "mean": "원하는 것을 먹을 수 있는 만큼 먹고 싶어."
      },
      {
        "answer": "だけ",
        "word": "寝れるなら寝れるだけ寝たい。",
        "mean": "잘 수 있다면 잠을 잘 수 있을 만큼 자고 싶다."
      },
      {
        "answer": "だけ",
        "word": "友達からお金を借りられるだけ借りた。",
        "mean": "친구한테 돈을 빌릴 수 있을 만큼 빌렸다."
      },
      {
        "answer": "だけ",
        "word": "本屋さんに行くとトイレに行きたくなるのは私だけですか？",
        "mean": "서점에 가면 화장실에 가고 싶어지는 것은 저뿐입니까?"
      }
    ]
  },
  {
    "id": 47,
    "grammar": "~たら~たで / ~ば~で",
    "means": "~하면 ~하는 대로",
    "description":
        "두 가지 대립된 사물을 들어 어느 쪽이든 동일함을 나타내는 문법.\n\n같은 형식의 과거형을 두 번 사용하여 접속.",
    "connectionWays": "~だったら~だったで　(뒤 문장 생략 가능)\n~たら~たで\n~なら~で\n~れば~で",
    "examples": [
      {
        "answer": "たら",
        "word":
            "[ はい ]って言いながら聞いていたら[ ちゃんと聞いてるのか ]と怒られるし, 何か言ったら言ったで[ 口答えするな ]って怒られるし, どうしたらいいか分からない",
        "mean":
            "네' 하면서 듣다 보면 '제대로 듣고 있냐'고 혼나고, 무슨 말을 하면 말하는 대로 '말대꾸하지 말라'고 혼나고, 어떻게 해야 할지 모르겠어요."
      },
      {
        "answer": "たら",
        "word": "最初はあまり興味なかったけど, 観たら観たで面白かった。",
        "mean": "처음에는 별로 흥미없었는데 보면 보는대로 재밌더라."
      },
      {
        "answer": "なったで",
        "word": "お金持ちになるのは簡単じゃないし, お金持ちになったらなったでお金持ちなりの苦労も待っている。",
        "mean": "부자가 되는 것은 쉽지 않고, 부자가 되면 되는대로 부자 나름의 고생도 기다리고 있다."
      },
      {
        "answer": "たら",
        "word": "すごく眠いのに寝たら寝たですぐ起きてしまう。",
        "mean": "너무 졸린데 자면 자는대로 금방 일어나버려."
      },
      {
        "answer": "入ったで",
        "word": "眠かったのに布団に入ったら入ったでなぜか寝れない。",
        "mean": "졸렸는데 이불에 들어가니 들어간대로 왠지 잠이 안와."
      },
      {
        "answer": "~たら~たで / ~ば~で",
        "word": "初恋の人に会ってみたいけど会ったら会ったで気まずいだろう。",
        "mean": "첫사랑을 만나보고 만나면 만나는대로 어색할거야."
      },
      {
        "answer": "~たら~たで / ~ば~で",
        "word": "エアコンつけっぱなしは健康に悪いかなと思ったけど, 消したら消したで蒸し暑さで寝れないし生命の危機感じる。",
        "mean": "에어컨 틀어놓으면 건강에 안 좋을 것 같은데 끄면 끈대로 무더위에 잠도 못 자고 생명의 위기를 느낀다."
      },
      {
        "answer": "高かったで",
        "word": "声が低めの人も好きです。もちろん高かったら高かったで別の良さもあると思います。",
        "mean": "목소리가 낮은 사람도 좋아해요.물론 높으면 높은대로 다른 장점도 있다고 생각합니다."
      },
      {
        "answer": "だったで",
        "word": "ダメだったらダメだったでまた来年の試験頑張ればいいでしょ。",
        "mean": "안되면 안되는 대로 내년 시험 잘보면 되지."
      },
      {
        "answer": "だったで",
        "word": "一応女の子が欲しいけど, 男の子だったらだったでそれも良い。",
        "mean": "일단 여자아이를 갖고 싶지만 남자아이면 남자아인대로 그것도 좋다."
      },
      {
        "answer": "だったで",
        "word": "あまりに経験豊富だったらだったで嫌だけど, 童貞だったらだったでそれも嫌。",
        "mean": "너무 경험이 많으면 (많은대로) 싫지만 동정이면 동정인대로 그것도 싫어."
      }
    ]
  },
  {
    "id": 48,
    "grammar": "っこない",
    "means": "~할 리가 없다",
    "description":
        "사건이 발생하는 가능성을 강하게 부정하는 표현.\n\n[~はずがない, ~わけがない ]]의 회화체\n\n[どうせ, なんて] 등과 자주 호흥함",
    "connectionWays": "동사ます형",
    "examples": [
      {
        "answer": "っこないんだから",
        "word": "人生はやり直しできっこないんだから, 前を見るしかない。",
        "mean": "인생은 다시 시작할 수 없으니 앞을 보는 수밖에 없다."
      },
      {
        "answer": "っこないだろう",
        "word": "圧倒的な戦力差がある以上どうやっても勝てっこないだろう。",
        "mean": "압도적인 전력차가 있는 이상 어떻게 해도 이길 수 없을 것이다."
      },
      {
        "answer": "っこない",
        "word": "難しい専門用語を並べられたら理解できっこない。",
        "mean": "어려운 전문용어를 나열하면 이해할 수 없다."
      },
      {
        "answer": "っこない",
        "word": "宝くじなんてどうせ当たりっこない。",
        "mean": "복권 따위는 어차피 당첨될 리가 없다."
      },
      {
        "answer": "っこない",
        "word": "そんな多い人数集まりっこない。",
        "mean": "그렇게 많은 인원이 모일 리가 없어."
      },
      {
        "answer": "っこない",
        "word": "今からプロ野球選手になる夢なんて叶いっこない。",
        "mean": "지금부터 프로야구 선수가 되는 꿈은 이룰 수 없다."
      },
      {
        "answer": "っこない",
        "word": "他人である限り他人の気持ちなんて分かりっこない。",
        "mean": "남인 한 남의 기분 따위는 알 수 없다."
      },
      {
        "answer": "っこない",
        "word": "仮に正しくても, 言い方が不適切だったら伝わりっこない。",
        "mean": "설령 옳더라도 말투가 부적절하다면 전달될 수 없다."
      },
      {
        "answer": "っこない",
        "word": "あの人と付き合いたいなんてそんな夢みたいな話, 叶いっこないよ。",
        "mean": "그 사람과 사귀고 싶다니 그런 꿈같은 이야기, 이루어질 수 없어."
      },
      {"answer": "っこない", "word": "こんな問題できっこない。", "mean": "이런 문제 할 수가 없어."}
    ]
  },
  {
    "id": 49,
    "grammar": "っぱなし",
    "means": "~한 채로",
    "description":
        "1. 본래 해야 할 일을 방치하고 그 상태가 지속되고 있는 것\n\n2.어떤 상태가 지속되고 있는 것\n\n두 경우 모두 화자의 사물에 대한 부정적인 뉘앙스가 있기 때문에 좋지 않은 일에 사용하는 경우가 많다.",
    "connectionWays": "동사ます형",
    "examples": [
      {
        "answer": "っぱなしで",
        "word": "車に鍵を差しっぱなしで買い物に行ってしまった。",
        "mean": "차에 열쇠를 꽂은 채 쇼핑하러 가버렸다."
      },
      {"answer": "っぱなしで", "word": "電気をつけっぱなしで寝た。", "mean": "불을 켜놓고 잤다."},
      {
        "answer": "っぱなしにした",
        "word": "換気のため窓を開けっぱなしにしたせいで空き巣に入られた。",
        "mean": "환기를 위해 창문을 열어둔 탓에 빈집에 들어갔다."
      },
      {
        "answer": "っぱなし",
        "word": "車上荒らしが多発していますので, 車内に荷物を置きっぱなしにしないようにしましょう。",
        "mean": "차량 내부의 난폭함이 많이 발생하고 있기 때문에, 차내에 짐을 놓아 두지 않도록 합시다."
      },
      {
        "answer": "っぱなし",
        "word": "あの変顔を見てからずっと笑いっぱなしだった。",
        "mean": "저 이상한 얼굴을 보고 나서 계속 웃기만 했어."
      },
      {
        "answer": "っぱなし",
        "word": "ずっと親に迷惑かけっぱなしなので, いつか親孝行したい。",
        "mean": "계속 부모님께 폐를 끼치고 있으니 언젠가 효도하고 싶다."
      },
      {
        "answer": "きっぱなしだ",
        "word": "先月から休みがなくずっと働きっぱなしだ。",
        "mean": "지난달부터 쉬는 날이 없어서 계속 일하고 있어."
      },
      {
        "answer": "っぱなし",
        "word": "自由席で立ちっぱなしはしんどい。",
        "mean": "자유석에서 계속 서 있기는 힘들어."
      },
      {"answer": "っぱなしで", "word": "座りっぱなしでお尻が痛い。", "mean": "앉아 있어서 엉덩이가 아파."}
    ]
  },
  {
    "id": 50,
    "grammar": "っぽい",
    "means": "~경향이 있다, ~느낌이 있다, ~처럼 보인다, ~하기 쉽다",
    "description":
        "보통은 마이너스 이미지를 가지고 있는 대상에 대해서 사용한다.\n[ イ形容詞語幹＋っぽい ] 에 접속할 수 있는 이 형용사는, [ 安っぽい(싸구려 같다) ] 등 상당히 한정적이다.\n\n(１)　あの服は安い　　　(객관적)\n(２)　あの服は安っぽい　(주관적＋나쁜 인상)\n\n동사 사전형에 접속할 때 추측의 ようだ 혹은 전문의そうだ 와 거의 비슷하다.\n\n[っぽい] 자체는 이 형용사의 활용이 적용된다.",
    "connectionWays": "명사＋っぽい\n동서 ます형＋っぽい\nイ형용사 어간＋っぽい\n동사 사전형＋っぽい",
    "examples": [
      {
        "answer": "っぽい",
        "word": "彼は子供っぽい顔をしている。",
        "mean": "그는 어린애 같은 얼굴을 하고 있다."
      },
      {
        "answer": "っぽい",
        "word": "今日の月は写真で撮ると白っぽいが, 目で見ると赤色だ。",
        "mean": "오늘 달은 사진으로 찍으면 하얗게 보이지만 눈으로 보면 붉은색이다."
      },
      {
        "answer": "っぽい",
        "word": "水を入れ過ぎたのか, ご飯が水っぽい。",
        "mean": "물을 너무 많이 넣었는지 밥이 죽같다."
      },
      {"answer": "っぽい", "word": "今朝からどうも熱っぽい。", "mean": "오늘 아침부터 어쩐지 열이 난다"},
      {
        "answer": "っぽい",
        "word": "湿っぽい話はもう聞きたくない。",
        "mean": "축축한 이야기는 이제 듣고 싶지 않아."
      },
      {"answer": "っぽい", "word": "安っぽい味だけど癖になる。", "mean": "싸구려 맛인데 버릇이 돼."},
      {
        "answer": "っぽくて",
        "word": "歳を取ったからか, 最近忘れっぽくて困っている。",
        "mean": "나이가 들어서 그런지 요즘 건망증이 심해서 곤란하다."
      },
      {"answer": "っぽい", "word": "彼女は怒りっぽい人だ。", "mean": "그녀는 화를 잘 내는 사람이다."},
      {
        "answer": "っぽい",
        "word": "飽きっぽい性格なので, 一つのことが長く続かない。",
        "mean": "싫증을 잘 내는 성격이라 한 가지 일이 오래 가지 않는다."
      },
      {
        "answer": "っぽい",
        "word": "彼の話は表情から見てもどうも嘘っぽい。",
        "mean": "그의 말은 표정으로 보아도 어쩐지 거짓말 같다."
      }
    ]
  },
  {
    "id": 51,
    "grammar": "以来",
    "means": "~한 이후, ~한 후",
    "description":
        "~하고 나서 지금까지 ~쭉 이라는 표현.\n\n발생한지 아직 시간이 얼마 지나지 않으면 사용할 수 없다.\n\n또한 후항에서는 반드시 계속된 상태를 서술한다. \n\n연속적인 동작이나 새로 발생한 동작을 말할 수 없다.",
    "connectionWays": "명사 직접 접속\n동사 て형",
    "examples": [
      {
        "answer": "以来",
        "word": "彼には中学以来会ってなかったけど全然変わっていなかった。",
        "mean": "그는 중학교 이후로 만나지 못했지만 전혀 변하지 않았다."
      },
      {
        "answer": "以来",
        "word": "北海道は高校の修学旅行以来行っていない。",
        "mean": "홋카이도는 고등학교 수학여행 이후 가지 않았다."
      },
      {
        "answer": "以来",
        "word": "親とは家出して以来一度も会ってない。",
        "mean": "부모님과는 가출한 이후로 한 번도 못 봤어."
      },
      {
        "answer": "以来",
        "word": "フラれて以来, ずっと落ち込んでいる。",
        "mean": "차인 이후로 계속 우울하다."
      },
      {
        "answer": "以来",
        "word": "入社以来, 年末年始は一度も休めたことがない。",
        "mean": "입사 이후 연말연시에는 한 번도 쉰 적이 없다."
      },
      {
        "answer": "以来",
        "word": "友達から大学の時に借りて以来, この本はずっとうちの本棚に置かれている。",
        "mean": "친구에게 대학 때 빌린 이후로 이 책은 계속 우리 책장에 놓여 있다."
      },
      {
        "answer": "以来",
        "word": "先月定年退職して以来, 悠々自適な生活を送っている。",
        "mean": "지난달 정년퇴직한 이후 유유자적한 생활을 하고 있다."
      },
      {
        "answer": "以来",
        "word": "今日は仕事始めて以来最高の激務だ。",
        "mean": "오늘은 일 시작한 이래 최고의 격무다."
      }
    ]
  },
  {
    "id": 52,
    "grammar": "~てからでないと / てからでなければ",
    "means": "~한 후가 아니면",
    "description":
        "전항의 조건이 달성되지 않으면 일의 실현이 불가능한 것, 혹은 뭔가 좋지 않은 사태가 발생하는 것을 나타낸다.\n이 때, 전항은 후항의 전제 조건이 된다.\n후항에서는, 대부분은 좋지 않은 내용이 온다.",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "からでないと",
        "word": "まずはやってみてからでないと, できるかできないかは分からない。",
        "mean": "일단 해봐야 가능할지 안될지 모르겠어."
      },
      {
        "answer": "からでないと",
        "word": "入り口で入場券を買ってからでないと入ることはできません。",
        "mean": "입구에서 입장권을 사야 들어갈 수 있어요."
      },
      {
        "answer": "からでなければ",
        "word": "信頼関係が築けてからでなければできないことがある。",
        "mean": "신뢰관계가 구축되고 나서가 아니면 할 수 없는 일이 있다."
      },
      {
        "answer": "からでないと",
        "word": "この作業はさすがに慣れてからでないと危険が伴う。",
        "mean": "이 작업은 역시 익숙해지고 나서가 아니면 위험이 따른다."
      },
      {
        "answer": "からでなければ",
        "word": "確認してからでなければはっきりお答えできません。",
        "mean": "확인 후가 아니면 확답드릴 수 없습니다."
      },
      {
        "answer": "からじゃないと",
        "word": "様子見てからじゃないと判断できない。",
        "mean": "상황을 보고 나서가 아니면 판단할 수 없어."
      },
      {
        "answer": "からじゃないと",
        "word": "給料が入ってからじゃないと新しいソファーは買えない。",
        "mean": "월급이 들어가고 나서가 아니면 새 소파를 살 수 없어."
      },
      {
        "answer": "からじゃないと",
        "word": "両親に相談してからじゃないと決められません。",
        "mean": "부모님과 상의하고 나서가 아니면 결정할 수 없어요."
      }
    ]
  },
  {
    "id": 53,
    "grammar": "~てたまらない",
    "means": "너무 ~하다, ~해서 참을 수 없다",
    "description":
        "감정 / 감각을 나타내는 말에 대해, 그것들이 참을 수 없는 정도임을 나타낸다.\n辛くて辛くてたまらない 등 두번 나열해서 강조하는 표현도 많다.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "でたまらない",
        "word": "来年の春が楽しみでたまらない。",
        "mean": "내년 봄이 기다려져 죽겠다."
      },
      {
        "answer": "でたまらない",
        "word": "一人は暇でたまらない。",
        "mean": "한 사람은 한가해서 견딜 수 없다."
      },
      {
        "answer": "でたまらない",
        "word": "暑いしジメジメしてるし不快でたまらない。",
        "mean": "덥고 습하고 불쾌해 죽겠어."
      },
      {
        "answer": "てたまらない",
        "word": "彼は体臭が臭くてたまらない。",
        "mean": "그는 체취가 나서 견딜 수 없다."
      },
      {"answer": "てたまらない", "word": "手が痒くてたまらない。", "mean": "손이 가려워 죽겠다."},
      {"answer": "てたまらない", "word": "カラオケ行きたくてたまらない。", "mean": "노래방 가고 싶어 죽겠어."},
      {"answer": "てたまらない", "word": "悲しくて寂しくてたまらない。", "mean": "슬퍼서 외로워 죽겠어."},
      {
        "answer": "てたまらない",
        "word": "新しいイヤホン欲しくてたまらない。",
        "mean": "새 이어폰 갖고 싶어 죽겠어."
      },
      {
        "answer": "てたまらない",
        "word": "この料理どうやって作るんだろう。知りたくてたまらない。",
        "mean": "이 요리 어떻게 하지?궁금해 죽겠어."
      },
      {"answer": "てたまらない", "word": "離婚したくてたまらない。", "mean": "이혼하고 싶어 죽겠어."},
      {
        "answer": "てたまらない",
        "word": "辛くて辛くてたまらない時は逃げてもいい。",
        "mean": "매워서 견딜 수 없을 때는 도망쳐도 돼."
      },
      {
        "answer": "てたまらない",
        "word": "もうすぐ同窓会がある。早く昔の友人に会いたくて会いたくてたまらない。",
        "mean": "곧 동창회가 있다.빨리 옛 친구를 만나고 싶어 죽겠어."
      }
    ]
  },
  {
    "id": 54,
    "grammar": "~てもしょうがない / てもしかたがない / てもしようがない",
    "means": " ~해서 어쩔 수가 없다",
    "description":
        "그 행위를 해도 의미가 없음을 나타낸다.\n\n상태성 단어에 접속하면 그 상태에 이르는 데는 그만한 이유가 있으므로 어쩔 수 없음을 나타낸다.\n\n[しょうがない ]]는 단독으로도 사용할 수 있다.\n\n[しょうがない] 가 제일 회화체적인 표현이며 ても, でも는 회화체로 たって,だって 로 사용할 수 있다.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "しょうがない",
        "word": "自分と他者は違うのだから, 比べたってしょうがない。",
        "mean": "나와 다른 사람은 다르니 비교해도 소용없다."
      },
      {"answer": "しょうがない", "word": "頑張ったってしょうがない。", "mean": "열심히 해봤자 소용없어."},
      {
        "answer": "しょうがない",
        "word": "こんな世の中, 生きていてもしょうがない。",
        "mean": "이런 세상 살아도 소용없다."
      },
      {
        "answer": "しょうがない",
        "word": "文句や不満ばかり言っていてもしょうがない。",
        "mean": "불평이나 불만만 늘어놓아도 소용없다."
      },
      {
        "answer": "しょうがない",
        "word": "安いから不味くてもしょうがない。",
        "mean": "싸니까 맛없어도 소용없어."
      },
      {
        "answer": "しょうがない",
        "word": "考えてもしょうがないことは考えない。",
        "mean": "생각해도 소용없는 일은 생각하지 않는다."
      },
      {
        "answer": "しょうがない",
        "word": "君にはまだ伝えてなかったことだから, 知らなくてもしょうがないよ。",
        "mean": "너한테는 아직 전하지 않은 일이니까 몰라도 소용없어."
      },
      {
        "answer": "しょうがない",
        "word": "落ち込んでいてもしょうがない。前を向こう。",
        "mean": "우울해도 소용없다.앞을 저쪽."
      }
    ]
  },
  {
    "id": 55,
    "grammar": "~てばかり / てばかりいる",
    "means": "~만 하고 있다",
    "description": "어떤 사물이나 상태가 반복되고 있는 것에 대한 화자의 비판적인 태도를 나타낸다.　",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "ばかりいる",
        "word": "スマホを見てばかりいると目が悪くなりますよ。",
        "mean": "핸드폰만 보고 있으면 눈이 나빠져요."
      },
      {
        "answer": "ばかりいるから",
        "word": "授業中寝てばかりいるから, 単位がもらえなくても文句は言えない。",
        "mean": "수업 중에 잠만 자니까 학점을 못 받아도 불평할 수 없어."
      },
      {
        "answer": "ばかりいないで",
        "word": "ゲームしてばかりいないで宿題しなさい。",
        "mean": "게임만 하지 말고 숙제해."
      },
      {
        "answer": "ばかりだ",
        "word": "あのチームは戦力不足で, いつも負けてばかりだ。",
        "mean": "저 팀은 전력 부족으로 항상 지기만 한다."
      },
      {
        "answer": "ばかりいる",
        "word": "彼は他人を尊重せず, 自分の気持ちを優先してばかりいる。",
        "mean": "그는 남을 존중하지 않고 자신의 기분을 우선시하기만 한다."
      },
      {
        "answer": "ばかりだ",
        "word": "何度告白してもフラれてばかりだ。",
        "mean": "몇 번 고백해도 차이기만 한다."
      },
      {
        "answer": "ばかりで",
        "word": "最近は食っちゃ寝してばかりで体重が増えている。",
        "mean": "요즘은 먹고 잠만 자서 체중이 늘고 있어."
      }
    ]
  },
  {
    "id": 56,
    "grammar": "~てはじめて / てみてはじめて",
    "means": "~해서야 비로소",
    "description":
        "전항에는 어떠한 경험을 말하고, 후항에서는 그 경험을 통해서 겨우 깨달은 것이나 지금까지 주의하지 않았던 것을 깨달은 것을 말한다.\n\n대부분의 경우, 후항에는 [分かる, 知る, できる] 등의 동사가 사용된다.",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "てはじめて",
        "word": "今まで好きっていう感情がよく分からなかったけど, 彼に出会えてはじめて分かったような気がする。",
        "mean": "지금까지 좋아한다는 감정을 잘 몰랐는데, 그를 만나고 나서야 알게 된 것 같아."
      },
      {
        "answer": "てはじめて",
        "word": "指摘されてはじめて間違いに気づいた。",
        "mean": "지적을 받고 나서야 실수를 깨달았다."
      },
      {
        "answer": "てはじめて",
        "word": "実家を離れてはじめて親のありがたみを知った。",
        "mean": "친정을 떠나야만 부모의 고마움을 알았다."
      },
      {
        "answer": "てみてはじめて",
        "word": "子育ての大変さって, やってみてはじめてわかる。",
        "mean": "육아의 어려움은 해봐야 안다."
      },
      {
        "answer": "てみてはじめて",
        "word": "飼ってみてはじめて自分が猫アレルギーだと気づいた。",
        "mean": "키워보고 나서야 내가 고양이 알레르기라는 것을 깨달았다."
      }
    ]
  },
  {
    "id": 57,
    "grammar": "~という (1)",
    "means": "~라고 하는, ~라는 ",
    "description":
        "화자와 듣는 사람 중 어느 한쪽의 이해가 진행되지 않은 경우에 그 사물이나 사람 등을 설명, 정의하는 것을 나타낸다.\n\n회화체로는 [って, っていう] 라고 사용된다.",
    "connectionWays": "문장 보통형 +　という + 명사",
    "examples": [
      {
        "answer": "という",
        "word": "佐藤さんという人から電話が来ていましたよ。",
        "mean": "사토(佐藤) 씨라는 사람으로부터 전화가 왔었어요."
      },
      {
        "answer": "という",
        "word": "来週この小説の冒頭部分を暗唱するという試験がある。",
        "mean": "다음 주에 이 소설의 첫 부분을 암송한다는 시험이 있어."
      },
      {
        "answer": "って",
        "word": "[ 来週試験があるってこと覚えてる？ ]",
        "mean": "다음 주에 시험이 있다는 거 기억나?"
      },
      {
        "answer": "という",
        "word": "[ この歌, 何という人が歌ってるの？ ]",
        "mean": "이 노래 뭐라고 불러?'"
      },
      {
        "answer": "っていう",
        "word": "モンサンミッシェルっていうところに一度は行ってみたい。",
        "mean": "몽생미셸이라는 곳에 한 번쯤 가보고 싶어."
      },
      {
        "answer": "という",
        "word": "今朝近くで女性が背後から襲われるという事件があったらしい。",
        "mean": "오늘 아침 근처에서 여성이 배후에서 습격당하는 사건이 있었던 것 같아."
      }
    ]
  },
  {
    "id": 58,
    "grammar": "~という (2)",
    "means": "모든 ~ ",
    "description": "같은 명사를 두번 반복해 사용해서 [ 모든 ~ ] 의 의미",
    "connectionWays": "명사 + という + 명사",
    "examples": [
      {
        "answer": "という",
        "word": "深夜で寝惚けていたからか, 壁という壁にぶつかりながらトイレに行った。",
        "mean": "늦은 밤이라 그런지 벽이라는 벽에 부딪히며 화장실에 갔다."
      },
      {
        "answer": "という",
        "word": "津波によって家という家が全て流されてしまった。",
        "mean": "쓰나미로 인해 집이라는 집이 모두 떠내려가고 말았다."
      },
      {
        "answer": "という",
        "word": "地吹雪で道という道が通行止めになっている。",
        "mean": "눈보라로 길이라는 길이 통제되어 있다."
      },
      {"answer": "という", "word": "床という床が泥まみれだ。", "mean": "마루라는 바닥이 진흙투성이다."},
      {"answer": "という", "word": "星という星が私の味方をしている。", "mean": "별이라는 별이 내 편이다."},
      {
        "answer": "という",
        "word": "銃声がしてから鳥という鳥が逃げて行った。",
        "mean": "총성이 나고 나서야 새라는 새가 도망갔다."
      },
      {
        "answer": "という",
        "word": "豪雨によって道という道ほとんど通行止めになりました。",
        "mean": "폭우로 인해 길이라고 하는 길은 거의 통행이 금지되었습니다."
      },
      {
        "answer": "という",
        "word": "近所の木という木, 全てにセミがいてうるさい。",
        "mean": "동네 나무라는 나무, 모든 것에 매미가 있어서 시끄럽다."
      },
      {
        "answer": "という",
        "word": "床という床, 全部掃除機かけて雑巾掛けして大掃除した。",
        "mean": "바닥이라는 바닥, 전부 청소기 돌리고 걸레질해서 대청소했어."
      },
      {
        "answer": "という",
        "word": "映画で感動しすぎて体中の水という水が出ていった。",
        "mean": "영화에서 너무 감동받아서 온몸의 물이라는 물이 나왔다."
      }
    ]
  },
  {
    "id": 59,
    "grammar": "~ということだ",
    "means": "1. ~라고 한다 (전문)\n2. ~라는 것이다 (결론)",
    "description":
        "1. 전문.\n전문의 そうだ 와 같은 표현\n회화체로 [とのことだ, ~んだって] 로 쓰인다.\n전문의 そうだ 보다 근거 정보와의 거리가 가까운 것이 특징.\n\n2.결론을 말하다\n어떤 상황에서 추측되는, 혹은 얻을 수 있는 결론을 말하는 문법.\n결론을 뒷받침하는 근거는 충분히 신뢰성이 있고 뒤집는 일은 거의 없다.\nつまり 등과 호응하기 쉽고,ってことだ 는 회화체",
    "connectionWays": "문장 보통형 +　ということだ",
    "examples": [
      {
        "answer": "とのことだ",
        "word": "部長は忙しく, 私たちの方でどうにか対処してほしいとのことだ。",
        "mean": "부장님은 바쁘셔서 우리 쪽에서 어떻게든 대처해 달라는 것이다."
      },
      {
        "answer": "ということだ",
        "word": "天気予報によると, 明日は雨が降るということだ。",
        "mean": "일기예보에 따르면 내일은 비가 온다고 한다."
      },
      {
        "answer": "とのことだ",
        "word": "Ａさんは熱があるので, 明日は行けないとのことだ。",
        "mean": "A씨는 열이 나서 내일은 갈 수 없다고 한다."
      },
      {
        "answer": "とのことだ",
        "word": "課長は君に話があるからすぐ来て欲しいとのことだ。",
        "mean": "과장님은 너에게 할 말이 있으니 바로 와달라는 것이다."
      },
      {
        "answer": "ってことだ",
        "word": "彼の姿は今日も見えない。つまりまたサボったってことだ。",
        "mean": "그의 모습은 오늘도 보이지 않는다.그러니까 또 땡땡이 쳤다는 것이다."
      },
      {
        "answer": "ということだ",
        "word": "この２人の答案は全て同じだった。つまりどちらかがカンニングをしたということだ。",
        "mean": "두 사람의 답안은 모두 같았다.즉 어느 한쪽이 커닝을 했다는 것이다."
      },
      {
        "answer": "ということだ",
        "word": "明日から来なくてもいい。やる気がないなら初めから来るなということだ。",
        "mean": "내일부터 안 와도 돼.의욕이 없으면 아예 오지 말라는 거야."
      }
    ]
  },
  {
    "id": 60,
    "grammar": "~といった~ / ~や~といった~",
    "means": "~라는 ",
    "description": "대표적인 것을 몇 가지 들어서 설명할 때 사용하는 문법.\n\n꼽힌 것 이외의 존재도 암시한다.",
    "connectionWays": "명사(や), 명사＋といった＋명사",
    "examples": [
      {
        "answer": "といった",
        "word": "頭皮が固くなると, 抜け毛や頭痛, 肩こりといったトラブルを引き起こす。",
        "mean": "두피가 딱딱해지면 탈모 두통 어깨 결림 같은 트러블을 일으킨다."
      },
      {
        "answer": "といった",
        "word": "ストレス解消には, よく聴く音楽や鳥の鳴き声, 風の音等といった自然の音を聴いてみるのも一つの方法だ。",
        "mean": "스트레스 해소에는 자주 듣는 음악이나 새소리, 바람소리 등 자연의 소리를 들어보는 것도 방법이다."
      },
      {
        "answer": "といった",
        "word": "学歴や経歴などといった要素で人を見ないようになりたい。",
        "mean": "학력이나 경력 등의 요소로 사람을 보지 않도록 하고 싶다."
      },
      {
        "answer": "といった",
        "word": "会計や事務, 人事といった分野は今後ＡＩに仕事を奪われる可能性が高い。",
        "mean": "회계나 사무, 인사 같은 분야는 향후 AI에게 일감을 빼앗길 가능성이 높다."
      },
      {
        "answer": "といった",
        "word": "男ですが, 料理や掃除などといった家事は得意です。",
        "mean": "남자이지만 요리나 청소 같은 집안일은 잘합니다."
      },
      {
        "answer": "といった",
        "word": "社会への不安や不信感といったものが高まっている。",
        "mean": "사회에의 불안이나 불신감이라고 하는 것이 높아지고 있다."
      },
      {
        "answer": "といった",
        "word": "[ 女子力 ]が指すものは, 美容やファッションといった外見に限らない。",
        "mean": "여성력이 가리키는 것은 미용이나 패션 같은 외모에 국한되지 않는다."
      },
      {
        "answer": "といった",
        "word": "神話の生き物や妖怪といった架空の生き物が大好きだ。",
        "mean": "신화의 생물이나 요괴라고 하는 가공의 생물을 매우 좋아한다."
      },
      {
        "answer": "といった",
        "word": "突然起こる片側の手足・顔のマヒや痺れ, 呂律が回らないといった症状は脳卒中のサインです。",
        "mean": "갑자기 일어나는 한쪽 팔다리·얼굴마비나 저림, 여율이 돌아가지 않는 증상은 뇌졸중의 신호입니다."
      },
      {
        "answer": "といった",
        "word": "私の理念や信条といったものを信じてくれる相手とだけビジネスをしたい。",
        "mean": "나의 이념이나 신조 같은 것을 믿어주는 상대와만 비즈니스를 하고 싶다."
      },
      {
        "answer": "といった",
        "word": "春の妖精や冬の妖精といった季節の妖精が現れることで季節が変わっていく。",
        "mean": "봄의 요정이나 겨울의 요정 같은 계절의 요정이 나타나면서 계절이 바뀌어간다."
      }
    ]
  },
  {
    "id": 61,
    "grammar": "~と言っても",
    "means": "~라고 해도 ",
    "description":
        "역접표현.\n전건으로 사실을 인정하고, 후건으로 전건에서 예상되는 결과는 되지 않음을 말한다.\n\n가장 회화체 적인 표현은 [~と言っても, ~とは言っても] 이고, 가장 딱딱한 표현은 [~とは言うものの, ~とは言い条 ]] 이다",
    "connectionWays":
        "명사＋(だ)と言っても\nな형용사 어간＋(だ)と言っても\n동사 사전형＋と言っても\nい형용사 보통형＋と言っても",
    "examples": [
      {
        "answer": "と言っても",
        "word": "いくら美味しいと言っても, 見た目が良くなければ食べたくならない。",
        "mean": "아무리 맛있다고 해도 보기가 좋지 않으면 먹고 싶지 않아."
      },
      {
        "answer": "とは言え",
        "word": "１０月とは言えまだまだ暑い。",
        "mean": "10월이라고는 하지만 아직 덥다."
      },
      {
        "answer": "とは言え",
        "word": "結婚には年の差は関係ないとは言えども, 実際, 世代間のギャップはあるだろう。",
        "mean": "결혼에는 나이 차이는 상관없다지만 실제 세대 차이는 있을 것이다."
      },
      {
        "answer": "とは言うものの",
        "word": "風邪は治った。とは言うものの, 咳で喉を痛めたせいでまだ声が出しづらい。",
        "mean": "감기는 나았다. 하지만 기침으로 목을 다친 탓에 아직 목소리를 내기 힘들다."
      },
      {
        "answer": "とは言い条",
        "word": "厳密には違いがあるとは言い条, 素人目から見ると判断がつくものではない。",
        "mean": "엄밀히 말하면 차이가 있다고는 하지만 아마추어 눈으로 보면 판단이 서지 않는다."
      },
      {
        "answer": "とは言っても",
        "word": "ゲームとは言っても頭を使うのは大事だ。",
        "mean": "게임이라고는 해도 머리를 쓰는 것은 중요하다."
      },
      {
        "answer": "とは言っても",
        "word": "所詮夢だとは言っても, リアルすぎて汗までかいた。",
        "mean": "어차피 꿈이라고는 하지만 너무 리얼해서 땀까지 흘렸다."
      }
    ]
  },
  {
    "id": 62,
    "grammar": "~(か)と思ったら",
    "means": "~라고 생각했더니, ~는가 싶더니",
    "description":
        "예상치 못한 일, 의외의 일이 발생했음을 나타낸다.\n\n화자의 놀라움이나 의외의 감정이 포함된다. 그렇기 때문에 자기 자신의 일에는 사용할 수 없다.\n\n반드시 타인이나 주변 상황에 대해 사용한다.\n\n접속사로 단독으로 사용할 수도 있다.\n\n[(一体)何事かと思ったら, 何が起きたのかと思ったら, 誰かと思ったら, 何かと思ったら] 등 의문사가 표함된 표현은 관용적으로 사용함.",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간\n명사",
    "examples": [
      {
        "answer": "かと思えば",
        "word": "ここ最近暑くなったかと思えば気温が低くかったりの不安定な日が続いてます。",
        "mean": "최근 날씨가 더워지는가 하면 기온이 낮거나 하는 불안정한 날이 계속되고 있습니다."
      },
      {
        "answer": "かと思いきや",
        "word": "雪が降った。かと思いきやすぐに止んだ。",
        "mean": "눈이 왔다. 싶더니 금방 그쳤다."
      },
      {
        "answer": "かと思えば",
        "word": "寒さが緩んだかと思えば, また厳しくなってきた。",
        "mean": "추위가 풀리는가 하면 다시 매서워졌다."
      },
      {
        "answer": "と思ったら",
        "word": "怒られると思ったら慰められた。",
        "mean": "혼날 줄 알았더니 위로를 받았다."
      },
      {
        "answer": "と思ったら",
        "word": "今日こそ髪切りに行くかと思ったら, 雨でした。",
        "mean": "오늘이야말로 머리 자르러 가는 줄 알았는데 비가 왔어요."
      },
      {
        "answer": "と思ったら",
        "word": "お昼ご飯なくて買いに行こうと思ったら店長からお弁当もらった。",
        "mean": "점심 없어서 사러 가려는데 점장님한테 도시락 받았어."
      },
      {
        "answer": "と思ったら",
        "word": "いきなり家に警察きて何事かと思ったら隣人が事件で亡くなったらしい。",
        "mean": "갑자기 집에 경찰 와서 무슨 일인가 했더니 이웃이 사건으로 죽은 것 같아."
      },
      {
        "answer": "と思ったら",
        "word": "何事かと思ったらこういうことだったのか。",
        "mean": "무슨 일인가 했더니 이런 건가."
      },
      {
        "answer": "かと思えば",
        "word": "[ ４ ]は不吉な数字と捉えられがち。かと思えばクローバーのおかげで幸福の意味もある。",
        "mean": "4'는 불길한 숫자로 비춰지기 십상. 그런가 하면 클로버 덕분에 행복의 의미도 있다."
      },
      {
        "answer": "かと思えば",
        "word": "意見が違う人もいるかと思えば, 全く同じ人もいる。人それぞれだ。",
        "mean": "의견이 다른 사람도 있는가 하면 똑같은 사람도 있다.사람마다 다르다."
      }
    ]
  },
  {
    "id": 63,
    "grammar": "~ていたところだ / ~ところに~ / ~ところへ~",
    "means": "~참에",
    "description": "어떤 상태의 지속 중에 일을 진전 시키거나 사태가 일변하는 사건이 발생했음을 나타내는 문법",
    "connectionWays": "동사ていた＋ところだ\n동사 과거형＋ところに / ところへ~\n동사 ている형＋ところに / ところへ~",
    "examples": [
      {
        "answer": "ていたところだ",
        "word": "友人から電話が来た。私もちょうど電話をかけようとしていたところだ。",
        "mean": "친구에게서 전화가 왔다.나도 막 전화하려던 참이야."
      },
      {
        "answer": "ところに",
        "word": "私もちょうど電話をかけようとしていたところに, その友人から電話が来た。",
        "mean": "나도 막 전화를 걸려던 참에 그 친구에게서 전화가 왔다."
      },
      {
        "answer": "ていたところです",
        "word": "差し入れありがとうございます。ちょうど小腹が空いていたところです。",
        "mean": "보내주셔서 감사합니다.마침 출출했던 참입니다."
      },
      {
        "answer": "ところに",
        "word": "ちょうど小腹が空いていたところに差し入れして頂いてありがとうございます。",
        "mean": "마침 출출했던 곳에 넣어주셔서 감사합니다."
      },
      {
        "answer": "ところに",
        "word": "困っていたところに彼女が救いの手を差し伸べてくれた。",
        "mean": "어려움을 겪고 있던 차에 그녀가 구원의 손길을 내밀어 주었다."
      },
      {
        "answer": "ていたところだ",
        "word": "来てくれてよかった。ちょうど君を呼ぼうと思っていたところだ。",
        "mean": "와줘서 다행이다.마침 너를 부르려던 참이야."
      },
      {
        "answer": "ところに",
        "word": "君を呼ぼうを思っていたところにちょうど来てくれてよかった。",
        "mean": "널 부르려던 참에 딱 와줘서 다행이야."
      },
      {
        "answer": "いたところだから",
        "word": "迎えに来てもらって助かった。かなり急いでいたところだから。",
        "mean": "마중나와줘서 다행이다 많이 급했던 참이라."
      },
      {
        "answer": "ところに",
        "word": "かなり急いでいたところに迎えに来てもらって助かった。",
        "mean": "꽤 서두르던 차에 데리러 와줘서 도움이 되었다."
      },
      {
        "answer": "いたところなんです",
        "word": "引き取って頂きありがとうございます。もう不要になったので処理に困っていたところなんです。",
        "mean": "인수해 주셔서 감사합니다.이제 불필요해져서 처리에 어려움을 겪고 있던 참입니다."
      },
      {
        "answer": "ところに",
        "word": "もう不要になったので処理に困っていたところに引き取って頂きありがとうございます。",
        "mean": "더 이상 필요 없게 되어 처리에 어려움을 겪고 있던 중에 인수해 주셔서 감사합니다."
      },
      {
        "answer": "ところへ",
        "word": "困っていたところへ, ちょうど一人の男性が駆け付けてくれた。",
        "mean": "곤란해 하고 있던 참에 마침 한 남자가 달려왔다."
      },
      {
        "answer": "ていたところだ",
        "word": "一人の男性が駆け付けてくれた。ちょうど困っていたところだ。",
        "mean": "한 남자가 달려왔다.마침 곤란했던 참이다."
      }
    ]
  },
  {
    "id": 64,
    "grammar": "どころか",
    "means": " ~은 커녕",
    "description": "화자나 듣는 사람이 믿고 있던 것, 기대했던 것이 사실과 정반대임을 나타낸다.",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간\n명사",
    "examples": [
      {
        "answer": "ところへ",
        "word": "雨は弱まるどころか, ますます強くなってきた。",
        "mean": "비는 약해지기는커녕 점점 강해졌다."
      },
      {
        "answer": "ていたところだ",
        "word": "貯金するどころか, 急な出費で赤字続きだ。",
        "mean": "저축하기는커녕 갑작스러운 지출로 적자가 계속되고 있다."
      },
      {"answer": "どころか", "word": "早退どころか残業だ。", "mean": "조퇴는커녕 야근이다."},
      {
        "answer": "どころか",
        "word": "医者に診てもらったものの, 良くなるどころか悪化してる。",
        "mean": "의사에게 진찰을 받았지만 나아지기는커녕 악화되고 있다."
      },
      {
        "answer": "どころか",
        "word": "一生分どころか, 来世分の運まで使い切ってしまったくらいだ。",
        "mean": "일생분은커녕 내세분 운마저 다 써버렸을 정도다."
      },
      {
        "answer": "どころか",
        "word": "もう３月だというのに, 暖かくなるどころかまだ雪が残ったままだ。",
        "mean": "벌써 3월인데 따뜻해지기는커녕 아직 눈이 남아 있다."
      },
      {
        "answer": "どころか",
        "word": "このプランだと, メリットどころかデメリットの方が大きいと思われます。",
        "mean": "이 플랜이라면 장점은커녕 단점이 더 클 것으로 생각됩니다."
      },
      {
        "answer": "どころか",
        "word": "久しぶりに会った友人は, 顔どころか性別まで変わっていた。",
        "mean": "오랜만에 만난 친구는 얼굴은커녕 성별까지 달라져 있었다."
      }
    ]
  },
  {
    "id": 65,
    "grammar": "~としたら / とすると / とすれば",
    "means": "~라고 하면, ~라고 가정하면",
    "description": "가정 조건과 확정 조건의 용법이다\n\n[~とする, ~とします] 로도 사용함",
    "connectionWays": "동사 사전형 + の\nい형용사 보통형 + の\nな형용사 어간 + なの\n명사 + なの",
    "examples": [
      {
        "answer": "としたら",
        "word": "明日地球が滅びるとしたら何する？",
        "mean": "내일 지구가 망한다면 뭐 할 거야?"
      },
      {
        "answer": "としたら",
        "word": "旅行に行くとしたらどこに行きたい？",
        "mean": "여행을 간다면 어디로 가고 싶어?"
      },
      {
        "answer": "としたら",
        "word": "[ もしあなたがこれまでに泣いたことがないとしたら, あなたの目は美しいはずがないわ。 ]",
        "mean": "만약 당신이 지금까지 운 적이 없다면, 당신의 눈은 아름다울 수 없어요."
      },
      {
        "answer": "とすると",
        "word": "悩みがないとすると, それはたぶん幸せなことなんだと思う。",
        "mean": "고민이 없다면 그건 아마 행복한 일일 거야."
      },
      {
        "answer": "とします",
        "word": "どちらか一人しか救えないとします。あなたは親と恋人どちらを選ぶ？",
        "mean": "어느 한 명밖에 구할 수 없다고 칩시다.너는 부모와 연인 중 어느 쪽을 고를래?"
      },
      {
        "answer": "とすれば",
        "word": "顔面上の下って言われた。嘘じゃないとすれば素直に嬉しい。",
        "mean": "안면 위 아래라고 했어.거짓말이 아니라면 솔직하게 기뻐."
      },
      {
        "answer": "としたら",
        "word": "こんなに練習してもできないとしたら, 才能がないと言わざるを得ない。",
        "mean": "이렇게 연습해도 안 된다면 재능이 없다고 해야 한다."
      },
      {
        "answer": "としたら",
        "word": "このまま学費が払えないとしたら退学するしかない。",
        "mean": "이대로 학비를 낼 수 없다면 퇴학할 수밖에 없다."
      }
    ]
  },
  {
    "id": 66,
    "grammar": "として",
    "means": "~로서",
    "description": "신분이나 입장, 자격, 종류를 나타낸다.\n\n[~といたしまして, ~といたしましても]　는 겸양어.",
    "connectionWays": "명사 직접 접속",
    "examples": [
      {
        "answer": "として",
        "word": "このミスコンでは女性としての容姿の美しさを競うのではなく, 内面の美しさが評価対象となっている。",
        "mean": "미스콘에서는 여성으로서의 외모의 아름다움을 겨루는 것이 아니라 내면의 아름다움이 평가 대상이다."
      },
      {
        "answer": "として",
        "word": "プレゼントされたものを売り払うなんて人としてどうかしてる。",
        "mean": "선물받은 것을 팔아 버리다니 사람으로서 정신이 없다."
      },
      {
        "answer": "として",
        "word": "彼は多趣味で, その１つとして釣りがある。",
        "mean": "그는 취미가 많고, 그 중 하나로 낚시가 있다."
      },
      {
        "answer": "として",
        "word": "[ 抱く ]には, 男性が女性と夜の営みをすることを表す俗語としての意味がある。",
        "mean": "품다는 남자가 여자와 밤샘을 하는 것을 나타내는 속어로서의 의미가 있다."
      },
      {
        "answer": "として",
        "word": "上の者に従う。それが組織としての在り方である。",
        "mean": "윗사람을 따른다. 그것이 조직으로서의 본연의 자세이다."
      },
      {
        "answer": "として",
        "word": "Ａ監督は現役時代, 選手としても素晴らしい功績を残している。",
        "mean": "A 감독은 현역 시절 선수로서도 훌륭한 공적을 남겼다."
      },
      {
        "answer": "として",
        "word": "このウイスキーは消毒液としても使用できます。",
        "mean": "이 위스키는 소독액으로도 사용할 수 있습니다."
      },
      {"answer": "として", "word": "知識としてはあるが経験がない。", "mean": "지식으로는 있지만 경험이 없다."},
      {
        "answer": "といたしまして",
        "word": "詳しい条件といたしましては以下になります。",
        "mean": "자세한 조건은 다음과 같습니다."
      }
    ]
  },
  {
    "id": 67,
    "grammar": "としても",
    "means": "~라고 해도",
    "description":
        "전건의 조건 하에서는 후건이 성립되지 않음을 나타낸다.\n\n뒷건은 좋지 않은 내용이 언급되는 경우가 많다. 그렇기 때문에 후건에는 자주 부정형이 호응함.\n\n[としたって / としたところで / とて] 도 같은 의미이며 とて가 제일 딱딱한 표현\n\n동사에 접속할 때는 과거형, 혹은 [ようとした]의 형태가 되는 경우가 많다.",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간 (だ / である)\n명사 (だ / である)",
    "examples": [
      {
        "answer": "としたって",
        "word": "進学しようとしたって学力がないとできない。",
        "mean": "진학하려고 해도 학력이 없으면 할 수 없다."
      },
      {
        "answer": "としても",
        "word": "行動しないと何も変わらないが, 行動したとしても目標がなければ何も意味を成さない。",
        "mean": "행동하지 않으면 아무것도 변하지 않지만, 행동한다고 해도 목표가 없으면 아무것도 의미를 이루지 못한다."
      },
      {
        "answer": "としたって",
        "word": "辛いことは忘れようとしたって忘れられない。",
        "mean": "힘든 일은 잊으려고 해도 잊을 수 없어."
      },
      {
        "answer": "としても",
        "word": "母は良いとしても, 父は許してくれないはずだ。",
        "mean": "어머니는 좋다고 해도 아버지는 용서해 주지 않을 것이다."
      },
      {
        "answer": "としても",
        "word": "全てが真実だとしても, この目で確かめない限りは信じられない。",
        "mean": "모든 것이 진실이라고 해도 이 눈으로 확인하지 않는 한 믿을 수 없다."
      },
      {"answer": "とて", "word": "誤魔化そうとて無駄だ。", "mean": "속임수를 쓴다고 소용없다."},
      {
        "answer": "としたところで",
        "word": "整形しようとしたところで中身まで変わるわけではない。",
        "mean": "성형한다고 내용물까지 바뀌는 것은 아니다."
      },
      {
        "answer": "としたって",
        "word": "過去は消そうとしたって消せない。",
        "mean": "과거는 지우려고 해도 지울 수 없어."
      }
    ]
  },
  {
    "id": 68,
    "grammar": "~とは (정의)",
    "means": "~라는 것이다",
    "description": "명사에 접속해서 그것이 어떤 것인지 설명함.\n\n회화체는 というのは, というものは 이다",
    "connectionWays": "명사 직접 접속",
    "examples": [
      {
        "answer": "とは",
        "word": "独身者とは, 妻を見つけないことに成功した男である。",
        "mean": "독신자는 아내를 찾지 못하는 데 성공한 남자이다."
      },
      {
        "answer": "とは",
        "word": "奇数とは, ２で割り切れない整数のこと。",
        "mean": "홀수는 2로 나눌 수 없는 정수를 말한다."
      },
      {
        "answer": "とは",
        "word": "自由とは勝ち取るものであって, 与えられるものではない。",
        "mean": "자유는 얻는 것이지 주어지는 것이 아니다."
      },
      {"answer": "とは", "word": "幸せとは何でしょうか。", "mean": "행복이란 무엇일까요?"},
      {"answer": "とは", "word": "決断とは, 一種の賭けである。", "mean": "결단은 일종의 도박이다."},
      {
        "answer": "とは",
        "word": "酒池肉林とは, 非常に贅沢な酒宴のこと。",
        "mean": "주지육림이란 매우 사치스러운 주연을 말한다."
      },
      {"answer": "とは", "word": "人間の欲望とは際限のないものだ。", "mean": "인간의 욕망이란 끝없는 것이다."},
      {"answer": "とは", "word": "才能とは, 自分を信じることだ。", "mean": "재능은 자신을 믿는 것이다."}
    ]
  },
  {
    "id": 69,
    "grammar": "とは (인용)",
    "means": "~라는 것이다",
    "description":
        "상대방이나 다른 사람의 발언, 정보를 인용한다.\n\n후건에서는 그 내용에 대한 어떠한 판단이나 평가한다.\n\n놀라움이나 분노, 의문 등의 감정이 포함되는 경우가 많다.\n\n회화체는 というのは, というものは 이다",
    "connectionWays": "동사보통형\nい형용사 보통형\nな형용사 보통형\n명사",
    "examples": [
      {
        "answer": "とは",
        "word": "[ ごめんなさい ]とは, 何に対しての[ ごめんなさい ]だ？",
        "mean": "미안해요'는 무엇에 대한 '미안해요'다?"
      },
      {
        "answer": "とは",
        "word": "中止になったとは, いったいどういうことですか？",
        "mean": "취소됐다니 대체 무슨 말씀이시죠?"
      },
      {
        "answer": "とは",
        "word":
            "[ この車から血痕は見つかりませんでした, 見つからないということは, つまり犯行に使われたのはこの車ではないということだ ]",
        "mean":
            "이 차에서 혈흔은 발견되지 않았습니다. \"찾을 수 없다는 것은, 즉 범행에 사용된 것은 이 차가 아니라는 것입니다.\""
      },
      {
        "answer": "とは",
        "word": "突然休職するとは, 彼に何かあったんだろうか。",
        "mean": "갑자기 휴직하다니 그에게 무슨 일이 있었던 걸까?"
      },
      {
        "answer": "とは",
        "word": "１１時に寝るとは, 少し早すぎませんか？",
        "mean": "11시에 잠을 잔다니 조금 너무 이른 것 같지 않아요?"
      },
      {
        "answer": "とは",
        "word": "３日も大きいほうが出ていないとは, 薬でも飲んだ方がいいんじゃないですか。",
        "mean": "3일이나 큰 쪽이 나오지 않았다니 약이라도 먹는 것이 좋지 않습니까."
      },
      {
        "answer": "とは",
        "word": "台風が来ているとは, 今初めて聞きました。",
        "mean": "태풍이 오고 있다는 것은 지금 처음 들었습니다."
      },
      {
        "answer": "とは",
        "word": "新しい彼氏ができたとは, もう少し詳しく聞かせて。",
        "mean": "새 남자친구가 생겼다니 좀 더 자세히 들려줘."
      }
    ]
  },
  {
    "id": 70,
    "grammar": "とは (놀람, 의외, 질림)",
    "means": "~다니, ~라니",
    "description":
        "화자의 놀라운 감정을 나타낸다.\n\n뒷건에는 놀라움에서 이어지는 어떤 감정이 서술되지만 생략 가능.\n\n이 용법일 때는 [~なんて, ~な] 등 으로 바꿔 쓸 수 있다.",
    "connectionWays": "동사보통형\nい형용사 보통형\nな형용사 보통형\n명사",
    "examples": [
      {
        "answer": "とは",
        "word": "あの若さ, ５０歳を超えているとは信じられない。",
        "mean": "저 젊음, 50세가 넘었다는 것은 믿을 수 없다."
      },
      {
        "answer": "とは",
        "word": "こんな短期間で結果が出るとは。",
        "mean": "이렇게 단기간에 결과가 나올 줄이야."
      },
      {
        "answer": "とは",
        "word": "年上にタメ口とは, 失礼だと思わないか？",
        "mean": "연상에게 반말이라니 실례라고 생각하지 않아?"
      },
      {
        "answer": "とは",
        "word": "まさか落とした財布が戻ってくるとは。",
        "mean": "설마 잃어버린 지갑이 돌아올 줄이야."
      },
      {"answer": "とは", "word": "あんな天気で海で遊ぶとは…", "mean": "저런 날씨에 바다에서 놀다니.."},
      {"answer": "とは", "word": "彼がこんなにも優しいとは。", "mean": "그가 이렇게 착할 줄이야."},
      {
        "answer": "とは",
        "word": "痴漢されても物怖じしないとは, 恐ろしい人だ。",
        "mean": "치한을 당해도 겁내지 않다니 무서운 사람이다."
      },
      {
        "answer": "とは",
        "word": "そこに気がつくとは, 君才能あるね。",
        "mean": "그걸 깨닫다니, 자네 재능 있네."
      }
    ]
  },
  {
    "id": 71,
    "grammar": "ないことには",
    "means": "~하지 않으면",
    "description":
        "전항은 후항이 성립하는 전제조건으로, 전항이 성립하지 않으면 후항도 성립하지 않음을 나타낸다.\n후항은 반드시 부정형을 취함.",
    "connectionWays": "ない형",
    "examples": [
      {
        "answer": "とは",
        "word": "説明がないことには手が付けられない。",
        "mean": "설명이 없는 것에는 손을 댈 수 없다."
      },
      {
        "answer": "とは",
        "word": "髪の毛の材料となる栄養がないことには髪の毛は生えてこない。",
        "mean": "머리카락의 재료가 되는 영양이 없으면 머리카락은 자라지 않는다."
      },
      {
        "answer": "ないことには",
        "word": "一度確認しないことには, はっきりしたことは申し上げられません。",
        "mean": "한번 확인하지 않고는 확실하게 말씀드릴 수 없습니다."
      },
      {
        "answer": "ないことには",
        "word": "彼がいないことには, この試合に勝てないだろう。",
        "mean": "그가 없으면 이 경기에서 이길 수 없을 것이다."
      },
      {
        "answer": "ないことには",
        "word": "働いてお金を稼がないことには, 独立とは言えない。",
        "mean": "일해서 돈을 벌지 않는 것은 독립이라고 할 수 없다."
      },
      {
        "answer": "ないことには",
        "word": "彼がやったという証拠がないことには何とも言えない。",
        "mean": "그가 했다는 증거가 없는 것에는 뭐라고 말할 수 없다."
      },
      {
        "answer": "ないことには",
        "word": "実際に会って話してみないことには, その人はどんな人かは分からない。",
        "mean": "실제로 만나서 얘기해 보지 않고서는 그 사람이 어떤 사람인지 알 수 없다."
      },
      {
        "answer": "ないことには",
        "word": "お金とは, 使わないことには新しい価値を生み出すこともできない。",
        "mean": "돈은 사용하지 않고는 새로운 가치를 창출할 수도 없다."
      }
    ]
  },
  {
    "id": 72,
    "grammar": "~ずに済む",
    "means": "~하지 않고 끝나다, ~하지 않아도 된다",
    "description":
        "그렇게 하지 않아도 문제가 해결될 수 있음을 나타낸다.\n\n보통은 나쁜 사태를 회피하는 데 사용한다.\n\n회화체로 [ないで済む, なくて済む]를 자주 사용한다.",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "~ずに済む",
        "word": "インフルは息子だけで, 家族にうつらずに済んだ。",
        "mean": "독감은 아들 하나만으로 가족에게 전염되지 않고 끝났다."
      },
      {"answer": "~ずに済む", "word": "周りにバレずに済んだ。", "mean": "주변에 들키지 않고 끝났다."},
      {"answer": "ずに済む", "word": "メモしておけば忘れずに済む。", "mean": "메모해 두면 잊지 않아도 된다."},
      {
        "answer": "ずに済んだ",
        "word": "ちゃんと説明したら怒られずに済んだのではないか。",
        "mean": "제대로 설명했으면 혼나지 않고 끝난 것 아닌가."
      },
      {
        "answer": "なくて済む",
        "word": "amazonさえあれば外出なくて済む。",
        "mean": "amazon만 있으면 외출하지 않아도 된다."
      },
      {
        "answer": "なくて済んでよかった",
        "word": "階段から落ちたけど怪我しなくて済んでよかった。",
        "mean": "계단에서 떨어졌는데 다치지 않아서 다행이야."
      },
      {
        "answer": "なくて済んだ",
        "word": "予約してたおかげで待ち時間が全くなくて済んだ。",
        "mean": "예약한 덕분에 대기시간이 전혀 없어서 끝났어."
      },
      {
        "answer": "なくて済んだ",
        "word": "一時はどうなることかと思ったが何事もなくて済んだ。",
        "mean": "한때는 어떻게 되는 줄 알았는데 아무 일 없이 끝났다."
      }
    ]
  },
  {
    "id": 73,
    "grammar": "~ながら / ながらも",
    "means": "~면서도, ~이지만",
    "description":
        "상반된 동작이나 성질이 동시에 존재함을 말하는 역접의 문법입니다.\n\nしかしながら(그렇지만), 残念ながら(유감스럽게도 ), 嫌々ながら(마지못해 ), 遅ればせながら / 今更ながら(늦었지만)\n는 이 문형을 이용한 관용표현.",
    "connectionWays": "동사ます형\nい형용사 기본형\nな형용사 어간\n명사",
    "examples": [
      {
        "answer": "ながら",
        "word": "日帰りながら, 仙台を満喫できた。",
        "mean": "당일치기로 센다이를 만끽할 수 있었다."
      },
      {"answer": "ながら", "word": "陰ながら応援してます。", "mean": "뒤에서나마 응원할게요."},
      {"answer": "ながら", "word": "残念ながら, 現実は残酷だ。", "mean": "안타깝게도 현실은 참혹하다."},
      {"answer": "ながら", "word": "遅ればせながら, 誕生日おめでとう。", "mean": "늦었지만 생일 축하해."},
      {
        "answer": "ながら",
        "word": "疲れるは疲れるけど, しかしながら体を動かすのは本当に楽しい。",
        "mean": "피곤함은 피곤하지만 그래도 몸을 움직이는 것은 정말 즐거워."
      },
      {
        "answer": "ながらも",
        "word": "あそこは小さいながらも結構良い動物園だと聞いてる。",
        "mean": "거긴 작지만 꽤 좋은 동물원이라고 들었어."
      },
      {
        "answer": "ながらも",
        "word": "眠いながらもかろうじて起きてます。",
        "mean": "졸리면서도 간신히 깨어있어요."
      },
      {
        "answer": "ながら",
        "word": "この曲を昔聞いたとき, 子供ながらに感動したのを覚えてます。",
        "mean": "이 곡을 옛날에 들었을 때 어린 시절에 감동했던 기억이 납니다."
      },
      {
        "answer": "ながら",
        "word": "知っていながら犯す罪には, 知らずに犯す罪よりも重い代償を支払わなければなりません。",
        "mean": "알면서도 저지르는 죄에는 모르고 짓는 죄보다 더 무거운 대가를 치러야 합니다."
      },
      {
        "answer": "ながらも",
        "word": "小さな子供が危ないながらも一生懸命重いドアを開けようとしていた。",
        "mean": "어린 아이가 위험하면서도 열심히 무거운 문을 열려고 하고 있었다."
      }
    ]
  },
  {
    "id": 74,
    "grammar": "~など / なんか / なんて",
    "means": "1. 따위 , 라는\n2. 라고는\n3. 하다니",
    "description":
        "1. 열거\n 어떤 유사한 사물 중에서 가장 대표적인 것을 꼽는 표현.꼽힌 것 이외의 존재도 암시함.\n\n2. 경멸·경시·겸손\n 타인이나 대상에 대한 경멸을 나타낸다. 자신에 대해 사용하면 겸손의 의미가 된다.\n 이 용법일 때는 아래와 같은 문형을 취한다.\n\n명사 ＋など / なんか / なんて (+조사)\n명사(+조사)+ ＋など / なんか / なんて\n명사+なんて+명사\n\n3.놀라움·의외\n　화자의 놀라운 감정을 나타낸다.\n　[だなんて], [동사 ます형＋など / なんて] 등이 자주 나타남.\n 이 의미일 때는 등, [など, なんて] 가 쓰이고 [ なんか ] 는 적절하지 않음\n　또 이 뜻일 때는 [~とは] 로 바꿔 쓸 수 있다.\n\n等(など) ]의 회화체가 [ なんか, なんて ]이다",
    "connectionWays":
        "동사 사전형＋など / なんて\nイ형용사 보통형＋など / なんて\nナ형용사 보통형＋など / なんて\n명사 ＋など / なんて",
    "examples": [
      {
        "answer": "など",
        "word": "ギターやベースなどの楽器収集が趣味です。",
        "mean": "기타나 베이스 등 악기 수집이 취미입니다."
      },
      {
        "answer": "など",
        "word": "大雨になる所もありますので, 土砂災害などに気をつけてください。",
        "mean": "폭우가 내리는 곳도 있기 때문에 토사 재해 등에 주의하시기 바랍니다."
      },
      {
        "answer": "なんかの",
        "word": "飲み会やカラオケなんかの大人数が参加するような集まりは好きじゃない。",
        "mean": "회식이나 노래방 같은 사람들이 많이 참석하는 모임은 좋아하지 않는다."
      },
      {
        "answer": "なんか",
        "word": "週末には掃除なんかするつもりだ。",
        "mean": "주말에는 청소 같은 것을 할 생각이다."
      },
      {
        "answer": "なんて",
        "word": "[ 好きだよ ]なんて言われて抱きしめられたい。",
        "mean": "좋아해'라는 말을 듣고 안아주고 싶다."
      },
      {
        "answer": "など",
        "word": "風邪など引かぬようにお身体大切になさってください。",
        "mean": "감기 걸리지 않게 몸조심하세요."
      },
      {
        "answer": "なんか",
        "word": "うちの会社は年末なんかは特に忙しくなる。",
        "mean": "우리 회사는 연말 같은 건 특히 바빠져."
      },
      {
        "answer": "など",
        "word": "１６日７時２０分頃, 愛知県などで最大震度３を観測する地震がありました。",
        "mean": "16일 7시 20분경 아이치현 등에서 최대 진도 3을 관측하는 지진이 있었습니다."
      },
      {"answer": "なんか", "word": "あいつなんかに負けてたまるか。", "mean": "저 녀석 따위한테 져버릴까?"},
      {
        "answer": "なんか",
        "word": "難しすぎて, 私なんかにできません。",
        "mean": "너무 어려워서 제가 할 수가 없어요."
      },
      {
        "answer": "なんて",
        "word": "運命なんて自分の力で変えていけばいいだろう。",
        "mean": "운명따윈 내 힘으로 바꾸어 가면 좋을 것이다."
      },
      {"answer": "なんか", "word": "お前癌なんかに負けるなよ。", "mean": "너 암 따위한테 지지 마."},
      {"answer": "など", "word": "私は差別などしていませんよ。", "mean": "저는 차별 같은 건 안 해요."},
      {
        "answer": "なんか",
        "word": "お前とはもう約束なんかしない。どうせ守らないだろ。",
        "mean": "너랑은 이제 약속 같은 건 안 해.어차피 안 지키잖아."
      },
      {
        "answer": "なんて",
        "word": "田中なんて人, 俺は知らない。",
        "mean": "다나카(田中) 같은 사람, 나는 몰라."
      },
      {
        "answer": "なんて",
        "word": "自分より辛い思いをしている人なんて世の中にたくさんいる。",
        "mean": "자신보다 힘든 사람은 세상에 많이 있다."
      },
      {"answer": "など", "word": "止まない雨などない。", "mean": "그치지 않는 비는 없다."},
      {
        "answer": "なんて",
        "word": "彼が合格したなんて信じられない。",
        "mean": "그가 합격했다니 믿을 수 없다."
      },
      {
        "answer": "なんて",
        "word": "こんなことになるなんて予想外です。",
        "mean": "이렇게 되다니 예상 밖이에요."
      },
      {
        "answer": "など",
        "word": "まさか彼が合格するなど, 誰が予想できただろうか。",
        "mean": "설마 그가 합격하리라고 누가 예상할 수 있었을까?"
      },
      {
        "answer": "なんて",
        "word": "可愛いだなんて言ってくれて, 嬉しいです。",
        "mean": "귀엽다고 해줘서 기뻐요."
      },
      {
        "answer": "なんて",
        "word": "２０代という若さで脳出血だなんて, 無事に回復することを祈っています。",
        "mean": "20대라는 젊은 나이에 뇌출혈이라니, 무사히 회복되기를 기원하고 있습니다."
      }
    ]
  },
  {
    "id": 75,
    "grammar": "~において / においても / における",
    "means": "~에서",
    "description":
        "장소나 시간대·시대, 범위(방면, 영역)를 나타낸다.\n\n장소나 시간대, 시대를 나타내는 경우는 [で, での＋명사 ]] 대체 가능\n\n[~においては ]과 강조의 [は]가 후속되는 경우도 있다.\n[何においても, 何事においても] 등 관용표현\n\n문어체이다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "における",
        "word": "災害現場における初期対応の迅速さは人命に直結する。",
        "mean": "재해 현장에서의 초기 대응의 신속성은 인명과 직결된다."
      },
      {
        "answer": "における",
        "word": "１月１日より, 規制エリア内の公共の場における飲酒・喫煙を条例で禁止します。",
        "mean": "1월 1일부터 규제구역 내 공공장소에서의 음주·흡연을 조례로 금지합니다."
      },
      {
        "answer": "において",
        "word": "実戦において重要なのは, 技術面よりも精神面だ。",
        "mean": "실전에서 중요한 것은 기술면보다 정신면이다."
      },
      {
        "answer": "において",
        "word": "社長になりたいという夢を抱いたことがある人が多いだろうが, 現代において実際に起業する人は少ない。",
        "mean": "사장이 되겠다는 꿈을 품어본 사람이 많겠지만 현대에 실제로 창업하는 사람은 드물다."
      },
      {
        "answer": "において",
        "word": "この本には人生において役に立つことが多く書かれている。",
        "mean": "이 책에는 인생에 도움이 되는 것들이 많이 쓰여 있다."
      },
      {
        "answer": "において",
        "word": "普段はそうでもないのに, 妻は料理においては細かいところを気にするタイプだ。",
        "mean": "평소에는 그렇지도 않은데 아내는 요리에 있어서는 세세한 부분을 신경 쓰는 타입이다."
      },
      {
        "answer": "において",
        "word": "１４日午後３時５分ごろ, 駅構内において, 盗撮事案が発生しました。",
        "mean": "14일 오후 3시 5분쯤 역 구내에서 몰래카메라 사안이 발생했습니다."
      },
      {
        "answer": "において",
        "word": "少子高齢化の日本においては, まず出生率を高める政策が求められている。",
        "mean": "저출산 고령화의 일본에서는 우선 출산율을 높이는 정책이 요구되고 있다."
      },
      {
        "answer": "において",
        "word": "彼女は基本的に恋愛においてピュア過ぎる。",
        "mean": "그녀는 기본적으로 연애에 있어서 너무 순수하다."
      },
      {
        "answer": "において",
        "word": "人生において情熱ほど大切なものはない。",
        "mean": "인생에서 열정만큼 소중한 것은 없다."
      },
      {
        "answer": "において",
        "word": "人生の節目においては, いつでも決断というものを迫られる。",
        "mean": "인생의 고비에서는, 언제든지 결단이라는 것을 강요받는다."
      },
      {
        "answer": "において",
        "word": "大学生は社会において最も自由な存在だろう。",
        "mean": "대학생은 사회에서 가장 자유로운 존재일 것이다."
      },
      {
        "answer": "における",
        "word": "社会における善悪とは, 結局世論の感情です。",
        "mean": "사회에서 선악이란 결국 여론의 감정입니다."
      },
      {
        "answer": "における",
        "word": "人生における大きな喜びは, 君にはできないと世間がいうことをやることである。",
        "mean": "인생의 큰 기쁨은 세상이 할 수 없다고 말하는 것이다."
      },
      {
        "answer": "における",
        "word": "就職活動における[ 志望動機 ]は働いている社会人にとっても明確に答えることに悩む難問だ。",
        "mean": "취업준비에서 지원동기는 일하는 사회인에게도 명확한 답변을 고민하는 어려운 문제다."
      },
      {
        "answer": "における",
        "word": "私の人生における成功のすべては, どんな場合でも必ず15分前に到着したおかげである。",
        "mean": "내 인생의 모든 성공은 어떤 경우에도 반드시 15분 전에 도착한 덕분이다."
      },
      {
        "answer": "においても",
        "word": "彼は攻撃においても, 守備においても, 素晴らしいプレーを見せてくれた。",
        "mean": "그는 공격에서도, 수비에서도 훌륭한 플레이를 보여주었다."
      },
      {
        "answer": "においても",
        "word": "何事においても習得するには長い年月と努力が必要だ。",
        "mean": "매사에 습득하려면 오랜 세월과 노력이 필요하다."
      },
      {
        "answer": "においても",
        "word": "若いうちに作った差は, 老後においても縮まらない。",
        "mean": "젊었을 때 만든 차이는 노후에도 좁혀지지 않는다."
      },
      {
        "answer": "においても",
        "word": "どんな場面においても相手と話すときは必ず目やその周辺を見て話すこと。",
        "mean": "어떤 장면에서도 상대방과 이야기할 때는 반드시 눈이나 그 주변을 보고 이야기하라."
      }
    ]
  },
  {
    "id": 76,
    "grammar": "に応じて",
    "means": "~따라서, ~에 맞게",
    "description": "Aに応じてB 형태로 사용하며, A의 결과에 따라 B가 변한다는 뜻.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に応じて",
        "word": "買い物金額に応じてポイントが溜まり, 次回以降１ポイント１円として使用できます。",
        "mean": "쇼핑 금액에 따라 포인트가 적립되며, 다음 번 이후 1포인트 1엔으로 사용할 수 있습니다."
      },
      {
        "answer": "に応じ",
        "word": "お客様のご要望に応じ, 最適な改善案をご提案いたします。",
        "mean": "고객님의 요청에 따라 최적의 개선안을 제안합니다."
      },
      {
        "answer": "に応じ",
        "word": "台風の影響により明日お昼頃からまとまった降雨が予想されます。不要不急の外出を控え, 状況に応じた避難行動を行ってください。",
        "mean":
            "태풍의 영향으로 내일 점심 무렵부터 일정한 강우가 예상됩니다.불요불급한 외출을 자제하고 상황에 따른 대피 행동을 해주시기 바랍니다."
      },
      {
        "answer": "に応じ",
        "word": "お客様のニーズに応じ柔軟にご対応させていただきます。",
        "mean": "고객의 요구에 따라 유연하게 대응해 드리겠습니다."
      },
      {
        "answer": "に応じて",
        "word": "相手に応じて接し方を変える。",
        "mean": "상대방에 따라 대하는 방식을 바꾸다."
      },
      {
        "answer": "に応じ",
        "word": "どうぞお越しください。季節に応じた美しい景色を見ることができます。",
        "mean": "어서 오세요.계절에 따른 아름다운 경치를 볼 수 있습니다."
      },
      {
        "answer": "に応じて",
        "word": "組織の中では指示されたことだけやるのではなく, 状況に応じて適切な行動をとるようにすべきだ。",
        "mean": "조직 안에서는 지시받은 것만 할 것이 아니라 상황에 따라 적절한 행동을 취하도록 해야 한다."
      },
      {
        "answer": "に応じて",
        "word": "激しい運動は逆に怪我を招くことにも繋がりますので, 年齢や体力, 健康状態等に応じて無理のない運動から始めるといいです。",
        "mean":
            "격렬한 운동은 반대로 부상을 초래할 수도 있으므로 나이와 체력, 건강 상태 등에 따라 무리가 없는 운동부터 시작하면 좋습니다."
      },
      {
        "answer": "に応じ",
        "word": "Ａ氏は取材に応じ, 当時の事故の真相について語った。",
        "mean": "A씨는 취재에 응해 당시 사고의 진상에 대해 말했다."
      },
      {
        "answer": "に応じ",
        "word": "彼は我々の説得に応じるつもりはないようだ。",
        "mean": "그는 우리의 설득에 응할 생각이 없는 것 같다."
      }
    ]
  },
  {
    "id": 77,
    "grammar": "にかかわらず",
    "means": "~에 관계없이",
    "description":
        "명사라면 학력, 국적, 성적, 이유, 합격 여부, 성패 등 여러 측면이 있는 단어와 결부되어 동사나 형용사라면 긍정형과 부정형을 반복적으로 접속하여 전항의 결과나 상태에 좌우되지 않고 후항의 내용을 수행하는 것을 나타낸다",
    "connectionWays":
        "명사＋にかかわらず / かかわりなく\n동사 사전형　動辞形＋動ない形＋ないにかかわらず\nい형용사 보통형＋い形容詞ない形＋にかかわらず\nな형용사 어간＋な形容詞語幹＋でないにかかわらず\n\n명사＋(の)あるなしにかかわらず\n명사＋(の)良し悪しにかかわらず\n~かどうかにかかわらず\n~かないかにかかわらず",
    "examples": [
      {
        "answer": "に応じ",
        "word": "自分よりも優れた部分がある人は, 性別や年齢にかかわらず尊敬できる。",
        "mean": "자신보다 나은 부분이 있는 사람은 성별이나 나이에 상관없이 존경할 수 있다."
      },
      {
        "answer": "に応じ",
        "word": "勝ち目のあるなしにかかわらず, 私たちは戦うしかない。",
        "mean": "승산이 있든 없든 우리는 싸울 수밖에 없다."
      },
      {
        "answer": "にかかわらず",
        "word": "理由にかかわらず, 欠席した場合は返金いたしません。",
        "mean": "사유에 관계없이 결석한 경우 환불해드리지 않습니다."
      },
      {
        "answer": "にかかわらず",
        "word": "上手か下手かにかかわらず, 趣味は好きか嫌いかで決めるべきだ。",
        "mean": "잘하든 못하든 취미는 좋든 싫든 결정해야 한다."
      },
      {
        "answer": "にかかわらず",
        "word": "料理するしないにかかわらず, 電子レンジは一人暮らしの必需品だ。",
        "mean": "요리하든 말든 전자레인지는 혼자 사는 필수품이다."
      },
      {
        "answer": "にかかわらず",
        "word": "出席欠席にかかわらず, 参加費はあらかじめ徴収します。",
        "mean": "출석 결석에 관계없이 참가비는 미리 징수합니다."
      },
      {
        "answer": "にかかわらず",
        "word": "この割引券は今後期限にかかわらず使用できます。",
        "mean": "이 할인권은 앞으로 기한에 관계없이 사용할 수 있습니다."
      },
      {
        "answer": "にかかわらず",
        "word": "ウイルスは貧富の差にかかわらず, 誰にでも平等に感染する。",
        "mean": "바이러스는 빈부격차에 관계없이 누구에게나 평등하게 감염된다."
      }
    ]
  },
  {
    "id": 78,
    "grammar": "にもかかわらず",
    "means": "~인데도 불구하고 ",
    "description": "후건에는 이미 발생한 예상 밖의 사태가 서술.\n\n접속사로 단독으로 사용할 수 있다.",
    "connectionWays":
        "명사＋(である)にもかかわらず\nな형용사 어간＋(である)にもかかわらず\nい형용사 보통형＋にもかかわらず\n동사 사전형＋にもかかわらず",
    "examples": [
      {
        "answer": "にもかかわらず",
        "word": "彼は勤務時間にもかかわらず漫画を読んでいる。",
        "mean": "그는 근무시간임에도 불구하고 만화를 읽고 있다."
      },
      {
        "answer": "にもかかわらず",
        "word": "このキャラクターは作品中にあまり登場しないのにもかかわらず, ファンから人気がある。",
        "mean": "이 캐릭터는 작품 속에 자주 등장하지 않음에도 불구하고 팬들에게 인기가 있다."
      },
      {
        "answer": "にもかかわらず",
        "word": "業務に大きな支障が出ている。にもかかわらず, 社内では問題にもなっていない。",
        "mean": "업무에 큰 지장이 나타나고 있다.그럼에도 사내에서는 문제가 되지 않고 있다."
      },
      {
        "answer": "にもかかわらず",
        "word": "雨にもかかわらず来ていただいた皆さんに感謝申し上げます。",
        "mean": "비에도 불구하고 와주신 여러분께 감사드립니다."
      },
      {
        "answer": "にもかかわらず",
        "word": "政府が数か月前からマスク増産を要請している。それにもかかわらず品薄は一向に解消されていない。",
        "mean": "정부가 수개월 전부터 마스크 증산을 요청하고 있다.그럼에도 불구하고 품귀 현상은 전혀 해소되지 않고 있다."
      },
      {
        "answer": "にもかかわらず",
        "word": "ダイエット中にもかかわらずケーキを食べてしまった。",
        "mean": "다이어트 중임에도 불구하고 케이크를 먹어버렸다."
      },
      {
        "answer": "にもかかわらず",
        "word": "この辺りは近年住民が増えている地域にもかかわらず, スーパーが少ない。",
        "mean": "이 근처는 최근 주민이 늘고 있는 지역임에도 불구하고 슈퍼마켓이 적다."
      },
      {
        "answer": "にもかかわらず",
        "word": "挨拶したにもかかわらず無視された。",
        "mean": "인사했는데도 무시당했다."
      }
    ]
  },
  {
    "id": 79,
    "grammar": "ばかりか",
    "means": "~뿐만 아니라",
    "description":
        "전항에서 말한 것에 더해, 또한 그 이상의 것을 후항에서 기술하는 누가·첨가 문법.\n\n후항에는 も가 자주 호흥함\n\n[~ばかりでなく~も / ~ばかりでなくて~も] 도 같은 의미지만 [~ばかりか] 가 딱딱한 표현",
    "connectionWays": "명사\nな형용사 어간 +　な / である\nい형용사 보통형\n동사 사전형",
    "examples": [
      {
        "answer": "ばかりか",
        "word": "助けてと言っても助けてくれないばかりか, 笑ってこっちを見る始末だ。",
        "mean": "살려달라고 해도 도와주지 않을 뿐더러 웃으며 이쪽을 보는 형편이다."
      },
      {
        "answer": "ばかりか",
        "word": "これ以上効率を追い求めるのは従業員の命を危険にさらすばかりか, 信用をも失いかねない。",
        "mean": "더 이상 효율을 추구하는 것은 종업원의 생명을 위험에 빠뜨릴 뿐만 아니라 신용도 잃을 수 있다."
      },
      {
        "answer": "ばかりか",
        "word": "栄養のバランスに注意しなければ肉体ばかりか精神にまでも支障をきたしかねない。",
        "mean": "영양 균형에 주의하지 않으면 육체뿐 아니라 정신에도 지장을 줄 수 있다."
      },
      {
        "answer": "ばかりか",
        "word": "命令を質問の形に変えると, 気持ちよく受け入れられるばかりか, 相手に創造性を発揮させることもある。",
        "mean": "명령을 질문 형태로 바꾸면 기분 좋게 받아들여질 뿐만 아니라 상대방에게 창의성을 발휘하게 하기도 한다."
      },
      {
        "answer": "ばかりか",
        "word": "状況は変わってないばかりか, もっと酷くなっている。",
        "mean": "상황은 변하지 않았을 뿐만 아니라 더 심해지고 있다."
      },
      {
        "answer": "ばかりか",
        "word": "世界情勢は１か月後ばかりか, 明日のこともどうなってるかは誰にも分からない。",
        "mean": "세계정세는 한 달 뒤뿐만 아니라 내일 일도 어떻게 될지 아무도 모른다."
      },
      {
        "answer": "ばかりか",
        "word": "彼は文句言うばかりか, 人にも文句を言わせようとしてくる。",
        "mean": "그는 불평할 뿐만 아니라 남에게도 불평을 하게 하려고 한다."
      },
      {
        "answer": "ばかりか",
        "word": "神なんて人間に何の影響も与えない祈っても無駄な存在だ。そればかりかそもそも存在すらしない。",
        "mean": "신 따위는 인간에게 아무런 영향을 주지 않는 기도도 소용없는 존재다.뿐만 아니라 애초에 존재조차 하지 않는다."
      }
    ]
  },
  {
    "id": 80,
    "grammar": "~のみならず / ~のみか",
    "means": "~뿐만 아니라",
    "description":
        "전항에서 말한 것에 더해, 또한 그 이상의 것을 후항에서 기술하는 누가·첨가 문법.\n\n전항에서는 ただ, 후항에서는 흔히 も 등이 호응\n\n[~にとどまらず, ~だけでなく, ~ばかりでなく] 등과 같은 표현",
    "connectionWays": "명사 (である)\nな형용사 어간 + である\nい형용사 보통형\n동사 사전형",
    "examples": [
      {
        "answer": "~のみならず / ~のみか",
        "word": "女は英語のみならず, 中国語までできる。",
        "mean": "여자는 영어뿐만 아니라 중국어까지 할 수 있다."
      },
      {
        "answer": "~のみならず / ~のみか",
        "word": "原発の問題は, その地域のみならず国全体の問題だ。",
        "mean": "원전 문제는 그 지역뿐만 아니라 나라 전체의 문제다."
      },
      {
        "answer": "のみならず",
        "word": "このお店は餃子のみならずチャーハンも絶品だ。",
        "mean": "이 집은 만두뿐만 아니라 볶음밥도 일품이다."
      },
      {
        "answer": "のみならず",
        "word": "目の前で起きた事故を, 私のみならず, 他の人もみんなカメラで撮影していた。",
        "mean": "눈앞에서 일어난 사고를 나뿐만 아니라 다른 사람들도 모두 카메라로 촬영하고 있었다."
      },
      {
        "answer": "のみならず",
        "word": "健康のためには, 食事のみならず, 生活リズムも重要になってくる。",
        "mean": "건강을 위해서는 식사뿐만 아니라 생활 리듬도 중요해진다."
      },
      {
        "answer": "のみか",
        "word": "若年層のみか, 大人にも人気がある。",
        "mean": "젊은 층뿐만 아니라 어른들에게도 인기가 있다."
      },
      {
        "answer": "のみならず",
        "word": "睡眠不足は体力のみならず, 判断力も鈍らせる。",
        "mean": "수면 부족은 체력뿐만 아니라 판단력도 무뎌지게 한다."
      },
      {
        "answer": "のみならず",
        "word": "単独犯だと思っていたが, 彼のみならず, 彼の取り巻きも犯行に加担していたようだ。",
        "mean": "단독범인 줄 알았는데 그뿐만 아니라 그의 두둔형도 범행에 가담한 것으로 보인다."
      }
    ]
  },
  {
    "id": 81,
    "grammar": "~ばかりでなく~も / ~ばかりでなくて~も",
    "means": "~뿐만 아니라",
    "description":
        "전항에서 말한 것에 더해, 또한 그 이상의 것을 후항에서 기술하는 누가·첨가 문법.\n\n후항에는 も가 자주 호흥함\n\n[~にとどまらず, ~だけでなく, ~ばかりでなく] 등과 같은 표현",
    "connectionWays": "명사\nな형용사 어간 + な / である\nい형용사 보통형\n동사 사전형",
    "examples": [
      {
        "answer": "ばかりじゃなくて",
        "word": "疲れているときは甘い物ばかりじゃなくて, 酸っぱいものも食べたほうがいいと聞いたことがある。",
        "mean": "피곤할 때는 단 것뿐만 아니라 신 것도 먹는 게 좋다고 들은 적이 있다."
      },
      {
        "answer": "ばかりでなく",
        "word": "大人から教わることばかりでなく, 子どもからも学ぶことはある。",
        "mean": "어른에게서 배우는 것뿐만 아니라 아이에게서도 배울 점은 있다."
      },
      {
        "answer": "ばかりでなく",
        "word": "進むばかりでなく, たまには後ろを振り返ることも大切だ。",
        "mean": "나아갈 뿐만 아니라 가끔은 뒤를 돌아보는 것도 중요하다."
      },
      {
        "answer": "ばかりでなく",
        "word": "目の前で起きた事故を, 私ばかりでなく, 他の人もみんなカメラで撮影していた。",
        "mean": "눈앞에서 일어난 사고를 나뿐만 아니라 다른 사람들도 모두 카메라로 촬영하고 있었다."
      },
      {
        "answer": "ばかりでなく",
        "word": "結婚は嬉しいことばかりでなく, その分辛い事も増える。",
        "mean": "결혼은 기쁜 일뿐만 아니라 그만큼 힘든 일도 늘어난다."
      },
      {
        "answer": "ばかりでなく",
        "word": "この件については前向きな意見ばかりでなく, 否定的な意見もあった。",
        "mean": "이 건에 대해서는 긍정적인 의견뿐만 아니라 부정적인 의견도 있었다."
      },
      {
        "answer": "ばかりでなく",
        "word": "生きていれば悪いことばかりでなく, 良いこともある。",
        "mean": "살다보면 나쁜 일만 있을 뿐 아니라 좋은 일도 있다."
      },
      {
        "answer": "ばかりでなく",
        "word": "彼は英語ばかりでなく, その他３ヶ国語もできる。",
        "mean": "그는 영어뿐만 아니라 기타 3개 국어도 할 수 있다."
      }
    ]
  },
  {
    "id": 82,
    "grammar": "に限って",
    "means": "1. 꼭 ~일 때만\n2. ~만큼은 ",
    "description":
        "다른 경우에는 발생하지 않는 상황이 어떤 중요한 때에만 치우쳐 발생함을 나타낸다\n\n후항에서는 예상 밖의 것을 말할 수 있다.",
    "connectionWays": "명사 직접 접속",
    "examples": [
      {
        "answer": "に限って",
        "word": "体調悪い時に限って予定が入ってくる。",
        "mean": "아플 때만 일정이 들어온다."
      },
      {"answer": "に限って", "word": "天気が良い時に限って仕事。", "mean": "날씨가 좋을 때만 일."},
      {
        "answer": "に限って",
        "word": "自分が外出するときに限っていつも雨が降る。",
        "mean": "자신이 외출할 때만 항상 비가 온다."
      },
      {
        "answer": "に限って",
        "word": "寂しい時に限って好きな人は側に居てくれない。",
        "mean": "외로울 때만 좋아하는 사람은 곁에 있어주지 않는다."
      },
      {
        "answer": "に限って",
        "word": "遅刻しちゃいけない日に限って寝坊してしまう。",
        "mean": "지각하면 안 되는 날에 한해서 늦잠을 자버린다."
      },
      {
        "answer": "に限って",
        "word": "早く帰りたいと思うときに限って時間が経つのめちゃくちゃ遅い。",
        "mean": "빨리 돌아가고 싶을 때만 시간이 너무 늦어."
      },
      {
        "answer": "に限って",
        "word": "理想が高い人に限って, 自分自身を客観的に見ることができていない場合も多い。",
        "mean": "이상이 높은 사람에 한해 자기 자신을 객관적으로 볼 수 없는 경우도 많다."
      },
      {
        "answer": "に限って",
        "word": "いつもよりメイクが上手くいった日に限って, 会いたい人に会えない。",
        "mean": "평소보다 메이크업이 잘 된 날에만 만나고 싶은 사람을 만날 수 없다."
      },
      {
        "answer": "に限って",
        "word": "釣りは期待してない日に限ってよく釣れるものだ。",
        "mean": "낚시는 기대하지 않는 날에만 잘 잡히는 법이다."
      },
      {
        "answer": "に限って",
        "word": "どうでもいい事に限ってなかなか忘れない。",
        "mean": "아무래도 좋은 일에 한해서 좀처럼 잊지 않는다."
      }
    ]
  },
  {
    "id": 83,
    "grammar": "に限る",
    "means": "~하는 것이 최고다",
    "description":
        "주관적인 판단이나 인상에 따라 가장 좋다고 생각하는 것을 말할 때 사용한다.\n\n자신의 의견을 말하는 경우에 사용하기 때문에 객관적인 의견에는 사용할 수 없다.\n\n전항에 [やっぱり]가 잘 호응합니다.\n\n예문：車はトヨタに限る。\n그 밖에도 여러 회사가 있지만, 그 중에서도 도요타가 가장 좋다고 생각한다. 어디까지나 개인적인 의견을 말하는 문법.\n\n비슷한 의미의 문법에 [~と言えば] 가 있다.\n예문2: 日本の山と言えば富士山だ。\n\n[~と言えば] 는 연관성이 높은 가장 먼저 생각나는 대표적인 것을 말하는 문법.\n\n~と言えば는 개인적 의견이라고는 할 수 없다.'일본의 산'이라고 하면 많은 사람들이 '후지산'이라고 생각하기 때문이다.",
    "connectionWays":
        "동사 사전형＋に限る\n동사 ない형 + ないに限る\nな형용사 어간＋なのに限る\nい형용사＋のに限る\n명사＋に限る",
    "examples": [
      {
        "answer": "に限って",
        "word": "暑い夏の仕事終わりはやっぱりビールに限る。",
        "mean": "더운 여름 일의 끝은 역시 맥주에가 최고이다."
      },
      {
        "answer": "に限って",
        "word": "映画は家で見るより映画館で見るに限る。",
        "mean": "영화는 집에서 보는 것보다 영화관에서 보는 게 제일이야."
      },
      {"answer": "に限る", "word": "かき氷はいちご味に限る。", "mean": "빙수는 딸기 맛이 제일이다."},
      {"answer": "に限る", "word": "寒い時には風呂に限る。", "mean": "추울 때는 목욕이 제일이다."},
      {"answer": "に限る", "word": "風邪のときは寝るに限る。", "mean": "감기에 걸리면 자는 것이 제일이다."},
      {
        "answer": "に限る",
        "word": "カレーは日中に作って半日寝かせるに限る。",
        "mean": "카레는 낮에 만들어 반나절 재우는 것이 제일이다."
      },
      {"answer": "に限る", "word": "音楽はライブに限る。", "mean": "음악은 라이브가 제일이다."},
      {"answer": "に限る", "word": "言葉と投資は慎重に限る。", "mean": "말과 투자는 신중이 제일이다."}
    ]
  },
  {
    "id": 84,
    "grammar": "まい",
    "means": "1. 하지 않겠다 (부정 의지)\n2.하지 않을 것이다 (부정 추측)",
    "description":
        "1. 부정의지\n[~ないつもりだ, ~ないようにしよう] (~하지 않을 것이다) 와 같은 의미\n\n2. 부정 추측\n[ ~ないだろう ] 와 같은 의미.",
    "connectionWays":
        "1.동사 원형 + まい ( 1그룹, 2그룹, 3그룹 모든 동사 가능)\n2.동사 ない형 ＋ まい ( 2그룹, 3그룹 동사만 가능 )",
    "examples": [
      {"answer": "まい", "word": "これ以上は何も言うまい。", "mean": "더 이상은 아무 말도 안 할 거야."},
      {
        "answer": "まい",
        "word": "もう二度とこんな店に来るまい。",
        "mean": "다시는 이런 가게에 오지 않을 거야."
      },
      {
        "answer": "まい",
        "word": "タバコ辞めるぞもう吸うまいと思いながらいつも手離せないでいる。",
        "mean": "담배 끊을거야 이제 그만 피울거라고 생각하면서 항상 손을 놓지 못하고 있어."
      },
      {"answer": "まい", "word": "もう彼には会うまい。", "mean": "이제 그는 만나지 않을 것이다."},
      {
        "answer": "まい",
        "word": "釣れまいと思うところに常に魚あり。",
        "mean": "잡히지 않을 거 같은 곳에 항상 물고기가 있다."
      },
      {
        "answer": "まい",
        "word": "事の重大性を理解していた人は半数もおるまい。",
        "mean": "일의 중대성을 이해하고 있던 사람은 절반도 안 될 것이다."
      },
      {"answer": "まい", "word": "この気持ちお前には分かるまい。", "mean": "이 마음 너는 모를 거야."}
    ]
  },
  {
    "id": 85,
    "grammar": "ものではない",
    "means": "~하는게 아니다",
    "description":
        "사람의 행위를 나타내는 동사에 대해서 그렇게 해서는 안 된다는 충고나 조언을 나타낸다.\n\n사회상식이나 사물의 진리 등에 따라 행동규범이 객관적으로 정해져 있는 경우에 이 문법을 사용할 수 있다.",
    "examples": [
      {
        "answer": "ものではない",
        "word": "人のことに首を突っ込むものではない。",
        "mean": "남의 일에 골몰하는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "お金は貯まるもので, 貯めるものではない。",
        "mean": "돈은 모이는 것이지 모으는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "人は外見で判断するものではない。",
        "mean": "사람은 외모로 판단하는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "父には, 男は泣くものではないと教えられた。",
        "mean": "아버지에게는 남자는 우는 것이 아니라고 배웠다."
      },
      {
        "answer": "ものではない",
        "word": "少しくらい咎められても, 自分の意見はすぐに曲げるものではない。",
        "mean": "조금만 나무랄지언정 자신의 의견은 바로 굽히지 않는다."
      },
      {
        "answer": "ものではない",
        "word": "体調不良を引き起こすので, 徹夜はするものではない。",
        "mean": "몸살을 일으키므로 밤샘은 하는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "人の言葉を信じるものではない。",
        "mean": "남의 말을 믿는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "言葉には気をつけるべきだ。衝動的に発するものではない。",
        "mean": "말조심해야 한다.충동적으로 발하는 것이 아니다."
      },
      {
        "answer": "ものではない",
        "word": "言葉には気をつけるべきだ。衝動的に発するものではない。",
        "mean": "말조심해야 한다.충동적으로 발하는 것이 아니다."
      }
    ]
  },
  {
    "id": 86,
    "grammar": "ことだ",
    "means": "인 것이다",
    "description":
        "충고, 조언을 표현함.\n\n현재보다 더 나아질 수 있는 방법이나 수단을 제시하고 화자의 판단에 근거한 충고를 나타낸다.\n\n~해야 한다, ~해야 한다 등과 같은 의미를 갖지만, ことだ 는 간접적으로 충고하는 것이 특징적.",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {"answer": "ことだ", "word": "病院では静かにすることだ。", "mean": "병원에서는 조용히 하는 것이다."},
      {
        "answer": "ことだ",
        "word": "お世話になった人にはちゃんと感謝を伝えることだ。",
        "mean": "신세진 사람에게는 제대로 감사를 전하는 것이다."
      },
      {
        "answer": "ことだ",
        "word": "バレてまずいと思うなら, 最初から秘密など作らないことだ。",
        "mean": "들키고 맛없다고 생각하면 아예 비밀 같은 건 만들지 말라."
      },
      {
        "answer": "ことだ",
        "word": "自分がされたら嫌なことは, 人にはしないことです。",
        "mean": "내가 당하면 싫은 일은 남에게는 하지 않는 것입니다."
      }
    ]
  },
  {
    "id": 87,
    "grammar": "ものだ",
    "means": "인 것이다",
    "description":
        "이 문법의 포인트는 '본래'.\n\n원래 그런 규칙, 암묵적인 양해, 그래야 할 이유가 있으니까 당연히 그렇다는 뜻.\n\n사회상식이나 사물의 진리 등에 따라 행동규범이 객관적으로 정해져 있는 경우에 이 문법을 사용할 수 있다.\n\n따라서 이 문법을 포함한 글은 빈정거림의 용법을 제외하고는 누가 봐도 옳다고 생각하는 내용이어야 한다.",
    "connectionWays": "동사의 사전형\n동사 ない형\nい형용사\nな형용사",
    "examples": [
      {"answer": "ものだ", "word": "病院では静かにするものだ。", "mean": "병원에서는 조용히 하기 마련이다."},
      {"answer": "ことです", "word": "先輩の話はちゃんと聞くものだ。", "mean": "형 말은 잘 듣는 법이야."},
      {"answer": "ものだ", "word": "人は哀しいものですね。", "mean": "사람은 슬픈 법이죠."},
      {"answer": "ものだ", "word": "困ったらときは助け合うものだ。", "mean": "곤란하면 서로 돕는 법이다."},
      {
        "answer": "ものですね",
        "word": "未来のことなど誰にも分からないものだ。",
        "mean": "미래의 일 따위는 아무도 모르는 법이다."
      }
    ]
  },
  {
    "id": 88,
    "grammar": "ものなら",
    "means": "~할 수 있다면",
    "description": "실현 불가능한 것을 바랄 때 사용.\n\n회화체 もんなら",
    "connectionWays": "동사 가능형\n동사 사전형",
    "examples": [
      {
        "answer": "ものなら",
        "word": "寝れるもんなら一生寝ていたい。",
        "mean": "잘 수 있다면 평생 자고 싶다."
      },
      {
        "answer": "ものなら",
        "word": "初恋の相手に会えるものなら会ってみたい。",
        "mean": "첫사랑을 만날 수 있다면 만나보고 싶다."
      },
      {
        "answer": "ものなら",
        "word": "手伝えるものなら手伝ってあげたいが, あいにく手が空いていない。",
        "mean": "도울 수 있다면 도와주고 싶지만 공교롭게도 손이 비어 있지 않다."
      },
      {
        "answer": "ものなら",
        "word": "あの辺りの高級住宅街に住めるものなら一度は住んでみたい。",
        "mean": "저 근처 고급 주택가에 살 수 있다면 한 번쯤은 살아보고 싶다."
      },
      {
        "answer": "ものなら",
        "word": "昨日のライブ, 行けるものなら行きたかったが大雨で行けなかった。",
        "mean": "어제 라이브 갈 수 있다면 가고 싶었는데 비가 많이 와서 못 갔어."
      },
      {"answer": "もんなら", "word": "仕事休めるもんなら休みたい。", "mean": "일 쉴 수 있다면 쉬고 싶다."},
      {
        "answer": "もんなら",
        "word": "どうぞ, できるもんならしてみろ。",
        "mean": "어서, 할 수 있으면 해봐."
      },
      {"answer": "もんなら", "word": "やれるもんならやってみろ。", "mean": "할 수 있으면 해봐."},
      {"answer": "もんなら", "word": "やれるもんならやってみろ。", "mean": "할 수 있으면 해봐."}
    ]
  },
  {
    "id": 89,
    "grammar": "ものの",
    "means": "~하기는 하나, ~하기는 하지만",
    "description":
        "이미 발생한 것에 대해 사용\n\nしかし과 거의 같고 그보다 더 딱딱한 표현.\n\n후항에는 전항에 대응하는 사항이 아직 이루어지지 않았거나 통상 일어나지 않거나 일어날 것 같지 않은 일을 기술한다.\n\n후항에는 자신이 없거나 실현 곤란한 일이 계속되는 경우가 많다.",
    "connectionWays": "동사 기본형, 동사 과거형(た형), い형용사 기본형, な형용사 だ+な",
    "examples": [
      {
        "answer": "もんなら",
        "word": "五十音は発音できるようになったものの, 書けと言われれば自信がない。",
        "mean": "오십음은 발음할 수 있게 됐지만 쓰라고 하면 자신이 없다."
      },
      {
        "answer": "ものの",
        "word": "五十音は発音できるようになったものの, 書けと言われれば自信がない。",
        "mean": "오십음은 발음할 수 있게 됐지만 쓰라고 하면 자신이 없다."
      },
      {
        "answer": "ものの",
        "word": "歩いて帰ると言ったものの, 雨が降ってきたので結局タクシーで帰った。",
        "mean": "걸어서 간다고 했지만 비가 와서 결국 택시로 돌아갔다."
      },
      {
        "answer": "ものの",
        "word": "頭から落ちたものの頭部は骨折しなかった。",
        "mean": "머리에서 떨어졌지만 머리는 골절되지 않았다."
      },
      {
        "answer": "ものの",
        "word": "咳はするものの, 体調は戻ってきている。",
        "mean": "기침은 하지만 몸 상태는 돌아오고 있다."
      },
      {"answer": "ものの", "word": "使ってはみたものの, しっくりこない。", "mean": "써보긴 했지만 잘 안 돼."}
    ]
  },
  {
    "id": 90,
    "grammar": "ようがない",
    "means": "~할 수가 없다",
    "description":
        "~よう는 동사 ます형에 접속하여 [방법]을 나타내며 ようがない는 [방법이 없다] 를 나타낸다.\n\n~하려고 해도 어떠한 이유로 도저히 할 수 없다.\n\n[としか言いようがない] 라는 표현도 있다.",
    "connectionWays": "동사 ます형에 접속",
    "examples": [
      {
        "answer": "ようがない",
        "word": "あのパフォーマンスは, さすがとしか言いようがない。",
        "mean": "그 퍼포먼스는 역시 대단하다고 밖에 말할 수 없다."
      },
      {
        "answer": "ようのない",
        "word": "彼の犯行であることはもう疑いようのない事実だ。",
        "mean": "그의 범행임은 이제 의심의 여지가 없는 사실이다."
      },
      {
        "answer": "ようがない",
        "word": "頭では分かっているが, どうにも説明のしようがない。",
        "mean": "머리로는 알지만 도무지 설명할 길이 없다."
      },
      {
        "answer": "ようがない",
        "word": "この病はどんな治療法をもってしても治しようがない。",
        "mean": "이 병은 어떤 치료법으로도 고칠 수 없다."
      },
      {
        "answer": "ようがない",
        "word": "直接言ってくれないことには分かりようがない。",
        "mean": "직접 말해주지 않을 수는 없다."
      },
      {
        "answer": "ようがない",
        "word": "今日のＡ選手は文句のつけようがない。",
        "mean": "오늘의 A 선수는 불평할 방법이 없다."
      },
      {
        "answer": "ようがない",
        "word": "後ろから襲われたら誰でも防ぎようがない。",
        "mean": "뒤에서 습격당하면 누구나 막을 수 없다."
      },
      {
        "answer": "ようがない",
        "word": "彼女は幼少期から何一つ不自由ない暮らしをし, 他人の苦労など知りようがない人生を送ってきた。",
        "mean": "그녀는 어린 시절부터 무엇 하나 불편함 없이 살며 남의 고생 따위는 알 수 없는 삶을 살아왔다."
      },
      {
        "answer": "ようがない",
        "word": "困ってても何も言わなかったら誰も助けようがないよ。",
        "mean": "곤란해도 아무 말도 안 하면 아무도 도와줄 수 없어."
      },
      {
        "answer": "ようもない",
        "word": "人生に値段なんてつけようもない。",
        "mean": "인생에 가격 따윈 매길 수 없다."
      },
      {
        "answer": "ようもない",
        "word": "ミサイルが本当に発射されたかなんて国民は確認しようもない。",
        "mean": "미사일이 정말 발사됐는지 국민은 확인할 수 없다."
      },
      {
        "answer": "ようもない",
        "word": "人柄の良さなんて, 初対面では実際分かりようもない。",
        "mean": "인품이 좋다는 것은 초면에 실제로 알 수 없다."
      },
      {
        "answer": "ようのない",
        "word": "言葉にしようのない感情が渦巻いている。",
        "mean": "말로 표현할 수 없는 감정이 소용돌이치고 있다."
      },
      {"answer": "ようのない", "word": "君たちは救いようのない馬鹿だ。", "mean": "너희는 구제불능의 바보다."},
      {
        "answer": "ようのない",
        "word": "権力とは避けようのない暴力である。",
        "mean": "권력은 피할 수 없는 폭력이다."
      },
      {
        "answer": "ようのない",
        "word": "人は相互に関係しながら生きているということは, 否定しようのない事実である。",
        "mean": "사람이 서로 관계하면서 산다는 것은 부정할 수 없는 사실이다."
      }
    ]
  },
  {
    "id": 91,
    "grammar": "ように",
    "means": "~하기를, ~하도록",
    "description": "문장 끝에 붙어 소원, 바람 등을 나타내는 표현.",
    "connectionWays": "문장 끝",
    "examples": [
      {
        "answer": "ように",
        "word": "皆さまに楽しんでいただけるように頑張ります。",
        "mean": "여러분이 즐기실 수 있도록 노력하겠습니다."
      },
      {
        "answer": "ように",
        "word": "寝坊しないように早めにおやすみなさい。",
        "mean": "늦잠을 자지 않도록 일찍 주무세요."
      },
      {
        "answer": "よう",
        "word": "この服が似合う人になれるよう痩せなきゃ。",
        "mean": "이 옷이 어울리는 사람이 되도록 살을 빼야지."
      },
      {
        "answer": "ように",
        "word": "体調を崩さないように皆さん気をつけて下さい。",
        "mean": "아프지 않게 다들 조심하시고요."
      },
      {
        "answer": "ように",
        "word": "ちょっとした不注意で怪我しないようにしてください。",
        "mean": "사소한 부주의로 다치지 않도록 하세요."
      },
      {
        "answer": "ように",
        "word": "お腹冷えないように気をつけてください。",
        "mean": "배 시리지 않게 조심하세요."
      },
      {
        "answer": "ように",
        "word": "みんなに聞こえるように大きい声で話してください。",
        "mean": "모두에게 들릴 수 있게 큰 소리로 말해주세요."
      },
      {"answer": "ように", "word": "可愛くなれるように努力する。", "mean": "귀여울 수 있도록 노력할게."},
      {
        "answer": "よう",
        "word": "皆様の支えに少しでもなれるよう頑張ります。",
        "mean": "여러분의 버팀목이 될 수 있도록 노력하겠습니다."
      },
      {
        "answer": "よう",
        "word": "忘れ物をしないよう注意してください。",
        "mean": "분실물을 남기지 않도록 주의해 주세요."
      },
      {"answer": "ように", "word": "明日のテスト, うまくいきますように。", "mean": "내일 시험 잘 보세요."},
      {"answer": "ように", "word": "病気が治りますように。", "mean": "병이 나으시길 바랍니다."},
      {"answer": "ように", "word": "明日いい天気になりますように。", "mean": "내일 좋은 날씨 되세요."},
      {
        "answer": "ように",
        "word": "第一志望の大学に合格できるように神社でお祈りをした。",
        "mean": "제1지망 대학에 합격할 수 있도록 신사에서 기도를 했다."
      }
    ]
  },
  {
    "id": 92,
    "grammar": "~ようなら(ば)・~ようであれば・~ようだったら",
    "means": "~할 것 같으면",
    "description": "가정조건을 표현\n\nようであれば 는 약간 딱딱한 표현",
    "connectionWays": "명사 접속 방법 따름",
    "examples": [
      {
        "answer": "ないようなら",
        "word": "このレベルが理解できないようなら, 君才能ないよ。",
        "mean": "이 수준을 이해 못할 것 같으면 너 재능 없어."
      },
      {
        "answer": "ないようなら",
        "word": "一発殴っても分からないようなら, 分かるまで殴ってやる。",
        "mean": "한 대 때려도 모를 것 같으면 알 때까지 때려주겠다."
      },
      {
        "answer": "ようなら",
        "word": "到着が遅れるようなら, あらかじめ連絡をください。",
        "mean": "도착이 늦어질 것 같으면 미리 연락을 주세요."
      },
      {
        "answer": "ないようだったら",
        "word": "明日も熱が下がらないようだったら病院に行こうと思う。",
        "mean": "내일도 열이 내리지 않을 것 같으면 병원에 가려고 해."
      },
      {
        "answer": "ようだったら",
        "word": "来られるようだったらぜひ来てください。",
        "mean": "오실거 같으면 꼭 오세요."
      },
      {
        "answer": "ようだったら",
        "word": "この化粧水肌に合うようだったら定期的に購入したい。",
        "mean": "이 스킨피부에 맞는거 같으면 정기적으로 구매하고 싶어."
      },
      {
        "answer": "ないようなら",
        "word": "一人で運べないようなら, 私が手伝おうか。",
        "mean": "혼자 옮길 수 없을 것 같으면 내가 도와줄까?"
      },
      {
        "answer": "ないようなら",
        "word": "人との約束も守れないようなら, 誰にも信頼されることもない。",
        "mean": "사람과의 약속도 지키지 못할 것 같으면 누구에게도 신뢰를 받을 수 없다."
      }
    ]
  },
  {
    "id": 93,
    "grammar": "わりに",
    "means": "~에 비해서는",
    "description":
        "割には 는 [ ~정도일 거라 생각했는데 실제 그 정도는 아니다] 라는 뜻\n\n정도의 차에는 폭이 있어야함.",
    "connectionWays": "명사 접속 방법 따름",
    "examples": [
      {
        "answer": "わりに",
        "word": "同僚はいつも忙しいと言っているわりに, 仕事中によくスマホでFacebookを見ている。",
        "mean": "동료들은 항상 바쁘다고 말하는 대신 업무 중에 자주 스마트폰으로 페이스북을 보고 있다."
      },
      {
        "answer": "わりに",
        "word": "彼は勉強していなかったわりに, テストの点が良かった。",
        "mean": "그는 공부하지 않은 것에 비해 시험 점수가 좋았다."
      },
      {
        "answer": "わりに",
        "word": "田中さんは留学の経験がないわりに, 綺麗な発音で英語を話す。",
        "mean": "다나카(田中) 씨는 유학 경험이 없는 것에 비해 깨끗한 발음으로 영어를 말한다."
      },
      {
        "answer": "わりに",
        "word": "この鞄は高いわりに, よく売れる。",
        "mean": "이 가방은 비싼 것에 비해 잘 팔린다."
      },
      {
        "answer": "わりに",
        "word": "日本語教師の仕事は忙しいわりに, 給料は安く辞める人も多い。",
        "mean": "일본어 교사의 일은 바쁜 반면 월급은 싸게 그만두는 사람도 많다."
      },
      {
        "answer": "わりに",
        "word": "プログラマーの仕事は大変なわりに, 給料が低いのでフリーランスになる人も増えている。",
        "mean": "프로그래머의 일은 힘든 데 비해 월급이 낮기 때문에 프리랜서가 되는 사람도 늘고 있다."
      },
      {
        "answer": "わりに",
        "word": "このラーメンは値段のわりに, おいしかった。",
        "mean": "이 라면은 가격에 비해 맛있었다."
      },
      {
        "answer": "わりに",
        "word": "息子はインフルエンザのわりに, 食欲もあるし元気だ。",
        "mean": "아들은 독감에 비해 식욕도 있고 건강하다."
      },
      {
        "answer": "わりに",
        "word": "今日は休日のわりに人が少ないね。どうしてだろう。",
        "mean": "오늘은 휴일에 비해 사람이 적네.왜 그럴까."
      },
      {
        "answer": "わりに",
        "word": "このコンピューター, 中古のわりに高くない？",
        "mean": "이 컴퓨터 중고에 비해 비싸지 않아?"
      },
      {
        "answer": "わりに",
        "word": "相手の選手は負けたわりに, あまり悔しそうにしていなかった。",
        "mean": "상대 선수는 진 것에 비해 별로 억울해하지 않았다."
      },
      {
        "answer": "わりに",
        "word": "昨日見た映画は評判のわりに, 面白くなかった。",
        "mean": "어제 본 영화는 평판에 비해 재미없었다."
      },
      {
        "answer": "わりに",
        "word": "このレストラン, レビューが星５のわりに, そんなに美味しくないね。",
        "mean": "이 레스토랑 리뷰가 별 5개에 비해 그렇게 맛이 없네."
      },
      {
        "answer": "わりに",
        "word": "(写真を見ながら)え？この人, ５０歳なの？歳のわりに, 若く見えますね。",
        "mean": "(사진을 보면서) 어? 이 사람 50살이야?나이에 비해 젊어 보이네요."
      },
      {
        "answer": "わりに",
        "word": "本当にスキーしたことのないの？初めてのわりに, 上手に滑れているよ。",
        "mean": "정말 스키 타본 적 없어?처음 타는 것 치고 잘 미끄러워."
      }
    ]
  },
  {
    "id": 94,
    "grammar": "を問わず",
    "means": "~을 불문하고",
    "description":
        "전건의 결과나 상태에 좌우되지 않음을 나타낸다.\n[~にかかわらず] 같은 뜻.\n\n학력 국적 성적 사유 합격 여부 성패 등 여러 측면이 있는 단어와 연결된다",
    "connectionWays": "명사 접속 방법 따름",
    "examples": [
      {
        "answer": "を問わず",
        "word": "この国は昼夜を問わず, いつも多くの人で賑わっている。",
        "mean": "이 나라는 밤낮으로 항상 많은 사람들로 붐빈다."
      },
      {
        "answer": "を問わず",
        "word": "このお店は昼夜を問わず, 開いています。",
        "mean": "이 가게는 밤낮으로 문을 엽니다."
      },
      {
        "answer": "を問わず",
        "word": "明日のパーティーは年齢を問わず, どなたでもご参加いただけます。",
        "mean": "내일 파티는 나이 상관없이 누구나 참석하실 수 있습니다."
      },
      {
        "answer": "を問わず",
        "word": "当社では仕事の経験を問わず, やる気のある方ならどなたでもご応募いただけます。",
        "mean": "당사에서는 업무 경험을 불문하고 의욕이 있는 분이라면 누구나 응모하실 수 있습니다."
      },
      {
        "answer": "を問わず",
        "word": "バドミントンは年齢を問わず, 楽しめるスポーツだ。",
        "mean": "배드민턴은 나이를 불문하고 즐길 수 있는 스포츠다."
      },
      {
        "answer": "を問わず",
        "word": "この店では, 購入金額を問わず, 送料が無料だそうだ。",
        "mean": "이 가게에서는 구입 금액을 불문하고 무료 배송이라고 한다."
      },
      {
        "answer": "を問わず",
        "word": "音楽はジャンルを問わず, なんでも聴きますよ。",
        "mean": "음악은 장르를 불문하고 다 들어요."
      },
      {
        "answer": "を問わず",
        "word": "ドラゴンボールは世代を問わず, 人気がある。",
        "mean": "드래곤볼은 세대를 막론하고 인기가 있다."
      },
      {
        "answer": "を問わず",
        "word": "明日のスポーツ大会は天候を問わず, 行います。雨が降った場合は体育館でやります。",
        "mean": "내일 스포츠 대회는 날씨를 불문하고 진행합니다.비가 올 경우 체육관에서 합니다."
      },
      {
        "answer": "を問わず",
        "word": "[ Dead or Alive ]は[ 生死を問わず ]という意味だ。",
        "mean": "Dead or Alive는 생사를 불문하고라는 뜻이다."
      },
      {
        "answer": "問わず",
        "word": "こちらのイベントには男女問わず, 参加いただけます。",
        "mean": "이 행사에는 남녀 불문하고 참여하실 수 있습니다."
      },
      {
        "answer": "を問わず",
        "word": "インターネットが発達したことで, 場所を問わずどこでも仕事ができるようになった。",
        "mean": "인터넷이 발달하면서 장소를 불문하고 어디서나 일할 수 있게 됐다."
      },
      {
        "answer": "を問わず",
        "word": "このオンラインショップは購入数や購入金額を問わず, 送料無料です。",
        "mean": "이 온라인 상점은 구입 수와 구입 금액을 불문하고 무료 배송입니다."
      }
    ]
  },
  {
    "id": 95,
    "grammar": "をはじめ",
    "means": "~을 비롯하여",
    "description": "대표적으로 하나를 예로 들고, 그 외 다른 것도 모두",
    "connectionWays": "명사 직접 접속",
    "examples": [
      {
        "answer": "をはじめ",
        "word": "田中さんはピアノをはじめ, ギター, ドラム, バイオリンなど多くの楽器を演奏できる。",
        "mean": "다나카씨는 피아노를 비롯해 기타, 드럼, 바이올린 등 많은 악기를 연주할 수 있다."
      },
      {
        "answer": "をはじめ",
        "word": "今年はマレーシアをはじめ, 東南アジアの各国を旅行したいと思っている。",
        "mean": "올해는 말레이시아를 비롯해 동남아 각국을 여행하고 싶다."
      },
      {
        "answer": "をはじめ",
        "word": "ハンバーガーはアメリカをはじめ, 世界中で食べられるようになった。",
        "mean": "햄버거는 미국을 비롯해 전 세계에서 먹을 수 있게 됐다."
      },
      {
        "answer": "をはじめ",
        "word": "日本には英語をはじめ, フランス語, ドイツ語などから来た外来語がたくさんある。",
        "mean": "일본에는 영어를 비롯해 프랑스어, 독일어 등에서 온 외래어가 많이 있다."
      },
      {
        "answer": "をはじめ",
        "word": "カップヌードルはアジアをはじめ, 世界中で売られるようになった。",
        "mean": "컵누들은 아시아를 비롯해 전 세계에서 팔리게 됐다."
      },
      {
        "answer": "をはじめ",
        "word": "昨年は黒田先生をはじめ, たくさんの先生方にお世話になりました。",
        "mean": "작년에는 구로다 선생님을 비롯한 많은 선생님들께 신세를 졌습니다."
      },
      {
        "answer": "をはじめ",
        "word": "日本のスポーツとしては, 相撲をはじめ, 柔道, 剣道, 弓道などが挙げられる。",
        "mean": "일본 스포츠로는 스모를 비롯해 유도, 검도, 궁도 등을 들 수 있다."
      },
      {
        "answer": "をはじめ",
        "word": "日本の伝統芸能としては, 歌舞伎をはじめ, 生け花, 能などが挙げられる。",
        "mean": "일본 전통 예능으로는 가부키를 비롯해 꽃꽂이, 노 등을 들 수 있다."
      }
    ]
  },
  {
    "id": 96,
    "grammar": "をめぐって",
    "means": "~을 둘러싸고",
    "description": "물리적으로 둘러 싸는게 아니라, ‘논쟁・문제점・쟁점 등 추상적인 것을 둘러싸다’ 라는 표현",
    "connectionWays": "명사 직접 접속",
    "examples": [
      {
        "answer": "をめぐって",
        "word": "残り１つしかないアイスクリームをめぐって, 息子たちが喧嘩している。",
        "mean": "하나밖에 남지 않은 아이스크림을 놓고 아들들이 싸우고 있다."
      },
      {
        "answer": "をめぐって",
        "word": "このドラマは１人の女性をめぐって, ４人の男性が争うストーリーです。",
        "mean": "이 드라마는 한 여자를 두고 네 남자가 싸우는 스토리입니다."
      },
      {
        "answer": "をめぐり",
        "word": "高層マンションの建設をめぐり, 近隣住民と建設会社が対立している。",
        "mean": "고층 아파트 건설을 둘러싸고 인근 주민과 건설사가 갈등을 빚고 있다."
      },
      {
        "answer": "をめぐって",
        "word": "原発の賛否をめぐって, 様々な意見が飛び交っている。",
        "mean": "원전 찬반을 놓고 다양한 의견이 난무하고 있다."
      },
      {
        "answer": "をめぐって",
        "word": "父の遺産をめぐって, 兄弟が争っている。",
        "mean": "아버지의 유산을 둘러싸고 형제가 싸우고 있다."
      },
      {
        "answer": "をめぐって",
        "word": "子供の親権をめぐって, 裁判が行われた。",
        "mean": "자녀의 친권을 둘러싸고 재판이 진행됐다."
      }
    ]
  },
  {
    "id": 97,
    "grammar": "甲斐(かい) が + ",
    "means": "~보람이 있다 / 없다\n~가치가 있다 / 없다",
    "description":
        "甲斐がある, 甲斐があって 는 효과나 가치가 있는 것\n\n甲斐がない, 甲斐もなく 는 효과나 가치가 없는 것",
    "connectionWays": "명사 + の + 甲斐\n동사 과거형 + 甲斐\n동사 ます 형 + 甲斐 (がい로 읽힘.)",
    "examples": [
      {
        "answer": "頑張った甲斐があって",
        "word": "筋トレ頑張った甲斐があって１週間で２キロ落ちた。",
        "mean": "헬스를 열심히 한 보람 있어 1주에 2키로 감량했다."
      },
      {
        "answer": "作ったかいがある",
        "word": "そう言ってもらえると作ったかいがある。",
        "mean": "그렇게 말해주니 만든 보람이 있다"
      },
      {
        "answer": "甲斐もなく",
        "word": "あれこれと救急治療を施してもらいましたが, その甲斐もなく息を引き取りました。",
        "mean": "이것저것 응급 치료를 해 주었지만, 그 보람도 없이 숨을 거두었습니다."
      },
      {
        "answer": "甲斐もなく",
        "word": "治療の甲斐もなく約７年の短い生涯の幕を閉じました。",
        "mean": "치료의 보람도 없이 약 7년의 짧은 생의 막을 내렸습니다."
      },
      {
        "answer": "したかいがあって",
        "word": "必死に練習したかいがあって, チームのリーダーに選ばれた。",
        "mean": "열심히 연습한 보람이 있어, 팀 리더로 뽑혔다."
      },
      {
        "answer": "甲斐あって",
        "word": "リハビリの甲斐あって一人で歩くことができるようになった。",
        "mean": "재활한 보람이 있어 혼자 걸을 수 있게 됐다."
      },
      {
        "answer": "並ぶかいがある",
        "word": "この店のシュークリームが好きなら, １時間でも並ぶかいがある。",
        "mean": "이 가게의 슈크림을 좋아한다면 1시간이라도 기다릴 가치가 있다"
      }
    ]
  },
  {
    "id": 98,
    "grammar": "ざる / ざる得ない",
    "means": "~하지 않는 /~하지 않을 수 없다",
    "description":
        "~ざる~하지 않는\n 한정된 상황에서만 쓰이는 표현\n\n~ざるをえない~하지 않을 수 없다 \n~하고 싶지 않지만 어쩔 수 없는 사정 때문에 한다는 의미. \nする는 せざるをえない형태로 사용",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "ざるを得ない",
        "word": "彼のことは好きではないが, その実力は認めざるを得ない。",
        "mean": "그를 좋아하지 않지만 그 실력은 인정하지 않을 수 없다."
      },
      {
        "answer": "せざるを得ない",
        "word": "雨が降ったら, 中止せざるを得ない。",
        "mean": "비가 오면 중지하지 않을 수 없다."
      },
      {
        "answer": "ざるを得ない",
        "word": "完膚なきまでに叩きのめされ, 負けを認めざるを得ない。",
        "mean": "철저히 두들겨 맞고 패배를 인정하지 않을 수 없다."
      },
      {
        "answer": "ざるを得ない",
        "word": "今回の件で, さすがに彼の人間性を疑わざるを得ない。",
        "mean": "이번 일로 과연 그의 인간성을 의심하지 않을 수 없다."
      },
      {
        "answer": "せざるを得ないのではないだろうか",
        "word": "世間は彼の行動に大バッシングを浴びせているが, 誰しもその状況になったらそうせざるを得ないのではないだろうか。",
        "mean": "세상은 그의 행동에 큰 타격을 주고 있지만 누구나 그 상황이 되면 그럴 수밖에 없지 않을까."
      },
      {
        "answer": "にならざるを得ない",
        "word": "早く終わらせたいが, この部分は危険が伴うので慎重にならざるを得ない。",
        "mean": "빨리 끝내고 싶지만 이 부분은 위험이 따르기 때문에 신중할 수밖에 없다."
      }
    ]
  },
  {
    "id": 99,
    "grammar": "てもやむを得ない",
    "means": "~해도 어쩔 수 없다",
    "description": "그렇게 되버린 것은 필연적이여서 어쩔 수가 없는 것을 표현.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "やむを得ない",
        "word":
            "転職回数が多いと, 企業の採用担当から[ この人, せっかく採用してもすぐ辞めてしまうんじゃないか？ ]と疑念を持たれてもやむを得ない。",
        "mean":
            "이직 횟수가 많으면 기업 채용 담당자로부터 \"이 사람, 모처럼 채용해도 금방 그만두지 않을까?\"라는 의심을 받아도 어쩔 수 없다."
      },
      {
        "answer": "やむを得ない",
        "word": "政治家は批判されてもやむを得ない職業だ。",
        "mean": "정치인은 비판을 받아도 어쩔 수 없는 직업이다."
      },
      {
        "answer": "やむを得ない",
        "word": "通り魔は死刑になってもやむを得ない。",
        "mean": "통과마는 사형을 당해도 어쩔 수 없다."
      },
      {
        "answer": "やむを得ない",
        "word": "近くに幼稚園や小中学校があるなら, 昼間の多少うるさくてもやむを得ないと考えるべきだ。",
        "mean": "인근에 유치원이나 초중학교가 있다면 낮에 다소 시끄러워도 어쩔 수 없다고 봐야 한다."
      },
      {
        "answer": "やむを得ない",
        "word": "宣伝が足りていないので, 新商品の知名度が低いのもやむを得ない。",
        "mean": "홍보가 부족하다 보니 신상품의 지명도가 낮은 것도 어쩔 수 없다."
      },
      {
        "answer": "やむを得ない",
        "word": "震災により事業の継続が困難または不可能となった場合, 労働者の解雇はやむを得ない。",
        "mean": "지진 재해로 인해 사업의 계속이 곤란하거나 불가능하게 된 경우 근로자의 해고는 어쩔 수 없다."
      },
      {
        "answer": "やむを得ない",
        "word": "児童生徒数の減少を鑑みると, Ａ地区の学校統合はやむを得ない。",
        "mean": "학생 수 감소를 감안할 때 A지구의 학교 통합은 불가피하다."
      },
      {
        "answer": "やむを得ない",
        "word": "ここまでの悪天候だと, 開催中止もやむを得ないだろう。",
        "mean": "지금까지의 악천후라면 개최 중지도 어쩔 수 없을 것이다."
      }
    ]
  },
  {
    "id": 100,
    "grammar": "(た) ところだった",
    "means": "(하마타면)~할 뻔 했다",
    "description": "하마타면 (もう少しで, 危うく, あわや) 등 과 호흥하는 경우가 많다",
    "connectionWays": "동사 기본형\n동사 과거형",
    "examples": [
      {
        "answer": "ところだった",
        "word": "教えてくれなかったらまた忘れるところだった。",
        "mean": "알려주지 않았다면 또 잊을 뻔 했다."
      },
      {
        "answer": "死んでいたところだった",
        "word": "もう少しブレーキを踏むのが遅れていたら死んでいたところだった。",
        "mean": "조금 더 브레이크를 밟는 것이 늦었더라면 죽을 뻔 했다."
      },
      {
        "answer": "ところだった",
        "word": "対処が遅れていたら, あやうくまた犠牲者が出るところだった。",
        "mean": "대처가 늦었더라면 하마터면 또 희생자가 나올 뻔했다."
      },
      {
        "answer": "ところだった",
        "word": "目覚まし設定し忘れて, あやうく寝過ごすところだった。",
        "mean": "알람 설정하는 것을 깜빡하고 하마터면 늦잠을 잘 뻔했다."
      },
      {
        "answer": "ところだった",
        "word": "道に迷って帰って来れなくなるところだった。",
        "mean": "길을 잃고 돌아오지 못할 뻔했다."
      },
      {
        "answer": "ところだった",
        "word": "前の車が不審な挙動をしていて, 危うく事故に巻き込まれるところだった。",
        "mean": "앞차가 수상한 거동을 하고 있어 하마터면 사고에 휘말릴 뻔했다."
      },
      {
        "answer": "ところだった",
        "word": "天気が良くてのんびり歩いていたら, もう少しで電車に乗り遅れるところだった。",
        "mean": "날씨가 좋아 한가롭게 걸었더라면 하마터면 전철을 놓칠 뻔했다."
      },
      {
        "answer": "ところだった",
        "word": "途中で気づいたから良かったものの, もう少しで騙されてお金をむしり取られるところだった。",
        "mean": "중간에 알았으니 망정이지 하마터면 속아 돈을 뜯어낼 뻔했다."
      }
    ]
  },
  {
    "id": 101,
    "grammar": "はおろか",
    "means": "~은 커녕\n~은 물론\n~은 고사하고",
    "description":
        "[Ａはおろか, Ｂも~ない] 의 형태로 자주 사용된다.\n뒷 문장에는 마이너스의 평가가 서술될 수 있으며 부정적인 표현이 온다.\n뒷 문장에 나타난 것은 앞 문장 보다 정도가 높아야한다.\n[も, すら, さえ, まで]등이 자주 호흥된다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "はおろか",
        "word": "正社員はおろか, アルバイトすらなかなか見つからない。",
        "mean": "정규직은 고사하고 아르바이트도 구하기 힘들다."
      },
      {
        "answer": "はおろか",
        "word": "読んだことはおろか, 見たことさえない。",
        "mean": "읽은 적은 고사하고 본 적도 없다."
      },
      {
        "answer": "はおろか",
        "word": "ここは田舎すぎて, コンビニはおろか飲食店すらない。",
        "mean": "여기는 너무 시골이라서 편의점은 고사하고 음식점조차 없어."
      },
      {
        "answer": "はおろか",
        "word": "休憩はおろか, トイレに行く時間さえも取れない。",
        "mean": "휴식은 고사하고 화장실에 갈 시간조차 낼 수 없다."
      },
      {
        "answer": "はおろか",
        "word": "事業を継続することはおろか, 軌道に乗せることさえもできていない。",
        "mean": "사업을 계속하기는커녕 궤도에 오르지도 못하고 있다."
      },
      {
        "answer": "はおろか",
        "word": "休みの日は家はおろか布団からも出ずにごろごろしていた。",
        "mean": "쉬는 날은 집은 고사하고 이불에서도 나오지 않고 빈둥빈둥 놀고 있었다."
      },
      {
        "answer": "はおろか",
        "word": "ここ数年インフルエンザはおろか, 風邪さえも引いたことがない。",
        "mean": "최근 몇 년간 독감은 고사하고 감기조차 걸린 적이 없다."
      },
      {
        "answer": "はおろか",
        "word": "賠償はおろか謝りすらしていない。",
        "mean": "배상은커녕 사과조차 하지 않고 있다."
      },
      {
        "answer": "はおろか",
        "word": "海外はおろか, 隣県にも行ったことがない。",
        "mean": "해외는 고사하고 이웃 현에도 가본 적이 없다."
      },
      {
        "answer": "はおろか",
        "word": "この辺りはコンビニはおろか個人商店すら無い。",
        "mean": "이 근처는 편의점은 고사하고 개인 상점조차 없다."
      },
      {
        "answer": "はおろか",
        "word": "明日のデート, 服はおろか髪型も香水もまだ決まっていない。",
        "mean": "내일 데이트, 옷은 고사하고 헤어스타일도 향수도 아직 정해지지 않았다."
      },
      {
        "answer": "はおろか",
        "word": "髪の毛はもちろん, ヒゲはおろか鼻毛までも白髪になってきた。",
        "mean": "머리카락은 물론 수염은 고사하고 코털까지도 백발이 됐다."
      },
      {
        "answer": "はおろか",
        "word": "両親はおろか, 祖父母も大学を出ていない。",
        "mean": "부모는 고사하고 조부모도 대학을 나오지 않았다."
      },
      {
        "answer": "はおろか",
        "word": "今回のオリンピック, 世界新記録はおろか五輪新記録もほとんど出ていない。",
        "mean": "이번 올림픽 세계 신기록은 고사하고 올림픽 신기록도 거의 나오지 않았다."
      },
      {
        "answer": "はおろか",
        "word": "47都道府県の位置はおろか, 名前さえも正しく言えない。",
        "mean": "47 도도부현의 위치는 고사하고 이름조차도 제대로 말할 수 없다."
      },
      {
        "answer": "はおろか",
        "word": "このキノコは食べるのはおろか, 触ることさえ危険である。",
        "mean": "이 버섯은 먹기는커녕 만지는 것조차 위험하다."
      }
    ]
  },
  {
    "id": 102,
    "grammar": "を思いをする",
    "means": "~한 기분이 되다\n~한 심정이다",
    "description": "주로 감정을 나타내는 형용사와 접속함",
    "connectionWays": "동사, 형용사에 접속",
    "examples": [
      {"answer": "思いをした", "word": "心臓が止まる思いをした", "mean": "심장이 멎는 기분이였다"},
      {
        "answer": "思いをした",
        "word": "毎日いじめられていて, 嫌な思いをした",
        "mean": "매일 괴롭힘 당해 싫은 기분이었다"
      },
      {"answer": "思いをした", "word": "大変つらい思いをした", "mean": "매우 힘든 기분이었다"}
    ]
  },
  {
    "id": 103,
    "grammar": "~(よ)うものなら / (よ)うもんなら",
    "means": "~했다가는",
    "description": "~하려고 했다가는 큰 일이 난다 (좋지 않은 일이 일어난다)\r",
    "connectionWays": "동사 의지형",
    "examples": [
      {
        "answer": "ようものなら",
        "word": "このことが彼女にバレようものなら何をされるか分からない。",
        "mean": "이 일이 그녀에게 들킨다면 무엇을 하실지 모른다."
      },
      {
        "answer": "盾突こうものなら",
        "word": "あの先生に少しでも盾突こうものなら, その何十倍も怒られる。",
        "mean": "저 선생님한테 조금이라도 반항 했다가는 그 몇십 배나 혼난다."
      },
      {
        "answer": "ようものなら",
        "word": "彼はあの時, 気軽に声をかけようものなら物凄い剣幕で睨まれそうなくらいだった。",
        "mean": "그는 그때 선뜻 말을 걸기만 하면 무시무시한 서슬로 노려볼 정도였다."
      },
      {
        "answer": "出そうものなら",
        "word": "うちの猫は少しでもちょっかいを出そうものなら, すぐ噛まれる。",
        "mean": "우리 고양이는 조금이라도 건드렸가는 금방 물린다."
      },
      {
        "answer": "ようものなら",
        "word": "二度寝しようものなら, それからまた数時間は起きられない。",
        "mean": "두 번 잤다가는 그 후로 몇 시간은 더 못 일어나."
      },
      {
        "answer": "ようものなら",
        "word": "このチームから誰か一人でも欠けようものなら, 途端にうまくいかなくなる。",
        "mean": "이 팀에서 누군가 한 명이라도 빠졌다가는, 찰나에 잘 되지 않게 된다."
      },
      {
        "answer": "ようものなら",
        "word": "戦場では, 少しでも人の心が残っていようものなら必ず死ぬ。",
        "mean": "전쟁터에서는 조금이라도 사람의 마음이 남아 있다면 반드시 죽는다."
      },
      {
        "answer": "ようものなら",
        "word": "彼がこっちの真似をしようものなら, 徹底抗戦するつもりだ。",
        "mean": "그가 이쪽의 흉내를 낸다면 철저하게 항전할 생각이다."
      },
      {
        "answer": "ようものなら",
        "word": "連日35度越え, 外に出ようものなら干からびてしまう。",
        "mean": "연일 35도가 넘고 밖에 나가려면 말라버린다."
      },
      {
        "answer": "ようものなら",
        "word": "超大型の台風が来ていて, 一歩でも外に出ようものなら命の保証はないくらいだ。",
        "mean": "초대형 태풍이 오고 있어 한 발짝이라도 밖으로 나가려면 목숨을 장담할 수 없을 정도다."
      },
      {
        "answer": "ようものなら",
        "word": "少しでも彼を怒らせようものなら, すぐ手を出したり物を投げてくる。",
        "mean": "조금이라도 그를 화나게 하면 바로 손을 날리거나 물건을 던져온다."
      },
      {
        "answer": "こうものなら",
        "word": "車で行こうものなら片道15時間かかる。",
        "mean": "차로 가려면 편도 15시간 걸려."
      },
      {
        "answer": "ようものなら",
        "word": "浮気をしようものならもう無理です。",
        "mean": "바람을 피우려면 더 이상 무리예요."
      }
    ]
  },
  {
    "id": 104,
    "grammar": "~を踏まえ / を踏まえて / を踏まえた",
    "means": "~에 입각하여\n~에 입각한",
    "description":
        "[実情, 反省, 結果, 状況 ] 등의 명사를 취하고 그것들을 근거나 전제, 판단 재료로서 무언가 일을 행하는 것을 말하는 문법이다.\n\nをふまえて 라고 발음한다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "を踏まえて",
        "word": "先学期の反省を踏まえて, 今学期はやり方を変えてみる。",
        "mean": "지난 학기의 반성을 바탕으로 이번 학기는 방식을 바꿔본다."
      },
      {
        "answer": "を踏まえ",
        "word": "自分で調べてみた結果を踏まえ, レポートをまとめる。",
        "mean": "스스로 조사해 본 결과를 토대로 리포트를 정리한다."
      },
      {
        "answer": "を踏まえて",
        "word": "中国で生活した経験を踏まえて, 今後の人生に反映させたい。",
        "mean": "중국에서 생활한 경험을 바탕으로 향후 삶에 반영하고 싶다."
      },
      {
        "answer": "を踏まえ",
        "word": "市場規模, 動向などを踏まえ, 様々な角度から検討し総合的に判断する。",
        "mean": "시장규모, 동향등을 근거로 해 다양한 각도에서 검토해 종합적으로 판단한다."
      },
      {
        "answer": "を踏まえて",
        "word": "センシティブなテーマですが, 賛成反対それぞれの立場を踏まえて議論していきたいです。",
        "mean": "민감한 주제이지만 찬성 반대 각각의 입장을 바탕으로 논의해 나가고 싶습니다."
      },
      {
        "answer": "を踏まえ",
        "word": "今回は前回の講義の内容を踏まえ, グループに分かれてグループワークを行います。",
        "mean": "이번 시간에는 지난 강의 내용을 바탕으로 그룹으로 나뉘어 그룹워크를 진행합니다."
      },
      {
        "answer": "を踏まえ",
        "word": "皆さまから頂いたご意見を踏まえ, 今後に生かしてまいります。",
        "mean": "여러분이 주신 의견을 바탕으로 향후에 살려나가겠습니다."
      },
      {
        "answer": "を踏まえ",
        "word": "アンケートの結果を踏まえ, 改善に努めていきます。",
        "mean": "앙케이트의 결과를 근거로 해 개선에 노력하겠습니다."
      }
    ]
  },
  {
    "id": 105,
    "grammar": "~ずにはいられない / ないではいられない",
    "means": "~하지 않고 있을 수 없다",
    "description":
        "자신의 의지와 상관없이 자연스럽게 동작이 일어나는 것을 나타낸다.\n\n마음을 억누를 수 없다, 참을 수 없다",
    "examples": [
      {
        "answer": "せずにはいられない",
        "word": "純真無垢な主人公の恋を応援せずにはいられない。",
        "mean": "순진무구한 주인공의 사랑을 응원하지 않을 수 없다."
      },
      {
        "answer": "ないではいられない",
        "word": "家に花置くのが好きで, 花を見ると買わないではいられない。",
        "mean": "집에 꽃 놓기를 좋아해서 꽃을 보면 사지 않을 수 없다."
      },
      {
        "answer": "せずにはいられない",
        "word": "期待すると恋は失敗する。しかし人間はやはり期待せずにはいられない生き物だ。",
        "mean": "기대하면 사랑은 실패한다.그러나 인간은 역시 기대하지 않을 수 없는 생물이다."
      },
      {
        "answer": "話さずにはいられないから",
        "word": "賢者は, 話すべきことがあるから口を開く。愚者は, 話さずにはいられないから口を開く。",
        "mean": "현명한 사람은 할 말이 있기 때문에 입을 연다.어리석은 자는 말하지 않을 수 없기 때문에 입을 연다."
      },
      {
        "answer": "ずにはいられない",
        "word": "彼女のあの引き締まった細い足は見ずにはいられない。",
        "mean": "그녀의 저 꽉 조인 가는 다리는 보지 않을 수 없다."
      },
      {
        "answer": "ずにはいられない",
        "word": "様々なことを知る中で, 知らなければよかったと思わずにはいられない真実もあるはずだ。",
        "mean": "여러 가지를 알면서 몰랐으면 좋았을 것이라고 생각하지 않을 수 없는 진실도 있을 것이다."
      },
      {
        "answer": "ずにはいられない",
        "word": "Ａ党の政策には文句を言わずにはいられない。",
        "mean": "A당의 정책에는 불평하지 않을 수 없다."
      },
      {
        "answer": "ずにはいられない",
        "word": "ストロベリーもチーズケーキも大好物なので, ストロベリーチーズケーキ, この組み合わせは食べずにはいられない。",
        "mean": "스트로베리도 치즈 케이크도 매우 좋아하기 때문에 딸기 치즈 케이크, 이 조합은 먹지 않을 수 없다."
      }
    ]
  },
  {
    "id": 106,
    "grammar": "~た途端に (とたん) ",
    "means": "~하자 마자",
    "description":
        "전건의 동작 후 바로 후건이 발생했음을 나타낸다.\n\n과거의 일에만 사용할 수 있다.\n\n후건은 주어의 주변에서 발생한 것, 즉 주어 자신이 발견한 것 가능. 따라서 보통은 화자에게 예상 밖이었던 것을 말할 수 있다.\n\n뒷일은 좋은 일이든 나쁜 일이든 올 수 있다.\n\n인칭 제한이 있고, 2인칭은 주어가 될 수 없다.",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "た途端",
        "word": "トイレ来た途端腹痛がおさまった。",
        "mean": "화장실 오자마자 복통이 가라앉았어."
      },
      {
        "answer": "た途端",
        "word": "今年は全然雪降らなくて冬っぽくないねーと, 昨日話した途端に今日はこれだ。",
        "mean": "올해는 전혀 눈이 안 와서 겨울같지 않다고 어제 얘기하자마자 오늘은 이거다."
      },
      {
        "answer": "た途端",
        "word": "家出た途端雨強まってきた。",
        "mean": "집에 나오자마자 비가 세지기 시작했다."
      },
      {"answer": "だ途端", "word": "薬飲んだ途端に治った。", "mean": "약 먹자마자 나았어."},
      {
        "answer": "た途端",
        "word": "彼氏ができた途端, 調子に乗り出した。",
        "mean": "남자친구가 생기자마자 컨디션에 나섰다."
      },
      {
        "answer": "た途端",
        "word": "私と付き合えないと分かった途端, それまで優しくしてくれた人たちが冷たくなって離れていく。",
        "mean": "나와 사귈 수 없다는 것을 알게 된 순간 그동안 잘해줬던 사람들이 차가워져 떠나간다."
      },
      {
        "answer": "た途端",
        "word": "留年した途端に, 家族からは粗大ゴミ扱いを受けている。",
        "mean": "유급하자마자 가족으로부터는 대형 쓰레기 취급을 받고 있다."
      },
      {
        "answer": "た途端",
        "word": "息子はトイレに入った途端, 秒速で出す。",
        "mean": "아들은 화장실에 들어가자마자 초속으로 내보낸다."
      }
    ]
  },
  {
    "id": 107,
    "grammar": "~というより / ~というよりむしろ",
    "means": "~라기 보다",
    "description": "앞 부분 보다 뒷부분이 더 적절하다는 의미",
    "connectionWays": "동사 기본형\n명사\nな형용사 だ\nい형용사 기본형",
    "examples": [
      {
        "answer": "というより",
        "word": "声が聞こえないのはマイクが壊れているというより, パソコンの設定の方の問題だと思う。",
        "mean": "목소리가 들리지 않는 것은 마이크가 고장났다기보다는 컴퓨터 설정 쪽의 문제라고 생각한다."
      },
      {
        "answer": "というより",
        "word": "今回の件は悲しいというより残念だ。",
        "mean": "이번 건은 슬프다기보다 아쉽다."
      },
      {
        "answer": "というより",
        "word": "これからはプログラミングを趣味としてというより, 仕事として頑張って行くつもりだ。",
        "mean": "앞으로는 프로그래밍을 취미로 하는 것보다 일로써 열심히 할 것이다."
      },
      {
        "answer": "というより",
        "word": "日本の満員電車は乗っているというよりは, むしろ詰め込まれているという感じだ。",
        "mean": "일본의 만원 전철은 타고 있다기보다는 오히려 꽉 차 있다는 느낌이다."
      },
      {
        "answer": "というより",
        "word": "金銭面の問題というよりかは, むしろ親の賛成が得られないことが留学できない大きな理由だ。",
        "mean": "금전적 문제라기보다는 오히려 부모의 찬성을 얻지 못하는 것이 유학을 갈 수 없는 큰 이유다."
      },
      {
        "answer": "というより",
        "word": "猫派か犬派かというよりも, まず動物を触ることができない。",
        "mean": "고양이파냐 개파냐보다는 먼저 동물을 만질 수 없다."
      },
      {
        "answer": "というより",
        "word": "人間の運命は, ルール通りに行われるチェスというよりむしろ宝くじを思い起こさせる。",
        "mean": "인간의 운명은 규칙대로 치러지는 체스라기보다는 복권을 떠올리게 한다."
      },
      {
        "answer": "というより",
        "word": "家から出たくないというよりむしろ布団から出たくない。",
        "mean": "집에서 나가기 싫다기보다는 차라리 이불에서 나오기 싫어."
      },
      {
        "answer": "というより",
        "word": "彼女は可愛いというよりむしろ美しいと言った方が正しい。",
        "mean": "그녀는 귀엽다기보다 오히려 아름답다고 말하는 편이 옳다."
      },
      {
        "answer": "というより",
        "word": "毎日コツコツ繰り返し練習するのは, 周り道というよりはむしろ王道だ。",
        "mean": "매일 꾸준히 반복 연습하는 것은 둘레길이라기보다는 오히려 왕도다."
      },
      {
        "answer": "というより",
        "word": "彼女の新しい髪型は似合ってるというよりむしろ好き。",
        "mean": "그녀의 새 머리 스타일은 어울린다기보다는 오히려 좋아."
      },
      {
        "answer": "というより",
        "word": "練習の成果を出すことができず, 悔しいというよりむしろ無力感。",
        "mean": "훈련 성과를 내지 못해 억울하다기보다 오히려 무력감."
      },
      {
        "answer": "というより",
        "word": "息子の大学入試合格は, 嬉しいというよりむしろ安心したという気持ちのほうが強い。",
        "mean": "아들의 대학입시 합격은 기쁘다기보다는 안심했다는 마음이 더 강하다."
      }
    ]
  },
  {
    "id": 108,
    "grammar": "~にしたら / にすれば / にしても",
    "means": "~로서는,~이라면,~입장에서는 ",
    "description":
        "인물을 나타내는 명사에 대해서 그 인물에서 바라본 생각을 추측해서 말하는 문법/\n\n화자 자신을 나타내는 말에는 원칙적으로 접속할 수 없다.\n\n비슷한 문형 [~にしてみたら / にしてみれば / にしてみても] 자기 자신을 나타내는 말에 접속할 수 있다.\n\n✕私にしても\n〇私としては",
    "connectionWays": "사물을 표현하는 명사에 접속",
    "examples": [
      {
        "answer": "にしたら",
        "word": "彼女にしたら初めての子供だろうし, 育児で悩むのもしょうがないことだ。",
        "mean": "여자친구로서는 첫 아이일 테고 육아로 고민하는 것도 어쩔 수 없는 일이다."
      },
      {
        "answer": "にしたら",
        "word": "彼にしたら些細なことでも, 私にとっては違う。",
        "mean": "그 입장에서는 사소한 것이라도, 나에게는 다르다."
      },
      {
        "answer": "にしたら",
        "word": "私は友達として一緒に遊びに行ったつもりだったけど, あの時のお出かけは彼にしたらデートだったらしい。",
        "mean": "나는 친구로서 같이 놀러 갔었는데, 그때 외출은 그에게 데이트였대."
      },
      {
        "answer": "にすれば",
        "word": "ネットでの出会いに嫌悪感を感じる人も多いが, 彼女にすればネットも正当な出会いの場の一つのようだ。",
        "mean": "인터넷 만남에 혐오감을 느끼는 사람도 많지만 그녀 입장에서는 인터넷도 정당한 만남의 장 중 하나인 것 같다."
      },
      {
        "answer": "にしても",
        "word": "教師にしても学生にしても, 卒業式は最も特別な行事だ。",
        "mean": "교사든 학생이든 졸업식은 가장 특별한 행사다."
      },
      {
        "answer": "にしたら",
        "word": "こちらのミスは相手にしたら嬉しいことだ。",
        "mean": "이쪽의 실수는 상대로써는 기쁜 일이다."
      },
      {
        "answer": "にすれば",
        "word": "ホラーは苦手だけど, 慣れてる君にすれば怖いものはないね。",
        "mean": "공포는 잘 못하는데 익숙한 너라면 하면 무서운 건 없네."
      },
      {
        "answer": "にしたら",
        "word": "学校まで大人なら歩いて１０分だけど, 子どもにしたら３０分くらいかかってもおかしくない。",
        "mean": "학교까지 어른이라면 걸어서 10분이지만, 아이 입장에서는 30분 정도 걸려도 이상하지 않다."
      }
    ]
  },
  {
    "id": 109,
    "grammar": "にしては",
    "means": "~치고는",
    "description":
        "일반적으로 상정되는 결과와는 상반된 결과가 발생한 것, 사실과 상정되는 것이 상반된다을 나타낸다.\n\n앞 건과 뒷 건의 주어는 같아야 한다.",
    "connectionWays": "명사 \nい형용사 보통형 \nな형용사 어간 \n동사 보통형 ",
    "examples": [
      {
        "answer": "にしては",
        "word": "この子は, 15歳にしてはずいぶん大人っぽい。",
        "mean": "이 아이는 15살치고는 꽤 어른스럽다."
      },
      {
        "answer": "にしては",
        "word": "昼寝にしては寝すぎてしまった。",
        "mean": "낮잠 치고는 잠을 너무 많이 잤다."
      },
      {
        "answer": "にしては",
        "word": "彼は高校生にしてはやけに落ち着いている。",
        "mean": "그는 고등학생치고는 유난히 침착하다."
      },
      {
        "answer": "にしては",
        "word": "初めてにしてはよくできたほうだと思う。",
        "mean": "처음 치고는 잘 된 편인 것 같아."
      },
      {
        "answer": "にしては",
        "word": "予習したにしてはあまりにも不出来だ。",
        "mean": "예습한 것 치고는 너무 서툴다."
      },
      {
        "answer": "にしては",
        "word": "今日の天気, 今の時期にしては冷え込んでいるほうだ。",
        "mean": "오늘 날씨, 지금치고는 쌀쌀한 편이다."
      },
      {
        "answer": "にしては",
        "word": "ここの家賃は, 駅に近いにしてはあまり高くない。",
        "mean": "이곳의 집세는 역 근처치고는 그다지 비싸지 않다."
      },
      {
        "answer": "にしては",
        "word": "小学生が作ったにしてはクオリティが高すぎる。",
        "mean": "초등학생이 만든 것 치고는 퀄리티가 너무 높아."
      },
      {
        "answer": "にしては",
        "word": "セミは地上で３年から１７年ほど過ごし, 地上に出て羽化する。虫にしてはその一生は長い。",
        "mean": "매미는 지상에서 3년에서 17년 정도 지내다가 지상으로 나와 우화한다.벌레치고는 그 일생이 길다."
      },
      {
        "answer": "にしては",
        "word": "新人にしては落ち着いていてこれからが楽しみだ。",
        "mean": "신인치고는 차분해서 앞으로가 기대된다."
      },
      {
        "answer": "にしては",
        "word": "気温もちょうどよく, ８月のこの時期にしては過ごしやすい感じです。",
        "mean": "기온도 딱 좋아서 8월 이 시기치고는 지내기 좋은 느낌입니다."
      },
      {
        "answer": "にしては",
        "word": "毎日パンやカップラーメンばかり食べている私にしては, 今日のご御飯はまともな食事だ。",
        "mean": "매일 빵과 컵라면만 먹는 나로서는 오늘 밥은 제대로 된 식사다."
      },
      {
        "answer": "にしては",
        "word": "自分で髪染めたにしてはよくできたと思う。",
        "mean": "내가 염색한 것 치고는 잘한 것 같아."
      },
      {"answer": "にしては", "word": "はじめてにしては上出来ですね。", "mean": "처음 치고는 잘 됐네요."}
    ]
  },
  {
    "id": 110,
    "grammar": "~にほかならない / ほかならぬ~",
    "means": "~이 다름없다.\n바로~이다",
    "description": "단정, 강조 표현.\n\n다른 선택지는 없고 바로 그것임을 나타낸다.",
    "connectionWays": "명사 + にほかならない\nほからなぬ + 명사",
    "examples": [
      {
        "answer": "にほかならない",
        "word": "人として最も大事なのは, 心の強さにほかならない。",
        "mean": "사람으로서 가장 중요한 것은 바로 마음의 힘이다."
      },
      {"answer": "にほかならない", "word": "人生は運命にほかならない。", "mean": "인생은 운명이나 다름없다."},
      {
        "answer": "に他ならない",
        "word": "したくないことはしないというのは, わがままに他ならない。",
        "mean": "하기 싫은 일을 하지 않는다는 것은 이기적인 것이나 다름없다."
      },
      {
        "answer": "に他ならない",
        "word": "不幸なのは他人のせいではなく, 自分が悪いからに他ならない。",
        "mean": "불행한 것은 남의 잘못이 아니라 내가 나쁘기 때문이다."
      },
      {
        "answer": "に他ならない",
        "word": "こんな結果になってしまったのは感情的に物事を進めてきたからに他ならない。",
        "mean": "이런 결과가 되어 버린 것은 감정적으로 일을 진행해 왔기 때문이다."
      },
      {
        "answer": "に他ならない",
        "word": "逃げ出すことは, 責任を放棄することに他ならない。",
        "mean": "도망치는 것은 책임을 포기하는 것과 다름없다."
      }
    ]
  },
  {
    "id": 111,
    "grammar": "ものか",
    "means": "1. ~할까 보냐,~하나 봐라 \n2.~할 것인지, 할 것인가 ",
    "description":
        "화자의 매우 강한 부정·거절 표현.강한 부정 때문에 반발적인 태도를 보인다.\n\n[もんか] 는 회화체 표현\n\n남자는 일반적으로 [ものか / もんか]사용하고 여자는 [ものですか / もんですか ] 사용하는 경우가 많다.",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 보통형",
    "examples": [
      {"answer": "もんか", "word": "あいつに負けてたまるもんか。", "mean": "저놈한테 질까 보냐!"},
      {"answer": "ものか", "word": "死など怖いものか。", "mean": "죽음이란 무서워 할 까 보냐!"},
      {
        "answer": "ものか",
        "word": "二度とこんなところに来るものか。",
        "mean": "다시는 이런 곳에 오나봐라 !."
      },
      {"answer": "ものか", "word": "私の気持ちがお前に分かるものか。", "mean": "내 마음을 네가 알겠느냐?!"},
      {
        "answer": "もんか",
        "word": "こんなところで諦められるもんか。",
        "mean": "이런 데서 포기할 수 있겠느냐!."
      },
      {
        "answer": "ものか",
        "word": "誰がお前なんかと友達になるものか。",
        "mean": "누가 너 따위와 친구가 되겠느냐."
      },
      {
        "answer": "ものか",
        "word": "あの店は店員の態度が悪すぎる。二度と行くものか。",
        "mean": "저 가게는 점원의 태도가 너무 나쁘다.다시는 가냐 보냐"
      },
      {
        "answer": "ものか",
        "word": "大切な思い出, そう易々と忘れるものか。",
        "mean": "소중한 추억, 그렇게 쉽게 잊을 수 되겠느냐!."
      }
    ]
  },
  {
    "id": 112,
    "grammar": "ものがある",
    "means": "~하는 데가 있다,~것이 있다",
    "description":
        "[ＡにはＢものがある, ＡのはＢものがある] 등의 형태로 사용된다.\n\nＡ 안에 있는 성질이나 속성이 Ｂ도 있다. \n\n객관적인 표현",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 보통형",
    "examples": [
      {
        "answer": "ものがある",
        "word": "彼女の人気は根強いものがある。",
        "mean": "그녀의 인기는 뿌리 깊은게 있다."
      },
      {
        "answer": "ものがある",
        "word": "10ｋｍも走るのは辛いものがある。",
        "mean": "10km나 뛰는 건 힘든 게 있어."
      },
      {
        "answer": "ものがある",
        "word": "彼の行動には目に余るものがある。",
        "mean": "그의 행동에는 눈에 거슬리는 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "Ａ社の技術には目を見張るものがある。",
        "mean": "A사의 기술에는 눈에 크게 띌 만한 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "この仕事はある程度の経験がないと厳しいものがある。",
        "mean": "이 일은 어느 정도의 경험이 없으면 힘든 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "彼女の演技には, 人の心を動かすものがある。",
        "mean": "그녀의 연기에는 사람의 마음을 움직이는 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "将来を想像するだけでつらいものがある。",
        "mean": "장래를 상상하는 것만으로도 괴로운 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "彼の言葉には, 心に突き刺さるものがある。",
        "mean": "그의 말에는 마음에 박히는 것이 있다."
      },
      {
        "answer": "ものがある",
        "word": "この映画には何やら感慨深いものがある。",
        "mean": "이 영화에는 뭔가 감개가 깊은 것이 있다"
      },
      {
        "answer": "ものがある",
        "word": "動物の眼には, 人間の眼と機能が大きく異なるものがある。",
        "mean": "동물의 눈에는 인간의 눈과 기능이 크게 다른 것이 있다."
      }
    ]
  },
  {
    "id": 113,
    "grammar": "~に至る /~に至って",
    "means": "~에 이르다 /~에 이르러서",
    "description": "여러 단계를 거쳐 최종단계에 도달하다.",
    "connectionWays": "동사 기본형, 명사에 직접 접속",
    "examples": [
      {
        "answer": "に至って",
        "word": "店を構えるに至って, ターゲットとなる客層を意識することはかなり大事だ。",
        "mean": "가게를 차리기에 이르러 타깃이 되는 손님층을 의식하는 것은 상당히 중요하다."
      },
      {
        "answer": "に至り",
        "word": "海外留学するに至り, 初めて自国を客観的に見ることができるようになったと思う。",
        "mean": "해외 유학을 가기에 이르러 비로소 자국을 객관적으로 볼 수 있게 되었다고 생각한다."
      },
      {
        "answer": "に至って",
        "word": "この車は購入するに至って年収審査がある。審査に通らなければ購入できない。",
        "mean": "이 차는 구입하기에 이르러 연봉 심사가 있다.심사를 통과하지 않으면 구입할 수 없다."
      },
      {
        "answer": "今に至って",
        "word": "今に至って今さらそんなことを言うのはおかしい。",
        "mean": "이제 와서 그런 말을 하는 것은 이상하다."
      },
      {
        "answer": "に至り",
        "word": "先生に注意されるに至り, ようやく自分の間違いに気づいた。",
        "mean": "선생님께 주의를 받기에 이르렀고, 그제서야 자신의 실수를 깨달았다."
      },
      {
        "answer": "に至るまで",
        "word": "9時間に至るまで, 警察の取り調べは続けられた。",
        "mean": "9시간에 이르기까지 경찰 조사는 계속됐다."
      },
      {
        "answer": "に至るまで",
        "word": "このアニメは子供から大人に至るまで幅広い層で人気があります。",
        "mean": "이 애니메이션은 어린이부터 어른에 이르기까지 폭넓은 층에서 인기가 있습니다."
      },
      {
        "answer": "に至るまで",
        "word": "肩から指先に至るまで, 少し痛みがる。",
        "mean": "어깨부터 손가락 끝까지 약간 아프다"
      },
      {
        "answer": "に至るまで",
        "word": "現在に至るまで, この事件の真相は解明されていない。",
        "mean": "현재까지 이 사건의 진상은 밝혀지지 않았다."
      }
    ]
  },
  {
    "id": 114,
    "grammar": "と思いきや",
    "means": "~라고 생각했더니,~줄 알았더니",
    "description": "~라고 생각했지만 생각과 반대로 뜻밖의 결과가 나왔다",
    "connectionWays": "보통형 접속, 명사だ",
    "examples": [
      {
        "answer": "と思いきや",
        "word": "この映画はホラーかと思いきや, 実はコメディ映画だった。",
        "mean": "이 영화는 공포인 줄 알았는데 사실 코미디 영화였다."
      },
      {
        "answer": "と思いきや",
        "word": "やっと, たまっていた仕事が片付いたかと思いきや, 部長に新たな仕事を頼まれた。",
        "mean": "겨우 밀린 일이 정리된 줄 알았더니 부장님께 새로운 일을 부탁받았다."
      },
      {
        "answer": "と思いきや",
        "word": "ジェシカさんは２ヶ月前に会社を辞めたから帰国したのかと思いきや, 日本人の男性と結婚して生活していた。",
        "mean": "제시카 씨는 두 달 전 회사를 그만뒀기 때문에 귀국한 줄 알았더니 일본인 남성과 결혼해 생활하고 있었다."
      },
      {
        "answer": "と思いきや",
        "word": "トムさんとジェームスさんはいつも一緒にいるから仲がいいのかと思いきや, 実はそうでもなかった。",
        "mean": "톰과 제임스는 항상 함께 있어서 사이가 좋은 줄 알았는데 사실 그렇지도 않았다."
      },
      {
        "answer": "と思いきや",
        "word": "試験は難しいと思いきや, 思っていたよりも簡単だった。",
        "mean": "시험은 어렵다고 생각했는데 생각보다 쉬웠다."
      },
      {
        "answer": "と思いきや",
        "word": "新しい取引先の担当者は怖い人だと思いきや, とても優しくて良い人だった。",
        "mean": "새 거래처 담당자는 무서운 사람인가 싶더니 아주 상냥하고 좋은 사람이었다."
      },
      {
        "answer": "と思いきや",
        "word": "ロバートさんは日本人の奥さんがいるから, 日本語が上手かと思いきや, 全然話せなかった。",
        "mean": "로버트씨는 일본인 부인이 있어서 일본어를 잘하는 줄 알았는데 전혀 말할 수 없었다."
      }
    ]
  }
];
List<Map<String, dynamic>> json_grammars_n3 = //
    [
  {
    "id": 1,
    "grammar": "~間だ, ~間に",
    "means": "~동안(에) , ~사이(에)",
    "description":
        "A間B   : A기간 동안 B의 동사가 지속되는 경우에 사용\nA間にB : A기간 중에 B의 동사가 완료되는 경우에 사용",
    "connectionWays": "명사 + の\n동사 사전형",
    "examples": [
      {
        "answer": "間",
        "word": "私が留守の間, 猫たちの世話を頼む。",
        "mean": "내가 부재중인 동안 고양이들을 돌봐달라고 부탁한다."
      },
      {"answer": "間", "word": "彼を７年もの間拘束されていた。", "mean": "그를 7년 동안 구속당했다."},
      {"answer": "間", "word": "少しの間, ここで待ってろ。", "mean": "잠깐만 여기서 기다려라."},
      {
        "answer": "間",
        "word": "帰宅までの間, ちょっと電話で話そう。",
        "mean": "귀가할 때까지 전화통화 좀 하자."
      },
      {
        "answer": "間",
        "word": "10分くらいの間, 微妙な沈黙が漂っていた。",
        "mean": "10분가량 미묘한 침묵이 감돌았다."
      },
      {
        "answer": "間",
        "word": "私が帰る間だけ雨止んでほしい。",
        "mean": "내가 가는 동안만 비 그쳤으면 좋겠어."
      },
      {
        "answer": "間",
        "word": "寝ている間, ずっとエアコンつけっぱなしだった。",
        "mean": "자는 동안 계속 에어컨을 켜고 있었어."
      },
      {
        "answer": "間",
        "word": "走る前は寒いけど, 走っている間は寒くない。",
        "mean": "달리기 전에는 춥지만 달리는 동안에는 춥지 않아."
      },
      {
        "answer": "間",
        "word": "コンビニでお弁当温めてもらっている間, 何もすることがなくて気まずい。",
        "mean": "편의점에서 도시락 데워주는 동안 아무것도 할 일이 없어서 찜찜하다."
      },
      {
        "answer": "間",
        "word": "大学生の間, 一度もアルバイトをしたことがない。",
        "mean": "대학생 동안 한 번도 아르바이트를 해본 적이 없다."
      },
      {
        "answer": "間に",
        "word": "スーパーで買い物をしていたたった15分の間に車が盗まれた。",
        "mean": "슈퍼마켓에서 쇼핑을 하던 단 15분 사이에 차가 도난당했다."
      },
      {"answer": "間に", "word": "寝てる間にパンツが脱げていた。", "mean": "자는 동안 팬티가 벗겨져 있었어."},
      {
        "answer": "間に",
        "word": "大学生の間にやるべきことは, 交友を広げることである。",
        "mean": "대학생 사이에 할 일은 교우를 넓히는 것이다."
      },
      {
        "answer": "間に",
        "word": "娘がお風呂に入っている間に夕食の準備をする。",
        "mean": "딸이 목욕하는 동안 저녁 식사 준비를 한다."
      },
      {
        "answer": "間に",
        "word": "ぐずぐずしている間にチャンスを逃してしまった。",
        "mean": "우물쭈물하는 사이에 기회를 놓치고 말았다."
      },
      {
        "answer": "間に",
        "word": "私が実家に帰省している間に, 夫が家に女を連れ込んだ。",
        "mean": "내가 친정에 귀성하는 동안 남편이 집으로 여자를 데려왔다."
      },
      {"answer": "間に", "word": "夏休みの間に髪型を変えた。", "mean": "여름방학 동안 헤어스타일을 바꿨다."},
      {
        "answer": "間に",
        "word": "ちょっと昼寝してた間に配達が来てたみたいだ。",
        "mean": "잠깐 낮잠 자는 사이에 배달 온 것 같아."
      },
      {
        "answer": "間に",
        "word": "入院してる間にだいぶ筋肉が落ちた。",
        "mean": "입원하는 동안 근육이 많이 떨어졌어."
      },
      {
        "answer": "間に",
        "word": "宇宙の謎とかたぶん自分が生きている間には解明されないんだろうと思うと悲しい。",
        "mean": "우주의 수수께끼라든가 아마 자신이 살아 있는 동안에는 해명되지 않을 것이라고 생각하면 슬프다."
      }
    ]
  },
  {
    "id": 2,
    "grammar": "~後 に / で",
    "means": "~한 후에",
    "description":
        "동작 A가 끝난 후 B의 동작을 수행하거나, B의 상태가 남아있는 것을 표현하는 문법.\n\n[後に]는 뒷 문장의 상태가 남아 있음을 나타내며 [後で]는 동작 B를 수행하는 것을 나타낸다.\n\n시간 명사 혹은 한자 명사와 접속할 경우 원칙적으로 [ご]라고 읽는다.\n\n장소 명사와 붙을 경우 [うしろ] 가 되는 경우가 많지만. 예외도 존재한다.",
    "connectionWays": "명사 + の\n동사 과거형 접속",
    "examples": [
      {"answer": "後の", "word": "仕事の後のお風呂は最高だ。", "mean": "퇴근 후 목욕은 최고다."},
      {
        "answer": "後",
        "word": "トイレに行った後は必ず手を洗うこと。",
        "mean": "화장실에 간 후에는 반드시 손을 씻어라."
      },
      {
        "answer": "後の",
        "word": "外出た後の足はいつも臭い。",
        "mean": "밖에 나간 뒤 발은 항상 낸다새가 난다."
      },
      {"answer": "後", "word": "試合後悔しくて涙を流した。", "mean": "경기 후 분해서 눈물을 흘렸다."},
      {
        "answer": "後に",
        "word": "学生時代はよく放課後に友達と遊びにいった。",
        "mean": "학창시절에는 방과 후에 친구들과 놀러 자주 갔다."
      },
      {"answer": "後に", "word": "5分後に出発します。", "mean": "5분 후에 출발합니다."},
      {
        "answer": "後に",
        "word": "アイスクリームを食べた後には必ずお腹が痛くなる。",
        "mean": "아이스크림을 먹은 후에는 반드시 배가 아파."
      },
      {
        "answer": "後で",
        "word": "家を出た後で忘れ物をしたことに気づいた。",
        "mean": "집을 나간 후에 물건을 두고 온 것을 깨달았다."
      }
    ]
  },
  {
    "id": 3,
    "grammar": "いくら~ても\nどんなに~ても",
    "means": "아무리 ~ 해도",
    "description": "(수량 또는 정도)가 아무리 심해도 ~ ",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "いくら",
        "word": "いくら話しても, 分かってくれない。",
        "mean": "아무리 얘기해도 알아주지 않아."
      },
      {
        "answer": "いくら",
        "word": "いくら冗談でも許されない。",
        "mean": "아무리 농담이라도 용서받을 수 없다."
      },
      {
        "answer": "どんなに",
        "word": "どんなに苦しくても最後まで走り抜くつもりだ。",
        "mean": "아무리 힘들어도 끝까지 달려나갈 것이다."
      },
      {
        "answer": "でも",
        "word": "いくら好きでも, それを伝えなければ始まらない。",
        "mean": "아무리 좋아도 그것을 전하지 않으면 시작할 수 없다."
      },
      {
        "answer": "ても",
        "word": "どんなに曇っていても, 雲の上はいつも青い空が広がっている。",
        "mean": "아무리 흐리더라도 구름 위는 늘 푸른 하늘이 펼쳐져 있다."
      },
      {
        "answer": "どんなに",
        "word": "好きなチームなら, どんなに負けが続いても応援したくなる。",
        "mean": "좋아하는 팀이라면 아무리 패배해도 응원하고 싶어진다."
      },
      {
        "answer": "どんなに",
        "word": "この作業はどんなに頑張っても1時間以上はかかりそう。",
        "mean": "이 작업은 아무리 열심히 해도 1시간 이상은 걸릴 것 같아."
      },
      {
        "answer": "いくら",
        "word": "いくら生活が苦しくても離れて行かないお嫁さんをもらいなさいと親が教えてくれた。",
        "mean": "아무리 생활이 어려워도 떠나지 않는 며느리를 얻으라고 부모님이 가르쳐 주셨다."
      },
      {
        "answer": "どんなに",
        "word": "どんなに嫌われても構わない。私もあいつが嫌いだから。",
        "mean": "아무리 미움을 받아도 상관없어.나도 쟤가 싫으니까."
      }
    ]
  },
  {
    "id": 4,
    "grammar": "~うちに\n~ないうちに",
    "means": "~うちに : ~하는 동안에\n~ないうちに : ~하기 전에",
    "description":
        "어떤 상태가 지속되고 있는 기간을 나타낸다.\n\n뒷 내용에는 그 기간 내에 어떠한 동작을 하는 것이나 변화가 생기는 것이 기술된다.\n\n뒷 내용에 접속하는 동사의 종류에 따라 뉘앙스가 달라짐.\n\n특히 뒷 내용이 의지적인 동작일 경우 [그 짧은 시간을 이용하여 ~한다, 그 틈에 ~하다] 와 같은 뉘앙스를 가지며, 이 문형으로 표현되는 기간은 주관적으로 짧다고 느끼는 정도야함.",
    "connectionWays": "명사(うち) 접속형에 따름함",
    "examples": [
      {"answer": "うちに", "word": "休めるうちに休もう。", "mean": "쉴 수 있을 때 쉬자."},
      {
        "answer": "うちに",
        "word": "ひとりのうちにやりたいこと全部やっときな。",
        "mean": "혼자서 하고 싶은 거 다 해."
      },
      {"answer": "うちに", "word": "今のうちに頑張らないと…。", "mean": "지금 안에 열심히 해야지.."},
      {
        "answer": "うちに",
        "word": "環境とか変わって無意識のうちに疲れとかたまってるかも。",
        "mean": "환경이라든가 바뀌어서 무의식중에 피로라든가 쌓여있을 수도 있어요."
      },
      {
        "answer": "引かないうちに",
        "word": "風邪引かないうちに風呂に入ってきて下さい。",
        "mean": "감기 걸리기 전에 목욕하고 오세요."
      },
      {"answer": "うちに", "word": "生きてるうちに一度は行きたい。", "mean": "살면서 한번쯤은 가고싶어."},
      {
        "answer": "うちに",
        "word": "ゴールデンウィークに何するかを考えてるうちにゴールデンウィークが終わりそう。",
        "mean": "황금연휴에 뭘 할지 생각하다 보면 황금연휴가 끝날 것 같아."
      },
      {
        "answer": "ないうちに",
        "word": "痛くないうちに治療できればいい。",
        "mean": "아프기 전에 치료할 수 있으면 돼."
      },
      {
        "answer": "うちに",
        "word": "膝に知らないうちに青あざができてた。",
        "mean": "무릎에 모르는 사이에 파래멍이 들었어."
      },
      {
        "answer": "いるうちに",
        "word": "話しているうちに眠気が襲ってきた。",
        "mean": "이야기하는 사이에 졸음이 엄습했다."
      },
      {
        "answer": "うちに",
        "word": "難しい曲でも練習を重ねるうちに弾けるようになる。",
        "mean": "어려운 곡이라도 연습을 거듭하다 보면 칠 수 있게 된다."
      }
    ]
  },
  {
    "id": 5,
    "grammar": "~おかげで",
    "means": "~덕분에",
    "description": "어떤 원인에서 좋은 결과가 나왔음을 나타낸다.\n\n비아냥 표현으로도 사용된다",
    "connectionWays": "명사(おかげ) 접속형에 따름함",
    "examples": [
      {
        "answer": "おかげで",
        "word": "みなさんのおかげで, 私たちは結婚することができました。",
        "mean": "여러분 덕분에 우리는 결혼할 수 있었습니다."
      },
      {
        "answer": "おかげです",
        "word": "私は今ここにこうやって生きていられるのは間違いなく先生のおかげです。",
        "mean": "저는 지금 여기 이렇게 살 수 있는 건 틀림없이 선생님 덕분이에요."
      },
      {
        "answer": "おかげだ",
        "word": "こんな軽い怪我で済んだのは, あなたのおかげだ。",
        "mean": "이렇게 가벼운 부상으로 끝난 것은 당신 덕분이다."
      },
      {
        "answer": "おかげだ",
        "word": "今君が生きていられるのは, 誰のおかげだと思ってる？",
        "mean": "지금 네가 살아있을 수 있는 건 누구 덕분이라고 생각해?"
      },
      {
        "answer": "おかげで",
        "word": "病状も薬のおかげで結構楽になってきた。",
        "mean": "병세도 약 덕분에 많이 편해졌다."
      },
      {
        "answer": "おかげ",
        "word": "私が成功したのも周りのおかげ。",
        "mean": "내가 성공한 것도 주변 덕분이야."
      },
      {
        "answer": "おかげで",
        "word": "皆協力してくれたおかげでなんとかなりそう。",
        "mean": "다들 협조해준 덕분에 어떻게든 될 것 같아."
      },
      {
        "answer": "おかげか",
        "word": "解熱剤飲んでずっと寝てたおかげか, 平熱まで下がった。",
        "mean": "해열제 먹고 계속 잔 덕분인지 평열까지 떨어졌다."
      }
    ]
  },
  {
    "id": 6,
    "grammar": "がたい",
    "means": "~하기 힘들다\n~하기 어렵다",
    "description":
        "그 동작이 실현되기 어렵다는 것을 나타낸다. [열심히 해도 안 된다, 사실은 하고 싶지만 할 수 없다] 등\n\n[理解しがたい, 信じがたい, 近寄りがたい, 捨てがたい, 許しがたい, 想像しがたい, 耐えがたい] 등에 자주 접속한다.\n\n심정적인 이유일 경우 사용할 수 없으며 1인칭으로만 쓸 수 있다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "がたい",
        "word": "彼はずっと勉強していて, 近寄りがたい雰囲気がある。",
        "mean": "그는 계속 공부하고 있어서 접근하기 어려운 분위기가 있다."
      },
      {
        "answer": "がたい",
        "word": "信じがたいことに, いくつかの企業は月や火星への移住を視野に宇宙開発を行っている。",
        "mean": "믿기 어렵게도 몇몇 기업들은 달이나 화성으로의 이주를 염두에 두고 우주 개발을 하고 있다."
      },
      {
        "answer": "がたい",
        "word": "人の彼女に手を出すなんて, 本当に許しがたい。",
        "mean": "남의 여자친구에게 손을 대다니 정말 용서하기 어렵다."
      },
      {
        "answer": "がたい",
        "word": "独りは孤独だが, 自由とは何ものにも代えがたいものだ。",
        "mean": "혼자는 고독하지만 자유란 무엇과도 바꿀 수 없는 법이다."
      },
      {
        "answer": "がたい",
        "word": "被告の行為は本当に許しがたいものだ。",
        "mean": "피고의 행위는 정말 용서하기 어려운 것이다."
      },
      {
        "answer": "がたい",
        "word": "A国の要求は, 政府にとっては受け入れがたいものである。",
        "mean": "A국의 요구는 정부로서는 받아들이기 어려운 것이다."
      }
    ]
  },
  {
    "id": 7,
    "grammar": "かねない",
    "means": "~할 수도 있다\n~할 지도 모른다",
    "description": "좋지 않은 가능성이나 위험성이 있음 표현함.\n\n화자의 사물에 대한 부정적인 평가로 사용된다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "かねない",
        "word": "彼女は信用できないので秘密を漏らしかねない。",
        "mean": "그녀는 믿을 수 없기 때문에 비밀을 누설할 수 있다."
      },
      {
        "answer": "かねない",
        "word": "こんなにも暑いと熱中症になりかねないから, ちゃんと水分補給しよう。",
        "mean": "이렇게 더우면 열사병 걸릴 수 있으니 수분 보충 잘 하자."
      },
      {
        "answer": "かねない",
        "word": "この手の曖昧な表現は混乱を招きかねない。",
        "mean": "이런 모호한 표현은 혼란을 초래할 수 있다."
      },
      {
        "answer": "かねない",
        "word": "まさかとは思うが, あいつならやりかねない。",
        "mean": "설마 했는데, 저 녀석이라면 할 수도 있어."
      },
      {
        "answer": "かねない",
        "word": "肥満は様々な病気の原因にも繋がりかねない。",
        "mean": "비만은 여러 질병의 원인으로도 이어질 수 있다."
      },
      {
        "answer": "かねない",
        "word": "これは一歩間違えれば死傷者が出かねない事態です。",
        "mean": "이것은 잘못하면 사상자가 날 수 있는 사태입니다."
      },
      {
        "answer": "かねない",
        "word": "センター試験は人生を左右しかねない大切なものだ。",
        "mean": "수능은 인생을 좌우할 수 있는 소중한 것이다."
      },
      {
        "answer": "かねない",
        "word": "ギターは間違った方法で練習すると挫折しかねない。",
        "mean": "기타는 잘못된 방법으로 연습하면 좌절할 수 있다."
      },
      {
        "answer": "かねない",
        "word": "マスクしながらの運動だから余計に暑く, 水分補給しないと脱水症状になりかねないです。",
        "mean": "마스크를 쓰면서 하는 운동이기 때문에 불필요하게 덥고 수분을 보충하지 않으면 탈수 증상이 올 수 있습니다."
      },
      {
        "answer": "かねない",
        "word": "守秘義務を違反すれば裁判沙汰になりかねない。",
        "mean": "수비 의무를 위반하면 재판에 휘말릴 수도 있다."
      },
      {
        "answer": "かねない",
        "word": "爆発的な感染拡大により医療崩壊を招きかねない状態となっている。",
        "mean": "폭발적인 감염 확산으로 의료 붕괴를 초래할 수 있는 상태다."
      },
      {
        "answer": "兼ねない",
        "word": "食べ過ぎてしまうと, お腹を下してしまう原因になり兼ねないので気をつけましょう。",
        "mean": "과식해 버리면 배를 내려 버리는 원인이 될 수도 있기 때문에 조심합시다."
      },
      {
        "answer": "兼ねない",
        "word": "トンネル内は一度火災が起これば大惨事に発展し兼ねない。",
        "mean": "터널 안은 한번 불이 나면 대참사로 발전할 수 있다."
      },
      {
        "answer": "かねない",
        "word": "留年はその後の進路や人生を左右しかねない。",
        "mean": "유급은 그 후의 진로나 인생을 좌우할 수도 있다."
      },
      {
        "answer": "かねない",
        "word": "遺書がないと自分の死後トラブルに発展しかねないのでちゃんと書いておきましょう。",
        "mean": "유서가 없으면 자신의 사후 문제로 발전할 수 있기 때문에 제대로 써 둡시다."
      },
      {
        "answer": "兼ねない",
        "word": "公園にはガラスの破片など, 怪我をし兼ねないようなものが落ちていました。",
        "mean": "공원에는 유리 파편 등 다칠 수도 있는 것 같은 것들이 떨어져 있었습니다."
      }
    ]
  },
  {
    "id": 8,
    "grammar": "かねる",
    "means": "~하기 힘들다\n~하기 어렵다",
    "description":
        "[~하고 싶은데 할 수 없다, ~하고 싶은데 어렵다] 라는 의미로 사용된다.\n\n하지 못하는 이유는 주로 심리적인 것이 원인이 된다.\n\n타인의 부탁이나 명령에 대해서 완곡히 거절하는 표현으로도 사용된다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "見るに見かねて",
        "word": "我した子猫を見るに見かねて, 動物病院へ連れて行った。",
        "mean": "내 새끼 고양이를 보다 못해 동물병원에 데려갔다."
      },
      {
        "answer": "かねます",
        "word": "こちらとしては, それには賛成いたしかねます。",
        "mean": "저희로서는 그것에 찬성하기 어렵습니다."
      },
      {
        "answer": "かねます",
        "word": "確証が無いので判断しかねます。",
        "mean": "확증이 없어서 판단하기 어렵습니다."
      },
      {
        "answer": "かねます",
        "word": "自己責任で行ってください。こちらで責任は負いかねます。",
        "mean": "자기 책임 하에 가세요.저희가 책임지지는 않습니다."
      },
      {"answer": "かねます", "word": "詳しい事情は分かりかねます。", "mean": "자세한 사정은 알 수 없습니다."},
      {
        "answer": "かねます",
        "word": "専門家ではないので適切なアドバイスはしかねます。",
        "mean": "전문가가 아니기 때문에 적절한 조언은 드리기 어렵습니다."
      },
      {
        "answer": "かねます",
        "word": "ご意見は承りましたが, 同意しかねます。",
        "mean": "의견은 받았지만 동의하기 어렵습니다."
      },
      {"answer": "かねます", "word": "その質問には答えかねます。", "mean": "그 질문에는 대답할 수 없어요."},
      {
        "answer": "かねている",
        "word": "仕事を辞めて無職になるか, それとも転職して働き続けるかを決めかねている。",
        "mean": "직장을 그만두고 백수가 될지, 아니면 이직해서 계속 일할지 결정하지 못하고 있다."
      },
      {
        "answer": "かねている",
        "word": "アタックするべきだろうか, 彼女との距離感やタイミングを掴みかねている。",
        "mean": "공격해야 할까, 그녀와의 거리감이나 타이밍을 잡지 못하고 있다."
      },
      {
        "answer": "かねている",
        "word": "意中の人に自分からどう連絡するのがベストなのか計りかねている。",
        "mean": "의중인 사람에게 스스로 어떻게 연락하는 것이 최선인지 헤아릴 수 없다."
      },
      {
        "answer": "かねる",
        "word": "先日も殺人事件があった。先月にも似た手口の殺人事件があったが, 2つの関連性は判断しかねる。",
        "mean": "얼마 전에도 살인사건이 있었다.지난달에도 비슷한 수법의 살인사건이 있었지만 두 가지 연관성은 판단하기 어렵다."
      },
      {
        "answer": "かねる",
        "word": "この作品は男女のドロドロ愛が描かれており, 子供向けとは言いかねる。",
        "mean": "이 작품은 남녀의 끈적끈적한 사랑이 그려져 있어 어린이용이라고 하기 어렵다."
      },
      {
        "answer": "いたしかねます",
        "word": "バスは交通事情, 気象状況により遅延することがありますが, その場合でも運賃の払い戻しはいたしかねますのでご了承下さい。",
        "mean": "버스는 교통 사정, 기상 상황에 따라 지연될 수 있으나, 이 경우에도 운임 환불은 불가하오니 양해 바랍니다."
      },
      {
        "answer": "しかねます",
        "word": "明日は休館日です。終日お電話でのお問い合わせ等もお受けしかねますので, お気を付けください。",
        "mean": "내일은 휴관일입니다.종일 전화 문의 등도 받지 않으므로 주의해 주십시오."
      }
    ]
  },
  {
    "id": 9,
    "grammar": "~から~にかけて",
    "means": "~부터 ~에 걸쳐서",
    "description": "[~から~まで]와 비슷하지만, [~から~にかけて] 는 시작점과 끝지점이 명확하지 않다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にかけて",
        "word": "関東北部はこれから10日の朝にかけて山沿いを中心に雪が降り, 平野部でも積もるところがある見込みです。",
        "mean": "간토 북부는 앞으로 10일 아침에 걸쳐 산을 중심으로 눈이 내려 평야 지역에서도 쌓이는 곳이 있을 전망입니다."
      },
      {
        "answer": "にかけて",
        "word": "日本では3月から5月にかけて桜が見られます。",
        "mean": "일본에서는 3월부터 5월까지 벚꽃을 볼 수 있습니다."
      },
      {
        "answer": "から",
        "word": "茜は夏から秋にかけて花を咲かせる。",
        "mean": "아카네는 여름부터 가을에 걸쳐 꽃을 피운다."
      },
      {
        "answer": "にかけて",
        "word": "年末にかけて更に忙しくなるだろう。",
        "mean": "연말에 걸쳐 더 바빠질 것이다."
      },
      {"answer": "から", "word": "肩から指先にかけて痺れている。", "mean": "어깨에서 손가락 끝에 걸쳐 저리다."}
    ]
  },
  {
    "id": 10,
    "grammar": "代わりに",
    "means": "~대신에",
    "description": "대체, 역접, 대용, 교환 조건 관계이다\n\n쉽게 A하는 대신에 B했다. 라는 뜻.",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간 + な\n명사 + の",
    "examples": [
      {
        "answer": "代わりに",
        "word": "課長の代わりに私が会議に出席します。",
        "mean": "과장님 대신 제가 회의에 참석하겠습니다."
      },
      {
        "answer": "代わりに",
        "word": "後輩の代わりに尻拭いをするはめになった。",
        "mean": "후배 대신 뒷치다꺼리를 해야할 처지가 됬다."
      },
      {
        "answer": "代わりに",
        "word": "この仕事について, 彼の代わりになる人はいない。",
        "mean": "이 일에 대해 그를 대신할 사람은 없다."
      },
      {
        "answer": "代わりに",
        "word": "今の仕事は給料が高い代わりに残業が多い。",
        "mean": "지금 하는 일은 월급이 높은 대신 야근이 많다."
      },
      {
        "answer": "代わりに",
        "word": "運動が全般的に得意な代わりに勉強があまりできない。",
        "mean": "운동을 전반적으로 잘하는 대신 공부를 잘 못해."
      },
      {
        "answer": "代わりに",
        "word": "彼は知らない人には厳しい代わりに, 一度親しくなるとめちゃくちゃ優しい。",
        "mean": "그는 모르는 사람에게는 엄격한 대신 한번 친해지면 굉장히 상냥해."
      },
      {
        "answer": "代わりに",
        "word": "印鑑の代わりにサインでも構いません。",
        "mean": "도장 대신 사인이라도 상관없어요."
      },
      {
        "answer": "代わりに",
        "word": "現金の代わりにこの商品券を使えますか？",
        "mean": "현금 대신 이 상품권을 사용할 수 있나요?"
      },
      {
        "answer": "代わりに",
        "word": "お酒に強くないなら無理して飲まず, お酒の代わりに何か飲みなよ。",
        "mean": "술에 강하지 않으면 무리해서 마시지 말고 술 대신 뭐 좀 마셔."
      },
      {
        "answer": "代わりに",
        "word": "雨が降ったので, 外食する代わりに豪勢な出前を取った。",
        "mean": "비가 와서 외식하는 대신 호화로운 배달을 했다."
      },
      {
        "answer": "代わりに",
        "word": "プログラミング教室に行く代わりに, 参考書を買って自分で勉強している。",
        "mean": "프로그래밍 교실에 가는 대신 참고서를 사서 스스로 공부하고 있다."
      },
      {
        "answer": "代わりに",
        "word": "時間が合わないので, 代わりに伝言を残していった。",
        "mean": "시간이 맞지 않아서 대신 메시지를 남기고 갔다."
      },
      {
        "answer": "代わりに",
        "word": "日本語を教えるので, 代わりに韓国語を教えてください。",
        "mean": "일본어를 가르쳐 드릴테니 대신 한국어를 가르쳐 주세요."
      },
      {
        "answer": "代わりに",
        "word": "明日出勤する代わりに, 明後日は休みになった。",
        "mean": "내일 출근하는 대신 모레는 쉬게 되었다."
      },
      {
        "answer": "代わりに",
        "word": "今度休日出勤しますので, その代わりに明日休みを頂けないでしょうか。",
        "mean": "이번에 휴일 출근하는데 그 대신 내일 휴가를 주실 수 없을까요?"
      }
    ]
  },
  {
    "id": 11,
    "grammar": "~きる / きれる / きれない",
    "means": "~다 한다 / ~다 할 수 있다 / ~다 할 수 없다",
    "description":
        "1. 동작의 완료\n\n2. 극한의 상태에 되는 것을 표현함.\n\n~抜く[ぬく] 와 비슷하지만 抜く는 [어려운 일을 끝가지 열심히 했다] 라는 의미가 내포 되어 있지만, [きる] 에는 없다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "切った",
        "word": "フルマラソンを走り切ったのはこれが初めてだ。",
        "mean": "풀 마라톤을 다 뛴 것은 이번이 처음이다."
      },
      {
        "answer": "切れない",
        "word": "ずっと考えてたんだけど, やっぱり君のことを諦め切れない。",
        "mean": "계속 생각하고 있었는데 역시 너를 포기할 수 없어."
      },
      {
        "answer": "切った",
        "word": "疲れ切ったのか, 帰宅してすぐ寝てしまった。",
        "mean": "피곤했는지 귀가하자마자 잠들어 버렸다."
      },
      {
        "answer": "切ってしまった",
        "word": "昨日大量に買ったチョコをもう食べ切ってしまった。",
        "mean": "어제 대량으로 산 초코를 벌써 다 먹어버렸어."
      },
      {
        "answer": "切ってしまった",
        "word": "給料日なのにもう全部使い切ってしまった。",
        "mean": "월급날인데 벌써 다 써버렸어."
      },
      {
        "answer": "切れない",
        "word": "到底食べ切れない量を注文してしまった。",
        "mean": "도저히 다 먹을 수 없는 양을 주문해 버렸다."
      },
      {
        "answer": "切れない",
        "word": "たくさん買い物して冷蔵庫に入り切れない。",
        "mean": "쇼핑을 많이 해서 냉장고에 들어 넣을 수 없다."
      }
    ]
  },
  {
    "id": 12,
    "grammar": "くせに",
    "means": "~인 주제에",
    "description": "매우 강한 불만이나 비난의 마음을 나타내는 역설의 문법",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간 + な\n명사 + の",
    "examples": [
      {"answer": "くせに", "word": "道が狭いくせに車通りは多い。", "mean": "길이 좁은 주제에 차로는 많다."},
      {
        "answer": "くせに",
        "word": "パッケージは普通なくせに, 食べてみると美味しい。",
        "mean": "패키지는 보통인 주제에 먹어보면 맛있어."
      },
      {
        "answer": "くせに",
        "word": "子供のくせに大人に口答えするな。",
        "mean": "어린 주제에 어른에게 말대꾸하지 마라."
      },
      {"answer": "くせに", "word": "今まで逃げてばかりだったくせに。", "mean": "지금까지 도망만 쳤으면서."},
      {
        "answer": "くせに",
        "word": "言い出しっぺのくせに何もしない。",
        "mean": "말을 꺼내는 주제에 아무것도 하지 않는다."
      },
      {
        "answer": "くせに",
        "word": "人の話は聞かないくせに, 自分の話は聞いて欲しいなんて虫が良すぎる。",
        "mean": "남의 말은 듣지 않으면서 자기 얘기는 들어달라니 벌레가 너무 좋다."
      },
      {
        "answer": "くせに",
        "word": "顔が可愛くないと非難するくせに, 整形したらまた非難される世の中。",
        "mean": "얼굴이 귀엽지 않다고 비난하면서 성형하면 또 비난받는 세상."
      },
      {
        "answer": "くせに",
        "word": "自分が悪いくせに人のせいにするな。",
        "mean": "자기가 나쁜 주제에 남 탓하지 마라."
      },
      {
        "answer": "くせに",
        "word": "自分がやられたら腹が立つくせに, 同じことを人にやるな。",
        "mean": "자기가 당하면 화가 나면서 똑같은 짓을 남에게 하지 마라."
      },
      {
        "answer": "くせに",
        "word": "うちの猫, 夜行性のくせに昼から元気がいい。",
        "mean": "우리 고양이 야행성 주제에 낮부터 기운이 좋아."
      }
    ]
  },
  {
    "id": 13,
    "grammar": "くらい / ぐらい",
    "means": "~정도",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간 + な\n명사 + の",
    "examples": [
      {"answer": "くらい", "word": "食費は毎月3万円くらいかかる。", "mean": "식비는 매달 3만엔 정도 든다."},
      {
        "answer": "ぐらい",
        "word": "今の職場では, 自分の息子ぐらいの人と一緒に働いている。",
        "mean": "지금 직장에서는 자기 아들 정도의 사람과 함께 일하고 있다."
      },
      {"answer": "くらい", "word": "彼女は子どもが5人くらいいる。", "mean": "그녀는 아이가 5명 정도 있다."},
      {"answer": "くらい", "word": "4時間くらい昼寝した。", "mean": "4시간정도 낮잠을 잤다."},
      {"answer": "ぐらい", "word": "喉が痛くなるぐらい笑った。", "mean": "목이 아플 정도로 웃었다."},
      {
        "answer": "くらい",
        "word": "このプリン, 一生買い続けたいくらい好き。",
        "mean": "이 푸딩 평생 사고 싶을 정도로 좋아."
      },
      {
        "answer": "くらい",
        "word": "彼とは冗談を言い合えるくらい仲が良い。",
        "mean": "그와는 농담을 나눌 수 있을 정도로 사이가 좋다."
      },
      {"answer": "くらい", "word": "髪が長くてうっとおしいくらいだ。", "mean": "머리가 길어서 우울할 정도야."},
      {"answer": "くらい", "word": "自分の荷物くらい自分で持て。", "mean": "네 짐만큼 네가 들어라."},
      {
        "answer": "ぐらい",
        "word": "悩みがあるなら, 話ぐらい聞いてあげるよ。",
        "mean": "고민 있으면 얘기 정도 들어줄게."
      },
      {
        "answer": "ぐらい",
        "word": "帰りが遅くなるなら, 連絡ぐらいしてくれてもいいじゃない。",
        "mean": "늦게 퇴근하면 연락정도 해줘도 되잖아."
      },
      {
        "answer": "くらい",
        "word": "お見合いなんだから, 話を盛り上げる努力くらいしたらどう？",
        "mean": "맞선인데, 이야기를 북돋우는 노력 정도는 하는 게 어때?"
      },
      {
        "answer": "くらい",
        "word": "そんなことくらい誰でも知ってる。自慢するな。",
        "mean": "그런 것쯤은 누구나 알아.자랑하지 마."
      },
      {
        "answer": "ぐらい",
        "word": "服ぐらい自分の好きなものを着ればいい。",
        "mean": "옷 정도는 자기가 좋아하는 걸로 입으면 돼."
      },
      {
        "answer": "ぐらい",
        "word": "少し風邪っぽいぐらいで会社を休むな。",
        "mean": "감기 기운이 좀 있을 정도로 회사를 쉬지 마라."
      },
      {
        "answer": "ぐらい",
        "word": "１回失敗したぐらいで落ち込むんじゃない。",
        "mean": "한 번 실패한 정도로 우울해지는 거 아니야."
      }
    ]
  },
  {
    "id": 14,
    "grammar": "동사 사전형 +ことがある",
    "means": "~할 때가 있다",
    "description": "[종종 (가끔) 할 때가 있다] 을 나타낸다\n\n[今でも, たまに, 時々,　まれに] 등 자주 호흥한다.",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "ことがある",
        "word": "寝ている時, いまでもおしっこを漏らすことがある。",
        "mean": "자고 있을 때 지금도 오줌을 쌀 때가 있다."
      },
      {
        "answer": "ことがある",
        "word": "その時の苦い経験をたまに思い出すことがある。",
        "mean": "그때의 쓰라린 경험을 가끔 떠올릴 때가 있다."
      },
      {
        "answer": "ことがある",
        "word": "考え事が多いと眠れないことがある。",
        "mean": "생각이 많으면 잠이 안 올 때가 있다."
      },
      {
        "answer": "こともあります",
        "word": "時間があるときは自分で料理を作ることもあります。",
        "mean": "시간이 있을 때는 스스로 요리를 만들기도 합니다."
      },
      {
        "answer": "こともあります",
        "word": "頭の中に突然変な声が聞こえてくることがあります。",
        "mean": "머릿속에 갑자기 이상한 목소리가 들려올 때가 있어요."
      }
    ]
  },
  {
    "id": 15,
    "grammar": "ことにしている",
    "means": "~하기로 하고 있다.",
    "description":
        "이미 정착된 개인의 습관을 나타날 때 사용하는 표현.\n\n[ようにしている] 와 비슷하지만 [ようにしている] 는 노력의 흔적이 있다.",
    "connectionWays": "동사 사전형",
    "examples": [
      {
        "answer": "ことにしている",
        "word": "寝る前は必ずお風呂に入ることにしている。",
        "mean": "자기 전에는 반드시 목욕을 하기로 하고 있다."
      },
      {
        "answer": "ことにしている",
        "word": "私の会う人はすべて, 必ず何かの点で私より勝っている。私は常にその点をその人たちから学ぶことにしている。",
        "mean":
            "내가 만나는 모든 사람은 반드시 어떤 면에서 나보다 수우하다.나는 항상 그 점을 그 사람들에게서 배우기로 하고 있따."
      },
      {
        "answer": "ことにしている",
        "word": "彼氏がいない時に告白されたらとりあえず付き合うことにしている。",
        "mean": "남자친구 없을 때 고백받으면 일단 사귀기로 했어."
      },
      {
        "answer": "ことにしている",
        "word": "僕は神は信じないことにしている。",
        "mean": "나는 신은 믿지 않기로 하고 있다."
      },
      {
        "answer": "ことにしている",
        "word": "毎日500円貯金することにしている。",
        "mean": "매일 500엔 저금하기로 하고 있다."
      },
      {
        "answer": "ことにしている",
        "word": "それ以来, 彼の言うことは信じないことにしている。",
        "mean": "그 이후 그의 말은 믿지 않기로 했다."
      },
      {
        "answer": "ことにしている",
        "word": "趣味は何ですかと聞かれたら, 映画鑑賞と言うことにしている。",
        "mean": "취미가 뭐냐고 물으면 영화감상이라고 하기로 했다."
      },
      {
        "answer": "ことにしている",
        "word": "宿題は早めに終わらせることにしている。",
        "mean": "숙제는 일찍 끝내기로 하고 있다."
      }
    ]
  },
  {
    "id": 16,
    "grammar": "ことにする",
    "means": "~하기로 하다",
    "description":
        "화자 자신의 의지나 판단에 의한 주관적인 결정에 사용하는 문법.\n\n[ことになる] 와 비슷하지만 [ことになる] 는 타인에 의한 판단이나 객관적인 결정, 자연의 흐름 등에 의해서 일이 결정될 때 사용.\n\n[こととする] 는 딱딱한 표현 ",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "ことにする",
        "word": "自分へのご褒美は来月のボーナスで買うことにする。",
        "mean": "자신에 대한 보상은 다음 달 보너스로 사기로 한다."
      },
      {
        "answer": "ことにする",
        "word": "明日に向けて風呂に入って寝ることにする。",
        "mean": "내일을 향해서 목욕을 하고 자기로 한다."
      },
      {
        "answer": "ことにした",
        "word": "気に入らないこともあるけど, せっかくだから心ゆくまで楽しむことにした。",
        "mean": "마음에 안 드는 것도 있지만 이왕이면 마음껏 즐기기로 했어."
      },
      {
        "answer": "ことにした",
        "word": "拾った子猫を飼うことにした。",
        "mean": "주운 새끼 고양이를 키우기로 했다."
      },
      {
        "answer": "こととした",
        "word": "地球温暖化防止の為, 化石燃料を使う代わりに自然エネルギーを利用することとした。",
        "mean": "지구온난화 방지를 위해 화석연료를 사용하는 대신 자연에너지를 이용하기로 했다."
      }
    ]
  },
  {
    "id": 17,
    "grammar": "ことになる",
    "means": "~하게 되다",
    "description":
        "타인에 의한 판단이나 객관적인 결정, 자연의 흐름 등에 의해서 일이 결정될 때 사용한다.\n\n[지자체, 회사, 학교] 등에 의한 결정에 자주 사용된다.\n\n[ことにする] 와 비슷하지만 ことにする 는 화자 자신의 의지나 판단에 의한 주관적인 결정에 사용한다.\n\nこととなる 는 딱딱현 표현",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {"answer": "ことになった", "word": "日突然出社することになった。", "mean": "날 갑자기 출근하게 되었다."},
      {
        "answer": "こととなりました",
        "word": "本日をもちましてサービスを終了させていただくこととなりました。",
        "mean": "오늘부로 서비스를 종료하게 되었습니다."
      },
      {
        "answer": "ことになって",
        "word": "彼女と付き合うことになって嬉しい。",
        "mean": "여자친구를 사귀게 되어 기쁘다."
      },
      {
        "answer": "ことになりました",
        "word": "厳正なる選考の結果, 今回は採用を見合わせて頂くことになりました。",
        "mean": "엄정한 전형의 결과, 이번에는 채용을 보류하게 되었습니다."
      },
      {
        "answer": "こととなった",
        "word": "癌のため余命1カ月と診断され, 自宅で療養することとなった。",
        "mean": "암으로 여명 한 달 진단을 받고 자택에서 요양하게 됐다."
      }
    ]
  },
  {
    "id": 18,
    "grammar": "ことになっている",
    "means": "~하기로 되어 있다",
    "description":
        "회사나 학교 등의 사회적인 상황에서 이미 정해져 있는 법률이나 규칙, 습관이나 관례 등에 사용된다.\n\n일상생활에서는 자기 자신이 정한 예정에도 사용할 수 있다.",
    "connectionWays": "동사 사전형 + (という)\n동사 ない형 + (という)\n명사 + (という)",
    "examples": [
      {
        "answer": "ことになっている",
        "word": "イスラム教徒が行う断食は, 日没後に普段と同じように食事をとってもいいことになっている。",
        "mean": "이슬람교도들이 하는 단식은 일몰 후 평소와 마찬가지로 식사를 해도 된다."
      },
      {
        "answer": "ことになっている",
        "word": "鳥獣保護管理法で, 野生動物には手出しをせずに見守ることになっている。",
        "mean": "조수보호관리법으로 야생동물은 손대지 않고 지켜보도록 돼 있다."
      },
      {
        "answer": "ことになっている",
        "word": "イギリスは来年3月にEUを脱退することになっている。",
        "mean": "영국은 내년 3월에 EU를 탈퇴하기로 되어 있다."
      },
      {
        "answer": "こととなっている",
        "word": "中国では, 車は右側を走行することとなっている。",
        "mean": "중국에서는 차가 오른쪽을 주행하도록 돼 있다."
      },
      {
        "answer": "ことになっている",
        "word": "明日は彼女と遊びに行くことになっている。",
        "mean": "내일은 그녀와 놀러 가기로 되어 있다."
      }
    ]
  },
  {
    "id": 19,
    "grammar": "ごとに",
    "means": "~마다",
    "description":
        "２日おきに：〇XX〇XX〇X\n２日ごとに：〇X〇X〇X〇X\n\n명사 + ごと + 동사는 [~도 함께 ~ 한다]\n동사에 접속할 때는 度に 와 같은 의미이지만 동작성 명사나 수사에는 차이점이 있다.\n\n〇　運動の度に痩せていく\n✕　運動毎に痩せていく。\n〇　１日毎に痩せていく。\n✕　一日の度に痩せていく。",
    "connectionWays": "명사 \n동사 사전형",
    "examples": [
      {
        "answer": "毎に",
        "word": "このシステムは一年毎に更新される。",
        "mean": "이 시스템은 1년마다 갱신된다."
      },
      {
        "answer": "ごとに",
        "word": "一つ失敗するごとにまた一つ成長する。",
        "mean": "하나 실패할 때마다 또 하나 성장한다."
      },
      {
        "answer": "ごとに",
        "word": "山間部の天気は一時間ごとにでも一変する。",
        "mean": "산간 지역의 날씨는 한 시간마다 확 바뀐다."
      },
      {
        "answer": "ごとに",
        "word": "グループごとに意見を発表してください。",
        "mean": "그룹별로 의견을 발표해주세요."
      },
      {"answer": "ごと", "word": "りんごを皮ごと食べる。", "mean": "사과를 껍질째 먹다."}
    ]
  },
  {
    "id": 20,
    "grammar": "~おそれがある",
    "means": "~할 우려가 있다",
    "description":
        "좋지 않은 상태나 상황이 될 가능성이 높다는 것을 나타낸다.\n\n특히 나쁜 것, 나쁜 예감이나 예상, 가능성에 대해서 사용한다.\n\n주관적이지 않고 객관적인 근거에 근거하는 경우가 많기 때문에 뉴스나 신문 등에서 사용한다.",
    "connectionWays": "명사 + の\n동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "恐れがある",
        "word": "一人で登るには様々な危険に遭遇する恐れがある。",
        "mean": "혼자 오르기에는 여러 가지 위험에 처할 수 있다."
      },
      {
        "answer": "恐れがある",
        "word": "自撮りは自由だが, 場所を選ばなければ他人の迷惑になる恐れがある。",
        "mean": "셀카는 자유롭지만 장소를 가리지 않으면 남에게 폐가 될 수 있다."
      },
      {
        "answer": "恐れがある",
        "word": "Ａ社は度重なる不祥事で倒産の恐れがある。",
        "mean": "A사는 거듭되는 불상사로 도산의 우려가 있다."
      },
      {
        "answer": "恐れがある",
        "word": "市場の競争力を削ぐ恐れがある。",
        "mean": "시장의 경쟁력을 깎을 우려가 있다."
      },
      {
        "answer": "恐れがある",
        "word": "人種差別が横行すれば戦争になる恐れがある。",
        "mean": "인종차별이 횡행하면 전쟁이 될 수 있다."
      },
      {
        "answer": "恐れがある",
        "word": "線路内に立ち入るのは重大な事故を招く恐れがある。",
        "mean": "선로 내에 출입하는 것은 중대한 사고를 초래할 우려가 있다."
      },
      {
        "answer": "恐れがあります",
        "word": "髪が濡れたままだと頭皮に菌が繁殖し, 頭皮の炎症をまねく恐れがあります。",
        "mean": "머리가 젖은 채로 있으면 두피에 균이 번식하여 두피 염증을 초래할 수 있습니다."
      },
      {
        "answer": "恐れがあります",
        "word": "長時間睡眠は逆にやる気や免疫力集中力を低下させてしまう恐れがあります。",
        "mean": "장시간 수면은 반대로 의욕이나 면역력 집중력을 저하시켜 버릴 우려가 있습니다."
      },
      {
        "answer": "恐れがあります",
        "word": "県内は明日の朝にかけて大雨になる恐れがあります。",
        "mean": "현내는 내일 아침에 걸쳐 폭우가 내릴 우려가 있습니다."
      },
      {
        "answer": "恐れがあります",
        "word": "駆け込み乗車は重大事故を招く恐れがありますので絶対におやめ下さい。",
        "mean": "진입 승차는 중대 사고를 초래할 우려가 있으므로 절대로 하지 마십시오."
      },
      {
        "answer": "恐れがあります",
        "word": "白髪が増えると老けて見えるので恋愛にも影響が出る恐れがあります。",
        "mean": "흰머리가 늘어나면 늙어 보이기 때문에 연애에도 영향을 미칠 수 있습니다."
      },
      {
        "answer": "恐れがあります",
        "word": "インスタント食品やレトルト食品を多用した食生活をしていると必要な栄養素が不足する恐れがあります。",
        "mean": "인스턴트 식품이나 인스턴트 식품을 많이 사용한 식생활을 하다 보면 필요한 영양소가 부족해질 수 있습니다."
      },
      {
        "answer": "恐れがある",
        "word": "濃厚接触の恐れがあるから検査を受けた。",
        "mean": "밀접 접촉의 우려가 있어서 검사를 받았다."
      },
      {
        "answer": "恐れがある",
        "word": "格安すぎる業者は詐欺の恐れがあるため, ご注意ください。",
        "mean": "너무 저렴한 업체는 사기의 우려가 있으니 주의하세요."
      },
      {
        "answer": "恐れがある",
        "word": "人間は気道と食道が交わっているので, 食べ物がのどに詰まると窒息死の恐れがある。",
        "mean": "인간은 기도와 식도가 섞여 있어 음식물이 목구멍에 막히면 질식사의 위험이 있다."
      },
      {
        "answer": "恐れがある",
        "word": "この生き物は絶滅の恐れがあるため, 条約で国際取引が禁止されている。",
        "mean": "이 생물은 멸종 위험이 있기 때문에 조약으로 국제 거래가 금지되어 있다."
      }
    ]
  },
  {
    "id": 21,
    "grammar": "し",
    "means": "~고, ~고 하니까",
    "description": "1. 이유\n2. 나열",
    "connectionWays": "동사 기본형\nい형용사 보통형\nな형용사 보통형\n명사 + だ",
    "examples": [
      {
        "answer": "し",
        "word": "トムさんは, 面白いし, 親切だし, サッカーも上手です。",
        "mean": "톰씨는 재미있고 친절하며 축구도 잘해요."
      },
      {
        "answer": "し",
        "word": "田中先生は優しいし, かっこいいし, それに教え方も上手です。",
        "mean": "다나카 선생님은 상냥하고, 멋있고, 게다가 가르치는 방법도 잘합니다."
      },
      {
        "answer": "し",
        "word": "ジョンさんはスポーツもできるし, 頭もいいし, それに女の子からの人気が高いです。",
        "mean": "존 씨는 스포츠도 할 수 있고, 머리도 좋고, 게다가 여자들로부터 인기가 많습니다."
      },
      {
        "answer": "し",
        "word": "大阪は美味しい食べ物がたくさんあるし, 観光地がたくさんあるし, それに人が面白いです。",
        "mean": "오사카(大阪)는 맛있는 음식이 많고, 관광지가 많고, 게다가 사람들이 재미있어요."
      },
      {
        "answer": "し",
        "word": "スマホがあれば, メールはできるし, 電話はできるし, それにゲームもできます。",
        "mean": "스마트폰이 있으면 문자는 할 수 있고 전화는 할 수 있고 게임도 할 수 있습니다."
      },
      {
        "answer": "し",
        "word": "漢字は多いし, 文法は難しいし, 私は日本語の勉強があまり好きではありません。",
        "mean": "한자는 많고 문법은 어렵고 저는 일본어 공부를 별로 좋아하지 않습니다."
      },
      {
        "answer": "し",
        "word": "日本は綺麗だし, 食べ物が美味しいし, 好きです。",
        "mean": "일본은 예쁘고 음식이 맛있고 좋아합니다."
      },
      {
        "answer": "し",
        "word": "このレストランは　安いし　量も多いし, よく来ます。",
        "mean": "이 레스토랑은 싸고 양도 많고 자주 옵니다."
      },
      {
        "answer": "し",
        "word": "NARUTOも読み終わったし, ドラゴンボールも読み終わったし, 何かおすすめの漫画を教えてください。",
        "mean": "NARUTO도 다 읽었고 드래곤볼도 다 읽었는데 추천해주실만한 만화를 알려주세요."
      },
      {
        "answer": "し",
        "word": "頭も痛いし, 熱もあるし, 今夜のパーティーには行けません。",
        "mean": "머리도 아프고 열도 나고 오늘 밤 파티에는 갈 수 없어요."
      },
      {
        "answer": "し",
        "word": "今日は朝寝坊するし, 電車は事故で遅れるし, 雨も降るし, 最悪な１日だった。",
        "mean": "오늘은 늦잠을 자고 기차는 사고로 늦어지고 비도 오고 최악의 하루였다."
      },
      {
        "answer": "し",
        "word": "日本の電車は時間通りに来るし, たくさんあるし, とても便利です。",
        "mean": "일본의 전철은 제시간에 오고, 많이 있고, 매우 편리합니다."
      }
    ]
  },
  {
    "id": 22,
    "grammar": "すぎる",
    "means": "너무~하다",
    "description": "동작이나 상태가 보통의 정도 또는 수준을 넘었다",
    "connectionWays": "동사 ます형\nい형용사 보통형\nな형용사 어간\n명사 + (が)\n",
    "examples": [
      {
        "answer": "すぎて",
        "word": "夜景が美しすぎて見とれてしまった。",
        "mean": "야경이 너무 아름다워서 넋을 잃고 말았다."
      },
      {
        "answer": "過ぎる",
        "word": "もう若くないからか, 食べ過ぎるとすぐ胃もたれする。",
        "mean": "젊지 않아서 그런지 너무 많이 먹으면 체한다."
      },
      {
        "answer": "すぎて",
        "word": "毛虫の見た目が気持ち悪すぎて見るだけで鳥肌が立つ。",
        "mean": "애벌레의 생김새가 너무 징그러워서 보기만 해도 소름이 돋는다."
      },
      {"answer": "すぎて", "word": "あの子可愛すぎてつい見ちゃう。", "mean": "쟤 너무 귀여워서 그만 봐."},
      {
        "answer": "すぎる",
        "word": "あの子の天使すぎる笑顔にいつも癒やされている。",
        "mean": "걔의 너무 천사같은 미소에 항상 위로받고 있어."
      },
      {
        "answer": "過ぎる",
        "word": "彼の謎過ぎる行動には頭を抱えるしかない。",
        "mean": "그의 너무 수수께끼 같은 행동에는 골머리를 앓을 수밖에 없다."
      },
      {
        "answer": "すぎる",
        "word": "先輩はいつも優しくて良い人すぎる。",
        "mean": "선배는 항상 착하고 좋은 사람이야."
      },
      {
        "answer": "すぎて",
        "word": "筋肉痛が痛すぎて階段を下りるのすらできない。",
        "mean": "근육통이 너무 아파서 계단을 내려갈 수조차 없어."
      },
      {"answer": "すぎる", "word": "今の会社は残業が多すぎる。", "mean": "지금 회사는 야근이 너무 많아."},
      {
        "answer": "すぎて",
        "word": "しんしんと降っている雪が好きすぎて, いつも写真で撮ってしまう。",
        "mean": "푹푹 내리는 눈이 너무 좋아서 항상 사진으로 찍어버린다."
      }
    ]
  },
  {
    "id": 23,
    "grammar": "ず(に)",
    "means": "~하지 않고",
    "description":
        "ない 보다 약간 딱딱한 표현\n\n뒤에는 다른 동작을 나타내는 동사 등이 접속되어 [~하지 않은 상태로 ~하다] 가 된다.\n\nないで와 같으며, する는　せずに가 된다.",
    "connectionWays": "동사 ない형 + ず(に)",
    "examples": [
      {"answer": "せずに", "word": "挨拶もせずにごめんなさい！", "mean": "인사도 하지않고, 미안해요!"},
      {"answer": "ずに", "word": "いつでも笑顔を絶やさずに。", "mean": "언제든지 웃음을 끊이지 않고"},
      {
        "answer": "ずに",
        "word": "ご無理なさらずに体調気をつけてください。",
        "mean": "무리하지 마시고 아프지 마세요."
      },
      {
        "answer": "せずに",
        "word": "大体何も苦労せずにクリアできるゲームとか面白くない。",
        "mean": "대개 아무것도 고생하지 않고 클리어할 수 있는 게임이라든가 재미없다."
      }
    ]
  },
  {
    "id": 24,
    "grammar": "そうだ ",
    "means": "1. (전문) ~ 라고 한다 \n2. (양태) ~ 일 것 같다.",
    "description":
        "1. (전문)\n자신이 직접 얻은 정보가 아니라 다른 사람에게 들은 것을 나타낸다.\n앞 내용에 [によると / によれば] 등 정보의 근원을 나타내는 내용과 자주 호흥함\n\n2. (양태)\n화자가 보거나 들은 것으로부터 추측되는 주관적인 판단(가능성) 을 나타낸다\n[美しい, 可愛い, カッコいい, 赤い] 등 언뜻 알 수 있는 단어는 접속 할 수 없다.",
    "connectionWays":
        "1. (전문) \n명사 + だそう / だったそう\nい형용사 보통형 + だそう\nな형용사 어간 + なそうだ / だそうだ\n동사 사전형 + だそう\n\n2. (양태)\nい형용사 어간 + そうだ\nな형용사 어간 + そうだ\n동사 ます형 + だそう",
    "examples": [
      {
        "answer": "そうだ ",
        "word": "天気予報によると, 明日は雨だそうだ。",
        "mean": "일기예보에 따르면 내일은 비가 온다고 한다."
      },
      {
        "answer": "そうだ ",
        "word": "このお店, 持ち帰りは自由だそうだ",
        "mean": "이 가게, 테이크 아웃은 자유롭다고 한다"
      },
      {
        "answer": "そうだ ",
        "word": "お隣さん, 子どもがもうすぐ生まれるそうだ。",
        "mean": "옆집 아이가 곧 태어난대."
      },
      {
        "answer": "そうだ ",
        "word": "医者によると, とても難しい手術だったそうだ。",
        "mean": "의사에 따르면 매우 어려운 수술이었다고 한다."
      },
      {
        "answer": "そうだ ",
        "word": "Ａくん昨日事故に遭ったそうだ。だから今日休んでいるみたい。",
        "mean": "A군 어제 사고를 당했다고 한다.그래서 오늘 쉬는 것 같아."
      },
      {
        "answer": "そうだ ",
        "word": "今回の試験の合格率は１５％だったそうだ。",
        "mean": "이번 시험 합격률은 15%였다고 한다."
      },
      {
        "answer": "そうだ ",
        "word": "隣町は大雨だったそうだが, こっちは快晴だった。",
        "mean": "이웃 마을은 비가 많이 왔다고 하는데, 이쪽은 쾌청했다."
      },
      {
        "answer": "そうだ ",
        "word": "そこの洋食屋さん, ネットで人気で美味しいそうだ。",
        "mean": "거기 양식당 인터넷에서 인기가 많아서 맛있대."
      },
      {"answer": "そうに", "word": "不思議そうに首を傾げた。", "mean": "신기한 듯 고개를 갸우뚱했다."},
      {
        "answer": "よさそうだ",
        "word": "猫ちゃん頭を撫でられて気持ちよさそうだ。",
        "mean": "고양이 머리 쓰다듬을 수 있어서 기분 좋아 보인다."
      },
      {
        "answer": "そうな",
        "word": "ストレスが溜まっていそうな顔をしている。",
        "mean": "스트레스가 쌓여서 그런 표정을 짓고 있다."
      },
      {
        "answer": "無さそうに",
        "word": "自信無さそうに[ 私はできない ]と言った。",
        "mean": "자신 없는 듯 나는 할 수 없다고 말했다."
      },
      {"answer": "そうになった", "word": "涙が出そうになった。", "mean": "눈물 날 뻔 했어."},
      {
        "answer": "そうで",
        "word": "去勢手術をしたばかりだけど, 大丈夫そうで安心した。",
        "mean": "거세 수술을 한 지 얼마 안 됐지만 괜찮을 것 같아 안심이다."
      },
      {"answer": "そうに", "word": "金魚が元気そうに泳いでいる。", "mean": "금붕어가 건강하게 헤엄치고 있다."},
      {
        "answer": "美味しそう",
        "word": "隣の人の食べてるもの, めちゃくちゃ美味しそう。",
        "mean": "옆 사람 먹는 거 너무 맛있겠다."
      }
    ]
  },
  {
    "id": 26,
    "grammar": "たがる",
    "means": "~하고 싶어하다",
    "description": "たがる: 제3자가 ~하고 싶다 를 표현\n\nがる: 제3자가 ~하고 싶다고 생각하고 있는 것을 표혐",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "たがっていますが",
        "word": "息子はアニメを見たがっていますが, 宿題が終わっていないので, 見させません。",
        "mean": "아들은 애니메이션을 보고 싶어하지만 숙제가 끝나지 않아서 못 보게 해요."
      },
      {
        "answer": "たがる",
        "word": "子供というのは, なんでも知りたがるものだ。",
        "mean": "아이란 무엇이든 알고 싶어하는 법이다."
      },
      {
        "answer": "たがらないんですが",
        "word": "娘が全然学校に行きたがらないんですが, 学校で何かあったのでしょうか。",
        "mean": "딸이 전혀 학교에 가고 싶어하지 않는데, 학교에서 무슨 일이 있었던 것일까요."
      },
      {
        "answer": "たがっていますが",
        "word": "夫は仕事を辞めたがっていますが, 転職先が見つからず, なかなか辞めることができません。",
        "mean": "남편은 일을 그만두고 싶어하지만 이직할 곳을 찾지 못해 좀처럼 그만둘 수 없습니다."
      },
      {
        "answer": "たがっています。",
        "word": "ワンピースの最終話がどうなるのか, 多くの人が知りたがっています。",
        "mean": "원피스의 마지막 이야기가 어떻게 될지 많은 사람들이 궁금해하고 있어요."
      },
      {
        "answer": "たがっているのに",
        "word": "みんな早く帰りたがっているのに, 部長の話が長くてなかなか帰れません。",
        "mean": "다들 일찍 돌아가고 싶어하는데 부장님 말씀이 길어서 좀처럼 돌아갈 수가 없어요."
      },
      {
        "answer": "たがっています",
        "word": "休日なので, 私は家でゆっくり休みたいのに, 妻は出かけたがっています。",
        "mean": "휴일이라 저는 집에서 푹 쉬고 싶은데 아내는 나가고 싶어해요."
      },
      {
        "answer": "たがっていますが",
        "word": "夏休みなので妻と息子はどこかへ行きたがっていますが, 私は家でゆっくりしたいんです。",
        "mean": "여름방학이라 아내와 아들은 어디론가 가고 싶어하지만 저는 집에서 푹 쉬고 싶어요."
      },
      {
        "answer": "たがっています",
        "word": "いつも祖母は孫に会いたがっています。",
        "mean": "항상 할머니는 손자를 만나고 싶어하십니다."
      },
      {
        "answer": "たがっています",
        "word": "田中さんは新しいiPhoneを買いたがっています。",
        "mean": "다나카씨는 새 iPhone을 사고 싶어합니다."
      },
      {
        "answer": "たがっています",
        "word": "彼女が僕の卒業アルバムを見たがっています。",
        "mean": "그녀가 제 졸업앨범을 보고 싶어해요."
      },
      {
        "answer": "がり",
        "word": "彼は恥ずかしがり屋なので, 交流会に行ってもあまり話したがりません。",
        "mean": "그는 부끄러움을 많이 타서 교류회에 가도 별로 이야기하고 싶어하지 않아요."
      },
      {
        "answer": "たがるんだろう",
        "word": "猫はどうして狭いところに入りたがるんだろう。",
        "mean": "고양이는 왜 좁은 곳에 들어가고 싶어할까?"
      },
      {
        "answer": "たがらない",
        "word": "注射が怖いから, 息子が病院へ行きたがらない。",
        "mean": "주사가 무섭기 때문에 아들이 병원에 가고 싶어하지 않는다."
      }
    ]
  },
  {
    "id": 27,
    "grammar": "~たって, ~だって",
    "means": "~해도",
    "description": "たって: ても의 회화체\nだって: でも의 회화체",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "たって",
        "word": "子どもにお小遣いをあげたって, すぐに無駄遣いしてしまう。",
        "mean": "아이에게 용돈을 줘도 금방 낭비해 버린다."
      },
      {
        "answer": "だって",
        "word": "彼は何度呼んだって, 返事さえしてくれない。",
        "mean": "그는 몇 번을 불러도 대답조차 안 해준다."
      },
      {
        "answer": "たって",
        "word": "高い車を買ったって, 忙しくて乗る時間がないんだから意味がない。",
        "mean": "비싼 차를 산다고 바빠서 탈 시간이 없으니 의미가 없어."
      },
      {
        "answer": "たって",
        "word": "今年試験を受けたって受からないよ。来年受けよう。",
        "mean": "올해 시험을 본다고 붙지 않아.내년에 보자."
      },
      {
        "answer": "たって",
        "word": "いくらそれが汚くたって, その人にとっては宝物かもしれないよ。",
        "mean": "아무리 그게 더러워도 그 사람한테는 보물일 수도 있어."
      },
      {
        "answer": "だって",
        "word": "どんなにお金持ちだって, 幸せじゃない人もいる。",
        "mean": "아무리 부자라도 행복하지 않은 사람도 있다."
      },
      {
        "answer": "だって",
        "word": "この電話は, 海外だって使えるんです。",
        "mean": "이 전화는 해외에서도 사용할 수 있어요."
      },
      {
        "answer": "だって",
        "word": "どんなに悲しんだって, 死んだ人は戻らないんだ。前に進むしかないよ。",
        "mean": "아무리 슬퍼해도 죽은 사람은 돌아오지 않는 거야.앞으로 나아갈 수밖에 없지."
      },
      {
        "answer": "たって",
        "word": "古本屋に本を売りに行ったって, 少ないお金しかもらえないだろう。",
        "mean": "헌책방에 책을 팔러 가도 적은 돈밖에 못 받을 거야."
      },
      {
        "answer": "たって",
        "word": "今日お店に行ったって, 開いてないと思うよ。日曜日だから。",
        "mean": "오늘 가게에 가도 안 열었을 거야.일요일이니까."
      },
      {
        "answer": "たって",
        "word": "あなたが私を好きじゃなくたっていい。私はあなたが好きだ。",
        "mean": "네가 나를 좋아하지 않아도 돼.나는 당신이 좋아."
      },
      {
        "answer": "たって",
        "word": "この茶碗はプラスチックだから, 下に落としたって大丈夫。",
        "mean": "이 찻잔은 플라스틱이니까 밑으로 떨어뜨려도 괜찮아."
      },
      {
        "answer": "たって",
        "word": "テストで失敗したって, また次のテストを頑張ればいい。",
        "mean": "시험에서 실패했다고 다음 시험을 열심히 하면 돼."
      }
    ]
  },
  {
    "id": 28,
    "grammar": "たとえ~ても",
    "means": "가령~해도, 설사~해도, 설령~해도",
    "description": "앞 내용에 어떤 상황이 성립해도, 그것이 뒷 내용에 영향을 미치지 않는다.",
    "connectionWays": "て형 접속",
    "examples": [
      {
        "answer": "ても",
        "word": "たとえ忙しくても, 毎日恋人に連絡するようにしている。",
        "mean": "비록 바쁘더라도 매일 연인에게 연락하도록 하고 있다."
      },
      {
        "answer": "ても",
        "word": "たとえ冗談であったとしても, 相手の傷つくことを言ってはいけない。",
        "mean": "비록 농담일지라도 상대방의 상처받는 말을 해서는 안 된다."
      },
      {
        "answer": "ても",
        "word": "たとえ手術をしたとしても, 助かる見込みはなかったでしょう。",
        "mean": "설사 수술을 했다 하더라도 살아날 가망은 없었을 것입니다."
      },
      {
        "answer": "ても",
        "word": "たとえ受かる見込みがなくても, チャレンジすることは大切だ。",
        "mean": "설령 합격할 가망이 없더라도 도전하는 것은 중요하다."
      },
      {
        "answer": "ても",
        "word": "たとえ親に反対されても, 私たちは結婚するつもりだ。",
        "mean": "설령 부모에게 반대하더라도 우리는 결혼할 것이다."
      },
      {
        "answer": "ても",
        "word": "たとえ余命１年だと言われても, 僕は最後まで諦めず, 病気と戦うつもりだ。",
        "mean": "비록 여생 1년이라고 해도 나는 끝까지 포기하지 않고 병과 싸울 것이다."
      },
      {
        "answer": "ても",
        "word": "たとえ生活が苦しくても, 僕たちは幸せに暮らしています。",
        "mean": "비록 생활이 힘들어도 우리는 행복하게 살고 있습니다."
      },
      {
        "answer": "ても",
        "word": "たとえ彼のしたことが事実であったとしても, 私が彼を嫌いになることはない。",
        "mean": "설사 그가 한 일이 사실이라 하더라도 내가 그를 싫어하진 않을 것이다."
      },
      {
        "answer": "ても",
        "word": "たとえ５分だけであったとしても, 彼と電話ができて嬉しいです。",
        "mean": "비록 5분뿐이더라도 그와 통화할 수 있어서 기쁩니다."
      },
      {
        "answer": "ても",
        "word": "たとえ誰に頼まれても, 絶対にその仕事は引き受けません。",
        "mean": "설사 누구의 부탁을 받더라도 절대 그 일은 맡지 않을 거예요."
      }
    ]
  },
  {
    "id": 29,
    "grammar": "~たばかり",
    "means": "~한지 얼마 안 된다, 막 ~ 함",
    "description":
        "동작 직후임을 나타내는 문법\n\n화자가 아직 시간이 별로 지나지 않았다고 느끼고 있으면, 가령 1년이든 10년이든 [たばかり]이라고 말할 수 있다.",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "ばかりで",
        "word": "今来たばかりで状況が分からない。",
        "mean": "지금 막 와서 상황을 모르겠어."
      },
      {
        "answer": "ばかりです",
        "word": "２年前に大学を卒業したばかりです。",
        "mean": "2년 전에 대학을 막 졸업했어요."
      },
      {
        "answer": "ばかりの",
        "word": "これは買ったばかりの携帯です。",
        "mean": "이것은 산 지 얼마 안 된 핸드폰입니다."
      },
      {
        "answer": "ばかりなの",
        "word": "髪を染めたばかりなのでみんなに見せたい。",
        "mean": "염색한지 얼마 안되서 모두에게 보여주고 싶다."
      },
      {
        "answer": "たばかりで",
        "word": "新しい仕事を始めたばかりでまだ慣れていない。",
        "mean": "새로운 일을 시작한지 얼마 안되서 아직 익숙하지 않아."
      },
      {
        "answer": "たばかりなので",
        "word": "家を建てたばかりなのでローン返済のためにも仕事は辞められない。",
        "mean": "집을 지은 지 얼마 되지 않아 대출 상환을 위해서라도 일은 그만둘 수 없다."
      },
      {
        "answer": "たばかりなのに",
        "word": "さっき家を出たばかりなのに, もう家が恋しい。",
        "mean": "아까 집 나간 지 얼마 안 됐는데 벌써 집이 그리워."
      },
      {
        "answer": "たばかりの",
        "word": "日本に来たばかりの頃は, 日本語は全然できませんでした。",
        "mean": "일본에 온 지 얼마 되지 않았을 때는 일본어를 전혀 할 수 없었습니다."
      }
    ]
  },
  {
    "id": 30,
    "grammar": "たびに",
    "means": "~할 때마다",
    "description":
        "동작성 명사나 동사형에 접속하면 [~때마다', '매번 ~하다' ]라는 뜻이 된다\n\n특히 매번 동작의 반복을 강조해서 말하는 문법.",
    "connectionWays": "명사＋の\n동사 사전형",
    "examples": [
      {
        "answer": "度に",
        "word": "彼女は会う度に綺麗になっていく。",
        "mean": "그녀는 만날 때마다 예뻐져 간다."
      },
      {
        "answer": "たびに",
        "word": "一つ失敗するたびにまた一つ成長する。",
        "mean": "하나 실패할 때마다 또 하나 성장한다."
      },
      {
        "answer": "の度に",
        "word": "地震の度に津波が来るかどうか心配になる。",
        "mean": "지진 때마다 쓰나미가 올까봐 걱정된다."
      },
      {
        "answer": "たびに",
        "word": "彼の顔を見るたびに吐き気がしてくる。",
        "mean": "그의 얼굴을 볼 때마다 구역질이 난다."
      },
      {
        "answer": "度に",
        "word": "コンビニに寄る度にスイーツを買っちゃう。",
        "mean": "편의점 들릴 때마다 디저트를 사버려."
      },
      {
        "answer": "たびに",
        "word": "実家に帰省するたびに, 飼い猫たちが出迎えてくれる。",
        "mean": "친정에 갈 때마다 집고양이들이 마중을 나온다."
      },
      {
        "answer": "度に",
        "word": "デートの度に必ず雨が降っている気がする。",
        "mean": "데이트 때마다 꼭 비가 오는 것 같아."
      },
      {
        "answer": "たびに",
        "word": "自分の欠点を知るたびにまた強くなれる。",
        "mean": "자신의 결점을 알 때마다 다시 강해진다."
      }
    ]
  },
  {
    "id": 31,
    "grammar": "~たまま, ~ないまま",
    "means": "~한 채",
    "description": "사물에 아무것도 손대지 않은 상태를 나타낸다.",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "まま",
        "word": "本物と同じような見たままを描く絵なら, 写真でも良いでしょう。",
        "mean": "진짜와 같은 모습을 그리는 그림이라면 사진이라도 좋을 것입니다."
      },
      {
        "answer": "まま",
        "word": "音楽の知識は全くないので, 感じたままの感想を言ってもいいですか。",
        "mean": "음악에 대한 지식은 전혀 없기 때문에, 느낀 그대로의 감상을 말해도 될까요?"
      },
      {"answer": "まま", "word": "自分の感じたままに進めばいい。", "mean": "자기 느낌대로 진행하면 돼."},
      {
        "answer": "まま",
        "word": "犯行の瞬間, 見たままを話してください。",
        "mean": "범행 순간 본 그대로를 말해주세요."
      }
    ]
  },
  {
    "id": 32,
    "grammar": "~ために",
    "means": "1. ~을 위해서\n2. ~때문에",
    "description":
        "목적, 보답, 원인·이유의 세 가지 용법이 있다.\n\n원인 / 이유의 용법일 때, 대부분의 경우 뒷 내용 에서는 좋지 않은 결과가 기술된다.\n\n[ために] 의 [に] 는 목적, 은혜를 갚음을 나타날 때는 생략 가능하다.\n\n원인 / 이유를 나타낼 때는 [に] 를 붙이지 않고 [ために] 단독으로 이용되는 경우가 대부분이다.\n\n인물이나 집단을 나타내는 단어에 접속하면 그 사람에게 보답하는 것을 나타낸다",
    "connectionWays": "명사(ため) 접속 형태 따름",
    "examples": [
      {"answer": "ために", "word": "明日の試験のために早く寝る。", "mean": "내일 시험 때문에 일찍 잔다."},
      {
        "answer": "ために",
        "word": "風邪を引かないために体を暖かくする。",
        "mean": "감기에 걸리지 않기 위해 몸을 따뜻하게 하다."
      },
      {"answer": "ために", "word": "未来のために今頑張る。", "mean": "미래를 위해 지금 열심히 하겠다."},
      {
        "answer": "ために",
        "word": "自分の生活のために働いているのであって, 決して会社のためではない。",
        "mean": "자신의 생활을 위해 일하는 것이지 결코 회사를 위해서가 아니다."
      },
      {
        "answer": "ため",
        "word": "他人に好かれるため, 自分を偽りたくはない。",
        "mean": "남들이 좋아하기 때문에 자신을 속이고 싶지는 않다."
      },
      {
        "answer": "ため",
        "word": "運動不足のため, ジムに通い始めた。",
        "mean": "운동 부족 때문에 헬스장에 다니기 시작했다."
      },
      {"answer": "ため", "word": "大雨のため, 試合は中止された。", "mean": "폭우로 인해 경기는 중지되었다."},
      {
        "answer": "ため",
        "word": "具合が悪いため, 今日は休ませていただきます。",
        "mean": "아파서 오늘은 쉬겠습니다."
      },
      {
        "answer": "ため",
        "word": "電車が遅れたため遅刻してしまいました。",
        "mean": "전철이 늦어지는 바람에 지각하고 말았어요."
      },
      {
        "answer": "ため",
        "word": "道が混んでいるため, 少々遅れるかもしれません。",
        "mean": "길이 막혀서 조금 늦을 수도 있어요."
      },
      {"answer": "ために", "word": "彼女のためにプレゼントを買った。", "mean": "그녀를 위해 선물을 샀다."},
      {"answer": "ために", "word": "会社のために頑張る。", "mean": "회사를 위해 힘쓰다."}
    ]
  },
  {
    "id": 34,
    "grammar": "~だらけ",
    "means": "~투성이",
    "description":
        "더럽거나 불쾌하다고 느끼는 것이 많이 있음을 나타내는 문법.\n\n화자의 부정적인 인상을 나타낸다.\n\n[ゴミ (쓰레기), ほこり (먼지), 借金 (빚), 血(피), ミス(실수), 間違(실수), 傷(상처), 泥(진흙), しわ(주름)] 등에 자주 연결한다.",
    "connectionWays": "名詞＋だらけ",
    "examples": [
      {
        "answer": "だらけだ",
        "word": "この部屋は掃除していないのか, ゴミだらけだ。",
        "mean": "이 방은 청소하지 않았는지 쓰레기 투성이다."
      },
      {
        "answer": "だらけだった",
        "word": "新築なのに工事の後そのままなのでほこりだらけだった。",
        "mean": "신축인데 공사 후 그대로여서 먼지 투성이였다."
      },
      {
        "answer": "だらけで",
        "word": "今の日本の財政状況を見ると借金だらけで, 税収で支え切れていない。",
        "mean": "지금의 일본의 재정 상황을 보면 빚 투성이이고, 세수로 지탱할 수 없다."
      },
      {
        "answer": "血だらけ",
        "word": "口の中を切って血だらけになった。",
        "mean": "입안을 베고 피투성이가 되었다."
      },
      {
        "answer": "だらけで",
        "word": "この答案用紙は間違いだらけであまりにもひどすぎる。",
        "mean": "이 답안지는 오류투성이여서 너무 심하다."
      },
      {"answer": "だらけで", "word": "子供が傷だらけで帰ってきた。", "mean": "아이가 상처투성이로 돌아왔다."},
      {
        "answer": "だらけ",
        "word": "農道を車で走ると泥だらけになる。",
        "mean": "농로를 차로 달리면 진흙투성이가 된다."
      },
      {
        "answer": "だらけ",
        "word": "このしわだらけの手がずっと頑張って働いてきた証拠だ。",
        "mean": "이 주름진 손이 줄곧 열심히 일해왔다는 증거다."
      }
    ]
  },
  {
    "id": 36,
    "grammar": "~ついでに",
    "means": "~하는 김에",
    "description":
        "어떤 기회를 이용해서 다른 일을 하는 것을 나타낸다.\n\n앞 내용이 주요 동작이고, 뒷 내용의 중요성은 앞 문장보다 낮다.\n\n[ついでに] 는 접속사로도 사용할 수 있다.",
    "connectionWays": "동사 사전형\n동사 과거형\n명사 (+ の)",
    "examples": [
      {
        "answer": "ついでに",
        "word": "掃除のついでに家具を並び替えた。",
        "mean": "청소하는 김에 가구를 정렬했다."
      },
      {
        "answer": "ついでに",
        "word": "出張ついでにご当地Ｂ級グルメを食べてきた。",
        "mean": "출장 온 김에 현지 B급 맛집 먹고 왔어."
      },
      {
        "answer": "ついでに",
        "word": "買い物のついでにガソリン入れてきた。",
        "mean": "쇼핑하는 김에 기름 넣고 왔어."
      },
      {
        "answer": "ついで",
        "word": "働きたくないので大学に行きました。勉強はついでです。",
        "mean": "일하기 싫어서 대학에 갔어요.공부는 하는 김입니다."
      },
      {
        "answer": "ついでに",
        "word": "コンビニに弁当買いにいってついでに雑誌も買ってきた。",
        "mean": "편의점에 도시락 사러 간 김에 잡지도 사왔어."
      }
    ]
  },
  {
    "id": 38,
    "grammar": "~つもりだ",
    "means": "~할 생각이다, ~할 계획이다, ~할 예정이다",
    "description": "의지를 표한다.\n\n미래에 하는 일에 대해서 사용하기 때문에 예정을 나타내기도한다.",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "つもりだ",
        "word": "来年Ａ大学に進学するつもりだ。",
        "mean": "내년에 A대학에 진학할 것이다."
      },
      {"answer": "つもりです", "word": "子供は３人作るつもりです。", "mean": "아이는 3명 만들 생각입니다."},
      {
        "answer": "つもりだ",
        "word": "私はあと５０年生きるつもりだ。",
        "mean": "나는 앞으로 50년 더 살 거야."
      },
      {
        "answer": "つもり",
        "word": "自分の意見を変えるつもりはない。",
        "mean": "자신의 의견을 바꿀 생각은 없다."
      },
      {"answer": "つもりだ", "word": "犬を飼うつもりだ。", "mean": "개를 키울 생각이다."},
      {"answer": "つもりだ", "word": "今日は徹夜で寝ないつもりだ。", "mean": "오늘은 밤새 안 잘 거야."},
      {
        "answer": "つもりだ",
        "word": "彼は明日も来ないつもりだろうか。",
        "mean": "그는 내일도 오지 않을 것인가?"
      },
      {"answer": "つもりだ", "word": "来月整形するつもりだ。", "mean": "다음달에 성형할 생각이야."},
      {"answer": "つもり", "word": "君に負けるつもりはない。", "mean": "너한테 질 생각 없어."},
      {
        "answer": "つもり",
        "word": "これ以上ここに留まっているつもりはない。",
        "mean": "더 이상 여기에 머물러 있을 생각은 없다."
      }
    ]
  },
  {
    "id": 39,
    "grammar": "타동사 + てある (상태)\n자동사 + ている (상태)",
    "means": "~되어 있다 (상태)",
    "description":
        "동작의 지속, 습관적인 동작, 상태의 지속을 나타낸다.\n\n[~ておる , ております] 는 [~ている / ています] 의 겸양어",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "走っている",
        "word": "公園で子供たちが走っている。",
        "mean": "공원에서 아이들이 달리고 있다."
      },
      {
        "answer": "降っている",
        "word": "朝からずっと雨が降っている。",
        "mean": "아침부터 계속 비가 오고 있어."
      },
      {
        "answer": "付けている",
        "word": "彼が身に付けている腕時計はとても高そうだ。",
        "mean": "그가 차고 있는 손목시계는 매우 비쌀 것 같다."
      },
      {
        "answer": "閉まっている",
        "word": "10時過ぎたからスーパーはもう閉まっている。",
        "mean": "10시가 넘었기 때문에 슈퍼는 이미 문을 닫았다."
      },
      {
        "answer": "している",
        "word": "週４回趣味でジョギングしている。",
        "mean": "주 4회 취미로 조깅하고 있다."
      },
      {
        "answer": "死んでいる",
        "word": "この交差点は毎年多くの人が交通事故で死んでいる。",
        "mean": "이 교차로는 매년 많은 사람들이 교통사고로 죽고 있다."
      },
      {
        "answer": "ている",
        "word": "数年前に一度訪れているので, この辺りには少し詳しい。",
        "mean": "몇 년 전에 한 번 방문했기 때문에 이 근처는 조금 알고 있다."
      },
      {"answer": "ている", "word": "東には高い山がそびえている。", "mean": "동쪽에는 높은 산이 솟아 있다."},
      {"answer": "ている", "word": "あの２人はとても似ている。", "mean": "저 둘은 너무 닮았다."},
      {
        "answer": "ている",
        "word": "今勉強しているので話しかけないでください。",
        "mean": "지금 공부하고 있으니 말 걸지 마세요."
      },
      {"answer": "していますか", "word": "今何をしていますか？", "mean": "지금 뭐하고 있어요?"},
      {
        "answer": "吸っています。",
        "word": "屋上でたばこを吸っています。",
        "mean": "옥상에서 담배를 피우고 있습니다."
      },
      {
        "answer": "歌っております。",
        "word": "一人で歌を歌っております。",
        "mean": "혼자 노래를 부르고 있습니다."
      },
      {"answer": "着ています。", "word": "彼女は着物を着ています。", "mean": "그녀는 기모노를 입고 있습니다."},
      {"answer": "開いています。", "word": "窓は開いています。", "mean": "창문은 열려 있습니다."},
      {
        "answer": "しています。",
        "word": "休みの時はよくうちでインターネットをしています。",
        "mean": "방학때는 자주 집에서 인터넷을 합니다."
      },
      {
        "answer": "しています。",
        "word": "毎朝近くの公園でジョギングしています。",
        "mean": "매일 아침 근처 공원에서 조깅하고 있어요."
      }
    ]
  },
  {
    "id": 40,
    "grammar": "~てある",
    "means": "~져 있다 (상태)",
    "description":
        "1.동작 결과의 지속\n동작이 끝난 후에 어떤 상태가 지속되고 있음을 나타낸다.\n타동사 앞에는 が를 사용.\n\n2.일을 미리 완료시켰다\n어떤 일을 미리 끝내놨음을 나타낸다.\n[もう / すでに]와 자주 호흥",
    "connectionWays": "동사 て형",
    "examples": [
      {"answer": "ある", "word": "壁に絵が飾ってある。", "mean": "벽에 그림이 장식되어 있다."},
      {
        "answer": "あった",
        "word": "手紙の中には写真１枚が添えられてあった。",
        "mean": "편지 속에는 사진 한 장이 곁들여져 있었다."
      },
      {"answer": "あった", "word": "机の上にメモが置いてあった。", "mean": "책상 위에 메모가 놓여 있었다."},
      {
        "answer": "ありますよ",
        "word": "財布は椅子の上に置いてありますよ。",
        "mean": "지갑은 의자 위에 놓여 있어요."
      },
      {
        "answer": "あります",
        "word": "ホテルはもう予約してあります。",
        "mean": "호텔은 이미 예약되어 있습니다."
      },
      {
        "answer": "あります",
        "word": "その件はもう先方に伝えてあります。",
        "mean": "그 건은 이미 상대방에게 전달되었습니다."
      },
      {
        "answer": "あります",
        "word": "もう準備してありますから, 安心してください。",
        "mean": "이미 준비되어 있으니까 안심하세요."
      },
      {
        "answer": "あります",
        "word": "このパソコンは誰でも使えるように設定してあります。",
        "mean": "이 컴퓨터는 누구나 사용할 수 있도록 설정되어 있습니다."
      }
    ]
  },
  {
    "id": 43,
    "grammar": "~ておく(とく)",
    "means": "~해두다",
    "description": "1. 어떤 목적 때문에 미리 준비해두다.\n\n2. 아무것도 하지 않고 방치해두다\nとく는 회화체",
    "connectionWays": "동사 て형",
    "examples": [
      {
        "answer": "おきましょう",
        "word": "お客さんが来る前に部屋を掃除しておきましょう。",
        "mean": "손님이 오기 전에 방을 청소해 둡시다."
      },
      {
        "answer": "おきましょう",
        "word": "混乱を避けるため, 早めに皆さんに通知しておきましょう。",
        "mean": "혼란을 피하기 위해 빨리 여러분에게 통지해 둡시다."
      },
      {
        "answer": "おいてください",
        "word": "後で見ますので, そこに置いておいてください。",
        "mean": "나중에 볼테니 거기에 놓아두세요."
      },
      {
        "answer": "おいてください",
        "word": "忙しいので, 私の代わりに打ち合わせしておいてください。",
        "mean": "바빠서 그러는데 저 대신 미팅 해두세요."
      },
      {
        "answer": "おけば",
        "word": "ちゃんと挨拶しておけば, 顔は覚えてもらえるかもしれない。",
        "mean": "인사 잘 해놓으면 얼굴은 기억해 줄 수도 있어."
      },
      {
        "answer": "おく",
        "word": "ここに置いておくので, 使いたければ使ってください。",
        "mean": "여기에 놔둘테니 쓰고 싶으면 쓰세요."
      },
      {"answer": "おいたよ", "word": "アイスは冷凍庫に入れておいたよ。", "mean": "아이스는 냉동실에 넣어놨어."},
      {
        "answer": "おけ",
        "word": "文句なんか勝手に言わせておけ。",
        "mean": "불평 따위 마음대로 하게 내버려 둬."
      }
    ]
  },
  {
    "id": 44,
    "grammar": "~てほしい / ~てほしくない",
    "means": "~했으면 한다, ~하기를 바란다.\n\n~하지 않았으면 한다, ~하지 않기를 바란다",
    "description": "상대에 대해서 바람, 희망, 요구를 나타낸다.",
    "connectionWays": "동사 て형",
    "examples": [
      {"answer": "ほしい", "word": "誰か私のそばに居てほしい。", "mean": "누군가 내 옆에 있었으면 좋겠어."},
      {"answer": "ほしい", "word": "彼女に料理を作ってほしい。", "mean": "그녀가 요리를 해줬으면 좋겠어."},
      {"answer": "ほしい", "word": "彼には早く謝ってほしい。", "mean": "그는 빨리 사과해 주길 바란다."},
      {
        "answer": "ほしい",
        "word": "両親にはいつまでも元気でいてほしい。",
        "mean": "부모님이 오래오래 건강하셨으면 좋겠다."
      },
      {
        "answer": "ほしい",
        "word": "一人じゃできないので誰かに助けてほしい。",
        "mean": "혼자서는 할 수 없으니 누군가가 도와줬으면 좋겠어."
      },
      {
        "answer": "ほしい",
        "word": "身長伸びてほしいから牛乳毎日飲んでる。",
        "mean": "키 컸으면 해서 우유 맨날 먹어."
      },
      {
        "answer": "ほしい",
        "word": "雨が降ってると気分も上がらないので早く晴れてほしい。",
        "mean": "비가 오면 기분도 안 오르니까 빨리 맑았으면 좋겠어."
      },
      {"answer": "ほしい", "word": "早く夏休みが来て欲しい。", "mean": "빨리 여름방학이 왔으면 좋겠다."}
    ]
  },
  {
    "id": 45,
    "grammar": "~てもかまわない / ~なくてもかまわない",
    "means": "~해도 상관없다 / ~하지 않아도 상관없다",
    "description": "てもかまわない: 소극적인 허가 또는 허용을 표현함.\n\nなくてもかまわない: ~하지 않아도 된다.",
    "connectionWays": "て형에 접속",
    "examples": [
      {
        "answer": "でも構いませんので",
        "word": "初心者でも構いませんので, 気になる方はご連絡ください。",
        "mean": "초보자라도 상관없으니 궁금하신 분은 연락주세요."
      },
      {
        "answer": "ても構わない",
        "word": "美味しいものを食べるためなら遠くても構わない。",
        "mean": "맛있는 거 먹기 위해서라면 멀어도 상관없어."
      },
      {
        "answer": "ても構わない",
        "word": "明日は夜勤だから, 今日寝るのは遅くても構わない。",
        "mean": "내일 야근이니까 오늘 자는 건 늦어도 상관없어."
      },
      {
        "answer": "なくても構わない",
        "word": "このレベルの問題なら解けなくても構わない。",
        "mean": "이 수준의 문제라면 못 풀어도 상관없어."
      },
      {
        "answer": "なくても構わない",
        "word": "一番じゃなくても構わないが, せめて普通より上でいたい。",
        "mean": "일등은 아니어도 상관없지만 적어도 보통보다 위에 있고 싶어."
      },
      {"answer": "なくても構わない", "word": "嫌なら来なくても構わない。", "mean": "싫으면 안와도 상관없어."},
      {
        "answer": "なくても構わない",
        "word": "同じ年なんだから, 敬語じゃなくても構わないよ。",
        "mean": "동갑이니까 존댓말 아니어도 상관없어."
      },
      {
        "answer": "ても構わない",
        "word": "嘘はバレても構わないものにとどめておくべきだ。",
        "mean": "거짓말은 들켜도 상관없는 것에 머물러야 한다."
      }
    ]
  },
  {
    "id": 46,
    "grammar": "~とおり(に) / ~どおり(に)",
    "means": "~ 대로",
    "description": "예정, 계획, 명령, 지시, 상상하다, 생각하다 등 특정 단어에 자주 연결된다.",
    "connectionWays": "동사 사전형＋通り(とおり)\n동사 과거형＋通り(とおり)\n명사＋( の )＋通り(とおり)",
    "examples": [
      {"answer": "通りに", "word": "計画は予定通りに進んでいる。", "mean": "계획은 예정대로 진행되고 있다."},
      {
        "answer": "通りに",
        "word": "私の指示通りにやらなかったからこんなことになったんだろう。",
        "mean": "내가 시키는 대로 안 해서 이렇게 된 거겠지."
      },
      {
        "answer": "通りに",
        "word": "説明書通りに操作してみたが, よく分からなかった。",
        "mean": "설명서대로 조작해봤는데 잘 모르겠어."
      },
      {
        "answer": "通りに",
        "word": "ここに書いている通りにやれと言われたのでやったのに, なぜ叱られなければならないのか。",
        "mean": "여기 적힌 대로 하라고 해서 한 건데 왜 혼나야 하나."
      },
      {
        "answer": "通りに",
        "word": "人生とは, 自分が思い描いた通りに進まないものだ。",
        "mean": "인생이란 자신이 원하는 대로 되지 않는 것이다."
      },
      {
        "answer": "通り",
        "word": "あれから事態は悪化する一方で, 想像した通りの結果になった。",
        "mean": "그때부터 사태는 악화되는 한편 상상했던 대로의 결과가 되었다."
      },
      {"answer": "通り", "word": "彼女は噂通りの美人だった。", "mean": "그녀는 소문대로 미인이었다."},
      {"answer": "通り", "word": "そちらのおっしゃる通りです。", "mean": "그쪽 말이 맞아요."}
    ]
  },
  {
    "id": 48,
    "grammar": "~たところだ",
    "means": "막 ~ 했다",
    "description": "동작의 직후를 표현함.\n\n앞에 [今, さっき, 少し前に] 등 단어가 자주 호흥한다.",
    "connectionWays": "동사 과거형",
    "examples": [
      {"answer": "ところです。", "word": "今帰って来たところです。", "mean": "지금 막 돌아왔어요."},
      {
        "answer": "ところだ",
        "word": "ちょうど食べ終わったところだから動きたくない。",
        "mean": "막 다 먹은 참이라 움직이기 싫어."
      },
      {"answer": "ところです。", "word": "たった今駅に着いたところです。", "mean": "방금 막 역에 도착했어요."},
      {"answer": "たところだ", "word": "ちょうどクッキーが焼けたところだ。", "mean": "방금 쿠키가 구워졌어."},
      {"answer": "たところだ", "word": "ちょうど手が空いたところだ。", "mean": "마침 손이 빈 참이다."},
      {"answer": "ところだ", "word": "レポートが書き終わったところだ。", "mean": "리포트가 막 다 쓴 참이다."},
      {"answer": "ところです", "word": "今家から出発したところです。", "mean": "지금 막 집에서 출발했어요."},
      {"answer": "ところだ", "word": "今さっき起きたところだ。", "mean": "방금 일어났어."}
    ]
  },
  {
    "id": 49,
    "grammar": "~ているところだ",
    "means": "~하고 있는 중이다",
    "description": "동작이 진행중임을 나타내는 표현",
    "connectionWays": "동사 ている형",
    "examples": [
      {"answer": "いるところです", "word": "今ご飯を食べているところです。", "mean": "지금 밥 먹는 중이에요."},
      {
        "answer": "いるところです",
        "word": "今手伝ってくれる人を集めているところです。",
        "mean": "지금 도와줄 사람을 모으는 중이에요."
      },
      {"answer": "いるところだ", "word": "家に帰っているところだ。", "mean": "집에 가고 있는 중이다."},
      {
        "answer": "いるところです",
        "word": "今階段を下りているところですからもう少し待っていてください。",
        "mean": "지금 계단 내려가는 중이니 조금만 더 기다려주세요."
      },
      {
        "answer": "いるところです",
        "word": "今そちらに向かっているところです。",
        "mean": "지금 그쪽으로 가고 있는 중입니다."
      },
      {
        "answer": "いるところです",
        "word": "私は今横になっているところです。",
        "mean": "저는 지금 누워있는 중입니다."
      },
      {"answer": "いるところだ", "word": "今掃除しているところだ。", "mean": "지금 청소하고 있는 중이야."},
      {
        "answer": "いるところです",
        "word": "ただいま開店準備をしているところです。",
        "mean": "지금 개점 준비를 하고 있는 중입니다."
      }
    ]
  },
  {
    "id": 52,
    "grammar": "~ないで ",
    "means": "~하지 않고, ~하지마",
    "description": "동작, 상태의 부정을 나타낸다.\n~하지 않고 (상황 연결)\nずに 와 같은 표현",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "わず",
        "word": "どちらか一つを選べと言われたら, 迷わずＡを選ぶ。",
        "mean": "어느 하나를 선택하라고 하면 망설이지 않고 A를 선택한다."
      },
      {
        "answer": "ないで",
        "word": "飛んでくる矢を, 手を傷つけないで掴み取る。",
        "mean": "날아오는 화살을 손에 상처를 내지 않고 잡아낸다."
      },
      {
        "answer": "せずに",
        "word": "両親に孫の顔を見せずに死なせるわけにはいかない。",
        "mean": "부모에게 손자의 얼굴을 보여주지 않고 죽게 할 수는 없다."
      },
      {
        "answer": "ずに",
        "word": "一度もモテ期が訪れずに人生を終えることになりそうだ。",
        "mean": "한 번도 인기기가 찾아오지 않고 인생을 마감하게 될 것 같다."
      },
      {"answer": "まず", "word": "ゴールデンウィークも休まず働く。", "mean": "황금연휴에도 쉬지 않고 일한다."},
      {
        "answer": "れずに",
        "word": "彼はあまりのストレスに耐え切れずに自死を選んだ。",
        "mean": "그는 너무 많은 스트레스를 견디지 못하고 자살을 선택했다."
      },
      {"answer": "ずに", "word": "睡魔に勝てずに寝落ちした。", "mean": "졸음을 이기지 못하고 잠이 들었다."},
      {"answer": "ないで", "word": "仕事しないでずっと本読んでたい。", "mean": "일 안하고 계속 책 읽고 싶어."}
    ]
  },
  {
    "id": 53,
    "grammar": "なくて",
    "means": "~하지 않아서",
    "description": "~하지 않아서 (원인, 이유를 나타낸다)",
    "connectionWays": "동사 ない형＋ないで",
    "examples": [
      {
        "answer": "なくて",
        "word": "富士山が見えなくて, がっかりしました。",
        "mean": "후지산이 보이지 않아서 실망했습니다."
      },
      {"answer": "なくて", "word": "旅行に行けなくて残念でした。", "mean": "여행을 못 가서 아쉬웠어요."},
      {"answer": "なくて", "word": "お金がなくて心配です。", "mean": "돈이 없어서 걱정이에요."},
      {"answer": "なくて", "word": "彼女と会えなくて寂しいです。", "mean": "그녀와 만나지 못해서 쓸쓸해요."},
      {
        "answer": "なくて",
        "word": "死んだ人がいなくて安心しました。",
        "mean": "죽은 사람이 없어서 안심했어요."
      },
      {"answer": "なくて", "word": "仕事が終わらなくて大変でした。", "mean": "일이 끝나지 않아서 힘들었어요."},
      {
        "answer": "なくて",
        "word": "英語が全然わからなくて大変でした。",
        "mean": "영어를 전혀 몰라서 힘들었어요."
      },
      {
        "answer": "なくて",
        "word": "小さい字が読めなくて困りました。",
        "mean": "작은 글씨를 읽을 수 없어서 곤란했어요."
      }
    ]
  },
  {
    "id": 54,
    "grammar": "~なる",
    "means": "~되다",
    "description": "사물이나 상태, 성질이 자연스럽게 변화함을 나타낸다.",
    "connectionWays": "な형용사 어간＋になる\n명사 ＋ になる\nい형용사 어간＋くなる\n동사 ない형＋なくなる",
    "examples": [
      {
        "answer": "になった",
        "word": "先生の一声で教室は静かになった。",
        "mean": "선생님의 한마디로 교실은 조용해졌다."
      },
      {"answer": "になった", "word": "やっと大人になった。", "mean": "이제야 어른이 되었다."},
      {
        "answer": "くなる",
        "word": "彼女は化粧するともっと可愛くなる。",
        "mean": "그녀는 화장하면 더 귀여워진다."
      },
      {
        "answer": "になっていた",
        "word": "気づいたら彼を好きになっていた。",
        "mean": "정신을 차려보니 그를 좋아하게 되어 있었다."
      },
      {
        "answer": "くなる",
        "word": "薬は飲み過ぎるとだんだん効かなくなる。",
        "mean": "약은 과식하면 점점 듣지 않게 된다."
      },
      {"answer": "になった", "word": "２０歳になった。", "mean": "스무 살 됐어."},
      {
        "answer": "なくなる",
        "word": "説明聞けば聞くほど分からなくなる。",
        "mean": "설명 들으면 들을수록 헷갈린다."
      },
      {
        "answer": "なくなった",
        "word": "ホラー映画を見たら寝られなくなった。",
        "mean": "공포영화를 보니 잠을 잘 수 없게 되었다."
      }
    ]
  },
  {
    "id": 57,
    "grammar": "~にしたがって, ~にしたがい",
    "means": "~에 따라",
    "description":
        "규칙, 명령, 지시, 안내, 인명 이나 조직명 등에 대해서 그것을 지키면서 행동하는 것을 표현한다.\n\n앞 문장에는 어떤 동작이나 변화와 함께 뒷 내용의 상태모 변화한 다는 것을 나타낸다.\n\n[~につれて / につれ] 와 의미가 같다.",
    "connectionWays": "명사에 직접 접속\n동사 사전형",
    "examples": [
      {
        "answer": "に従い",
        "word": "スタッフの案内に従い, 入場していただきますようお願いいたします。",
        "mean": "직원의 안내에 따라 입장해 주시기 바랍니다."
      },
      {
        "answer": "に従って",
        "word": "インストールは手順に従ってやったつもりだけど, どうもうまくいかない。",
        "mean": "인스톨은 순서에 따라 했다고 생각하는데 아무래도 잘 안되네."
      },
      {
        "answer": "に従って",
        "word": "ゴミは各自治体のルールに従ってきちんと捨てること。",
        "mean": "쓰레기는 각 지자체의 규칙에 따라 제대로 버릴 것."
      },
      {
        "answer": "に従い",
        "word": "常に自分の良心に従い行動したい。",
        "mean": "항상 자신의 양심에 따라 행동하고 싶다."
      },
      {
        "answer": "にしたがって",
        "word":
            "好奇心にしたがって, 余計なことを気にせず, 時間も忘れるほどに没頭できることを探して追求する。没頭すればするほどその情熱は強く燃え上がるんだ。",
        "mean":
            "호기심에 따라 쓸데없는 것을 신경 쓰지 않고 시간도 잊어버릴 정도로 몰입할 수 있는 것을 찾아 추구한다.몰두할수록 그 열정은 강하게 타오른다구."
      },
      {
        "answer": "にしたがって",
        "word": "放送の指示にしたがって避難してください。",
        "mean": "방송의 지시에 따라 대피하십시오."
      },
      {"answer": "にしたがって", "word": "本心にしたがって生きる。", "mean": "본심에 따라 살다."},
      {
        "answer": "にしたがって",
        "word": "私たちは真実にしたがって考え行動する。ただしそれは, 自分が信じる真実である。",
        "mean": "우리는 진실에 따라 생각하고 행동한다.다만 그것은 자신이 믿는 진실이다."
      },
      {
        "answer": "にしたがって",
        "word": "天気予報にしたがって, しっかり長い傘を持って出勤した。",
        "mean": "일기예보에 따라 단단히 긴 우산을 들고 출근했다."
      },
      {
        "answer": "にしたがって",
        "word": "係員の誘導にしたがって移動してください。",
        "mean": "담당자의 유도에 따라 이동하십시오."
      },
      {
        "answer": "にしたがい",
        "word": "河川は小さな河川の合流を繰り返しながら下流へ向かうにしたがい大きな河川となっていきます。 ",
        "mean": "하천은 작은 하천의 합류를 반복하면서 하류로 향할수록 큰 하천이 됩니다."
      },
      {
        "answer": "にしたがって",
        "word": "年を取るにしたがって, 体が思うように動かなくなってきた。",
        "mean": "나이가 들면서 몸이 마음대로 움직이지 않게 되었다."
      },
      {
        "answer": "にしたがって",
        "word": "この映画は話が進むにしたがって面白さを増してくる。",
        "mean": "이 영화는 이야기가 진행된다에 따라 재미를 더해준다."
      },
      {
        "answer": "にしたがって",
        "word": "神社の奥に行くにしたがってどんどん神秘的な雰囲気になっていきます。",
        "mean": "신사 안쪽으로 가면서 점점 신비로운 분위기가 되어 갑니다."
      },
      {
        "answer": "に従い",
        "word": "高齢者人口が増えるに従い, 入浴中の事故死が増えてきている。",
        "mean": "노인 인구가 늘면서 목욕 중 사고사가 늘고 있다."
      },
      {
        "answer": "に従い",
        "word": "飛行機は速度が増すに従い揚力が増加するように設計されている。",
        "mean": "비행기는 속도가 증가함에 따라 양력이 증가하도록 설계되어 있다."
      },
      {
        "answer": "にしたがい",
        "word": "児童 / 徒数が減少するにしたがい, 教員数も減少している。",
        "mean": "아동 / 학생 수가 감소함에 따라 교원 수도 감소하고 있다."
      },
      {
        "answer": "にしたがって",
        "word": "噴火による衝撃波は火口から離れるにしたがって減衰する。",
        "mean": "분화에 의한 충격파는 화구에서 멀어짐에 따라 감쇠한다."
      },
      {
        "answer": "に従い",
        "word": "頂上に近づくに従い風が強くなる。",
        "mean": "정상에 가까워질수록 바람이 거세진다."
      }
    ]
  },
  {
    "id": 58,
    "grammar": "~に過ぎない",
    "means": "~에 지나지 않는다.",
    "description":
        "대단히 낮은 정도 [~에 지나지 않는다] 의 의미한다.\n\n[그다지 중요하지 않는다] 등 경시하는 뉘양스가 있음.\n\n[ほんの, ただ, ただの, たった, 単なる] 등 단어와 자주 호흥한다.\n\nにすぎない 라고 발음한다.",
    "connectionWays":
        "동사 사전형＋に過ぎない\nい형용사 보통형＋に過ぎない\nな형용사 어간＋である＋に過ぎない\n명사(＋である)＋に過ぎない",
    "examples": [
      {
        "answer": "に過ぎません",
        "word": "これはあくまで私一個人の意見に過ぎません。",
        "mean": "이것은 어디까지나 저 혼자만의 의견일 뿐입니다."
      },
      {
        "answer": "~に過ぎない",
        "word": "愛と憎しみは全く同じものである。ただ, 前者は積極的であり, 後者は消極的であるに過ぎない。",
        "mean": "사랑과 미움은 똑같은 것이다.다만 전자는 적극적이고 후자는 소극적일 뿐이다."
      },
      {
        "answer": "~に過ぎない",
        "word": "自信無くするのは失敗した時の保身に過ぎない。",
        "mean": "자신감 없이 하는 것은 실패했을 때의 보신일 뿐이다."
      },
      {
        "answer": "~に過ぎない",
        "word": "報道されていることは氷山の一角に過ぎない。",
        "mean": "보도되고 있는 것은 빙산의 일각에 불과하다."
      },
      {
        "answer": "~に過ぎない",
        "word": "肉体は魂の入れ物に過ぎない。",
        "mean": "육체는 영혼의 용기일 뿐이다."
      },
      {
        "answer": "~に過ぎない",
        "word": "私はただのアルバイトに過ぎないので, 詳しいことは分かりません。",
        "mean": "저는 그냥 아르바이트에 불과해서 자세한 건 모르겠어요."
      },
      {
        "answer": "~に過ぎない",
        "word": "人と人に優劣をつけるなんてただの自己満足に過ぎない。",
        "mean": "남과 남에게 우열을 가리다니 그저 자기만족에 불과하다."
      },
      {
        "answer": "~に過ぎない",
        "word": "地球も太陽系の惑星の一つに過ぎない。",
        "mean": "지구도 태양계 행성 중 하나일 뿐이다."
      }
    ]
  },
  {
    "id": 51,
    "grammar": "~にする",
    "means": "1. ~로 하다, ~로 정하다\n2. ~하게 하다",
    "description":
        "1.\n화자 자신의 의지나 판단에 의한 주관적인 결정에 사용하는 문법.\n여러가지 선택지 중 하나를 고르거나 혹은 주문할 때 자주 사용.\n\n2.\n사물이나 상태, 성질을 인위적으로 원하는 결과로 변화시키는 것을 나타낸다.",
    "connectionWays":
        "1. \n명사에 직접 접속\n\n2.\nな형용사 어간＋にする\n名詞＋にする\nい형용사 어간＋くする\n동사 ない형＋なくする",
    "examples": [
      {"answer": "にします", "word": "私はコーラにします。", "mean": "저는 콜라로 할게요."},
      {
        "answer": "にしました",
        "word": "妹へのプレゼントはマフラーにしました。",
        "mean": "여동생 선물은 목도리로 했어요."
      },
      {
        "answer": "してください",
        "word": "お酒は飲めないので, 他のにしてください。",
        "mean": "술은 못 마시니 다른 걸로 해주세요."
      },
      {
        "answer": "にしましょう",
        "word": "喉が渇いたら, 健康のため, 炭酸飲料ではなく水にしましょう。",
        "mean": "목이 마르면 건강을 위해 탄산음료 말고 물로 합시다."
      },
      {
        "answer": "にする",
        "word": "仕事の補佐をお願いするなら, 私は必ずＡさんにする。",
        "mean": "일의 보좌를 부탁한다면 나는 반드시 A씨에게 할 것이다."
      },
      {
        "answer": "にした",
        "word": "この髪型にしたのは, 最近海外で流行っているからだ。",
        "mean": "이 머리를 한 것은 요즘 해외에서 유행하고 있기 때문이다."
      },
      {"answer": "にしたい", "word": "我が子を弁護士にしたい。", "mean": "우리 아이를 변호사로 만들고 싶다."},
      {"answer": "にしてください", "word": "ちょっと静かにしてください。", "mean": "조용히 좀 해주세요."},
      {"answer": "にする", "word": "練習は不可能を可能にする。", "mean": "연습은 불가능을 가능하게 한다."},
      {
        "answer": "して",
        "word": "お腹を冷やさないように, 暖かくして寝てください。",
        "mean": "배를 식히지 않도록 따뜻하게 하고 주무세요."
      },
      {"answer": "したい", "word": "壁の色を黒くしたい。", "mean": "벽 색깔을 검게 하고 싶어."},
      {
        "answer": "する",
        "word": "辛いのが苦手なので, カレー作るときはいつも甘くする。",
        "mean": "매운 걸 잘 못 먹어서 카레 만들 때는 항상 달게 해."
      },
      {
        "answer": "にした",
        "word": "プレゼンを誰でも分かるように簡単な内容にした。",
        "mean": "프레젠테이션을 누구나 알 수 있도록 간단한 내용으로 만들었다."
      },
      {
        "answer": "にした",
        "word": "今日のメイクは大人っぽい雰囲気にした。",
        "mean": "오늘 메이크업은 어른스러운 분위기로 했어."
      }
    ]
  },
  {
    "id": 60,
    "grammar": "~について / についての / につきましては",
    "means": "~에 관해서",
    "description":
        "동작, 작용의 대상이 되는 것을 표현한다.\n\n[~に関して] 와 의미는 같지만 보다 회화체로 사용된다.\n\n[思う, 考える, 調べる, 書く, 話す, 言う] 등의 명사가 자주 온다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "について",
        "word": "この件についてどうお考えでしょうか。",
        "mean": "이 건에 대해 어떻게 생각하십니까?"
      },
      {
        "answer": "について",
        "word": "地域の伝統行事について色々調べている。",
        "mean": "지역 전통 행사에 대해 여러 가지 알아보고 있다."
      },
      {
        "answer": "について",
        "word": "私の将来の仕事について仲間に相談した。",
        "mean": "내 장래의 일에 대해 동료와 상의했다."
      },
      {
        "answer": "について",
        "word": "空軍パイロットのUFO目撃事件については多くの報告書が存在する。",
        "mean": "공군 조종사의 UFO 목격 사건에 대해서는 많은 보고서가 존재한다."
      },
      {
        "answer": "について",
        "word": "人々には男女平等についてもっと考えて欲しい。",
        "mean": "사람들이 남녀평등에 대해 더 생각해줬으면 좋겠어."
      },
      {
        "answer": "について",
        "word": "彼女は和菓子について詳しい。",
        "mean": "그녀는 화과자에 대해 잘 알고 있다."
      },
      {
        "answer": "について",
        "word": "スマホゲームに課金することについては嫌悪感を持っている。",
        "mean": "스마트폰 게임에 과금하는 것에 대해서는 혐오감을 가지고 있다."
      },
      {
        "answer": "について",
        "word": "集合場所と時間についてもう一度教えていただけませんか。",
        "mean": "집합 장소와 시간에 대해 다시 알려주시겠어요?"
      },
      {
        "answer": "につきまして",
        "word": "詳しい内容につきましては添付画像をご確認ください。",
        "mean": "자세한 내용에 대해서는 첨부 이미지를 확인해 주십시오."
      },
      {
        "answer": "につきましては",
        "word": "お客様からのご意見・ご要望につきましては真摯に受け止め, よりよいサービスの提供に向けて努力してまいります。",
        "mean": "고객으로부터의 의견·요망에 대해서는 진지하게 받아들여, 보다 나은 서비스의 제공을 향해서 노력해 가겠습니다."
      }
    ]
  },
  {
    "id": 61,
    "grammar": "~につき",
    "means": "1. ~에 관해서\n2. ~당\n3. ~ 때문에",
    "description":
        "1. [~について] 와 같은 의미를 갖지만 보다 격식 있는 표현\n\n2. 비율이나 비율을 나타낸다.\n그 수마다 평등하게 할당된 조건에 대해 말하는 문법.\n\n3. 이유나 원인을 나타내는 격식있는 표현.\n불특정 다수의 사람에 대해 공지나 통지에 자주 사용된다.",
    "connectionWays": "1, 명사에 직접 접속\n2. 명사에 직접 접속\n3. 명사에 직접 접속,\n  숫자 + 조수사",
    "examples": [
      {
        "answer": "~につき",
        "word": "移転問題につき, 野党からの激しい追及を受けている。",
        "mean": "이전 문제에 대해 야당으로부터 거센 추궁을 받고 있다."
      },
      {
        "answer": "~につき",
        "word": "この問題につき, 熱い議論が交わされた。",
        "mean": "이 문제에 대해 열띤 논의가 오갔다."
      },
      {
        "answer": "~につき",
        "word": "当店物件につき, お気軽にお問い合わせ下さい。",
        "mean": "저희 가게 물건에 대해 부담없이 문의해 주십시오."
      },
      {
        "answer": "~につき",
        "word": "参考資料につき, 一部誤記がございましたので修正しました。",
        "mean": "참고 자료에 대해 일부 오기가 있어 수정하였습니다."
      },
      {
        "answer": "~につき",
        "word": "新しい事業計画につき, これからご説明いたします。",
        "mean": "새로운 사업계획에 대해 지금부터 설명드리겠습니다."
      },
      {
        "answer": "~につき",
        "word": "会場につき参加申込可能人数を超えてお申込みがあった場合は, 参加をお断りすることがありますのでご了承ください。",
        "mean": "회장당 참가 신청 가능 인원을 초과하여 신청이 있을 경우 참가를 거절할 수 있음을 양해 바랍니다."
      },
      {
        "answer": "~につき",
        "word": "館内のご利用に際し, 下記内容につきご留意ください。",
        "mean": "관내 이용 시 아래 내용에 대해 유의하시기 바랍니다."
      },
      {
        "answer": "~につき",
        "word": "小学校に必要なタブレット端末の選定につき検討の結果, 性能も良くより安価なＡ社製品のものを導入することにした。",
        "mean": "초등학교에 필요한 태블릿 단말기 선정 검토 결과 성능도 좋고 보다 저렴한 A사 제품을 도입하기로 했다."
      },
      {
        "answer": "~につき",
        "word": "店内改装中につき, しばらく休業させていただきます。",
        "mean": "매장 개장 중이므로 잠시 휴업합니다."
      },
      {
        "answer": "~につき",
        "word": "グロシーンを含む,18禁につき, 閲覧注意です。",
        "mean": "글로신을 포함한 18금이기 때문에 열람 주의합니다."
      },
      {
        "answer": "~につき",
        "word": "明日は出張につき, 朝５時に起きなければならない。",
        "mean": "내일은 출장을 가기 때문에 아침 5시에 일어나야 한다."
      },
      {"answer": "~につき", "word": "多忙につき, 返信できませんでした。", "mean": "바빠서 답장을 못했어요."},
      {
        "answer": "~につき",
        "word": "セール品につき返品不可です。",
        "mean": "세일 제품이므로 반품 불가입니다."
      },
      {
        "answer": "~につき",
        "word": "好評につきキャンペーン期間延長いたします。",
        "mean": "호평에 따라 캠페인 기간을 연장해 드립니다."
      },
      {
        "answer": "~につき",
        "word": "お申込者が多数につき新規会場を増設いたしました。",
        "mean": "신청자가 다수이기 때문에 신규 회장을 증설했습니다."
      },
      {
        "answer": "~につき",
        "word": "公園のトイレは故障につき現在ご使用いただけません。",
        "mean": "공원 화장실은 고장 때문에 현재 사용할 수 없습니다."
      },
      {"answer": "~につき", "word": "私有地につき立入禁止", "mean": "사유지이므로 출입 금지"},
      {
        "answer": "~につき",
        "word": "業務多忙につき, 看護師１名急募",
        "mean": "업무가 바빠 간호사 1명 급모"
      },
      {
        "answer": "~につき",
        "word": "締切間近につき, 参加ご希望の方は申込みをお急ぎ下さい。",
        "mean": "마감이 임박하여 참가를 희망하시는 분은 신청을 서둘러 주시기 바랍니다."
      },
      {
        "answer": "~につき",
        "word": "割引券は一人につき１枚まで使用できます。",
        "mean": "할인권은 인당 1매까지 사용할 수 있습니다."
      },
      {
        "answer": "~につき",
        "word": "チャンスは１人につき１回までです。",
        "mean": "기회는 1인당 1회까지입니다."
      },
      {
        "answer": "~につき",
        "word": "ご利用金額500円につき10ポイント進呈いたします。",
        "mean": "이용금액 500엔당 10포인트 증정해 드립니다."
      },
      {
        "answer": "~につき",
        "word": "貸し会議室のご利用は1時間につき2,200円です。",
        "mean": "대여 회의실 이용은 시간당 2,200엔입니다."
      },
      {
        "answer": "~につき",
        "word": "お弁当1個につきお茶１本プレゼント！",
        "mean": "도시락 1개당 차 1병 증정!"
      },
      {
        "answer": "~につき",
        "word": "10個以上のご注文の場合1つにつき50円引き！",
        "mean": "10개 이상 주문시 1개당 50엔 할인!"
      },
      {
        "answer": "~につき",
        "word": "中学生までの子ども一人につき5,000円分の応援券を配布します。",
        "mean": "중학생까지의 어린이 1인당 5,000엔분의 응원권을 배포합니다."
      },
      {
        "answer": "~につき",
        "word": "お一人さま１日につき１回までくじを引くことができます。",
        "mean": "1인당 하루에 한 번까지 제비뽑기를 할 수 있습니다."
      },
      {
        "answer": "~につき",
        "word": "参加費は１名につき35,000円です。",
        "mean": "참가비는 1인당 35,000엔입니다."
      },
      {
        "answer": "~につき",
        "word": "1回のご注文につき, お支払い手数料180円をご負担いただきます。",
        "mean": "1회 주문 당 결제 수수료 180엔을 부담하셔야 합니다."
      }
    ]
  },
  {
    "id": 64,
    "grammar": "にとって",
    "means": "~에게 (있어서)",
    "description":
        "사람, 조직, 단체 등 명사에 접속하여, 그것들의 위치에서 바라본 판단이나 감상, 평가 등을 표현하는 문법",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にとって",
        "word": "女の子一人という環境は私にとって不安で心配。",
        "mean": "여자 혼자라는 환경은 나에게 불안하고 걱정이다."
      },
      {
        "answer": "にとって",
        "word": "彼氏や彼女がいるのと自分にとって一生大切にしたい人がいるのとでは全く違う。",
        "mean": "남자친구나 여자친구가 있는 것과 자신에게 평생 간직하고 싶은 사람이 있는 것은 전혀 다르다."
      },
      {
        "answer": "にとって",
        "word": "失敗した時こそ, 私たちにとって本当の学びが始まる。",
        "mean": "실패했을 때만이 우리에게 진정한 배움이 시작된다."
      },
      {
        "answer": "にとって",
        "word": "今年が皆様にとって素晴らしい一年であることを祈念いたします。",
        "mean": "올해가 여러분께 멋진 한 해이기를 기원합니다."
      },
      {
        "answer": "にとって",
        "word": "これは私にとって特別な映画です。",
        "mean": "이것은 저에게 있어서 특별한 영화입니다."
      },
      {
        "answer": "にとって",
        "word": "社会人にとっての２４時間はあまりにも短い。",
        "mean": "직장인에게 있어서의 24시간은 너무 짧다."
      },
      {
        "answer": "にとって",
        "word": "こんなことをしているのは私にとってもあなたにとっても時間の無駄です。",
        "mean": "이런 일을 하고 있는 것은 저에게도 당신에게도 시간 낭비입니다."
      },
      {"answer": "にとって", "word": "彼の２歩は私にとっての３歩。", "mean": "그의 두 걸음은 나에게 3걸음."}
    ]
  },
  {
    "id": 65,
    "grammar": "には",
    "means": "1. ~하려면, ~하기 위해서는\n2. ~하기에는",
    "description":
        "1. 동작의 목적\n앞 문장에는 목적을 뒷 문장에는 그 목적을 달생하기 위해서 필요한 조건을 서술한다.\n\n2. 평가의 기준\n인명을 나타내는 명사에 대해서, 그 인물에게 어떤 상황에 대한 평가를 표현한다.\n뒷 내용에는 주로 난이도에 관한 말이 온다.",
    "connectionWays": "동사 사전형\n명사",
    "examples": [
      {
        "answer": "には",
        "word": "新しい生活に慣れるには時間が必要。",
        "mean": "새로운 생활에 익숙해지려면 시간이 필요해."
      },
      {
        "answer": "には",
        "word": "成功するには, 成功するまで決して諦めないことだ。",
        "mean": "성공하려면 성공할 때까지 결코 포기하지 않는 것이다."
      },
      {
        "answer": "には",
        "word": "痩せるにはまず食生活を見直すことから始めよう。",
        "mean": "살을 빼려면 먼저 식생활을 재검토하는 것부터 시작하자."
      },
      {
        "answer": "には",
        "word": "再び同じ過ちを犯さないようにするには, しっかり反省するのが大切だ。",
        "mean": "다시는 같은 실수를 저지르지 않으려면 제대로 반성하는 것이 중요하다."
      },
      {
        "answer": "には",
        "word": "何かアドバイスをしてあげるには情報が少なすぎる。",
        "mean": "뭔가 조언을 해주기에는 정보가 너무 적어."
      },
      {
        "answer": "には",
        "word": "銀行に行くには, そこの角を左に曲がればいいですよ。",
        "mean": "은행에 가려면 저기 모퉁이에서 왼쪽으로 돌면 돼요."
      },
      {"answer": "には", "word": "恋をするにはまだ若すぎる。", "mean": "사랑을 하기에는 아직 너무 어리다."},
      {
        "answer": "には",
        "word": "自分を理解してもらうには, まず相手を理解してあげなければ始まらない。",
        "mean": "자신을 이해시키기 위해서는 먼저 상대방을 이해해 주지 않으면 시작되지 않는다."
      }
    ]
  },
  {
    "id": 66,
    "grammar": "~によって / によっては / により / による",
    "means": "~에 따른, ~에 의한",
    "description": "1. 수단, 방법을 나타낸다\n2. 원인, 이유를 나타낸다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "によって",
        "word": "テストの結果によって, 成績を決める。",
        "mean": "시험 결과에 따라 성적을 결정한다."
      },
      {
        "answer": "によって",
        "word": "未成年の喫煙は法律によって禁じられている。",
        "mean": "미성년 흡연은 법률에 의해 금지되어 있다."
      },
      {
        "answer": "によって",
        "word": "行くかどうかは, 明日の天気によって決めるつもりだ。",
        "mean": "갈지 말지는 내일 날씨에 따라 결정할 거야."
      },
      {
        "answer": "によって",
        "word": "地域の安全はそこに住む人々の協力によって保たれている。",
        "mean": "지역의 안전은 그곳에 사는 사람들의 협력으로 유지되고 있다."
      },
      {
        "answer": "によって",
        "word": "インターネットによって, 世界中のニュースを知ることができるようになった。",
        "mean": "인터넷을 통해 전 세계 뉴스를 알 수 있게 됐다."
      },
      {
        "answer": "によって",
        "word": "職場環境を改善することによって, 従業員満足度を高める。",
        "mean": "직장 환경을 개선함으로써 종업원 만족도를 높인다."
      },
      {
        "answer": "によって",
        "word": "事故によって片足を失ってしまった。",
        "mean": "사고로 인해 한쪽 다리를 잃고 말았다."
      },
      {
        "answer": "により",
        "word": "今回の大雨により孤立した地域があるらしい。 ",
        "mean": "이번 폭우로 인해 고립된 지역이 있다고 한다."
      },
      {
        "answer": "によって",
        "word": "不況によって多くの会社が倒産している。",
        "mean": "불황으로 인해 많은 회사가 도산하고 있다."
      },
      {"answer": "によって", "word": "台風によって延期になりました。", "mean": "태풍으로 인해 연기되었습니다."},
      {
        "answer": "によって",
        "word": "キノコの毒によって体調不良になりました。",
        "mean": "버섯 독으로 인해 몸이 안 좋아졌어요."
      },
      {
        "answer": "によって",
        "word": "天守閣は火事によって消失しました。",
        "mean": "천수각은 화재로 소실되었습니다."
      },
      {
        "answer": "によって",
        "word": "パートナーの浮気によって離婚しました。",
        "mean": "파트너의 바람 때문에 이혼했어요."
      },
      {
        "answer": "によって",
        "word": "２０１２年, ＣＥＲＮによってヒッグス粒子とみられる粒子が発見された。",
        "mean": "2012년 CERN에 의해 힉스 입자로 보이는 입자가 발견됐다."
      },
      {
        "answer": "によって",
        "word": "金閣寺は足利義満によって建てられた。",
        "mean": "금각사는 아시카가 요시미쓰에 의해 세워졌다."
      },
      {"answer": "によって", "word": "壁が何者かによって壊された。", "mean": "벽이 누군가에 의해 부서졌다."},
      {"answer": "によって", "word": "人によって考え方は違う。", "mean": "사람마다 생각은 다르다."},
      {
        "answer": "によって",
        "word": "天気予報によると, 所によっては大雨になるそうだ。",
        "mean": "일기예보에 따르면 곳에 따라서는 비가 많이 온다고 한다."
      },
      {
        "answer": "によって",
        "word": "場合によっては強硬策をとらなくてはならなくなる。",
        "mean": "경우에 따라서는 강경책을 쓰지 않으면 안 된다."
      },
      {
        "answer": "による",
        "word": "校長先生による特別講義が行われた。",
        "mean": "교장 선생님의 특강이 진행되었다."
      },
      {
        "answer": "による",
        "word": "上司からのパワハラによる苦痛は, うつ病にかかってしまうリスクを引き起こす。",
        "mean": "상사의 갑질로 인한 고통은 우울증에 걸릴 위험을 일으킨다."
      },
      {
        "answer": "による",
        "word": "Ａ国は空軍によるミサイル攻撃を否定している。",
        "mean": "A국은 공군에 의한 미사일 공격을 부정하고 있다."
      }
    ]
  },
  {
    "id": 67,
    "grammar": "~によると / によれば / の話では",
    "means": "~에 따르면",
    "description":
        "전문이나 추측을 나타내는 문법한다.\n\n뒷 내용에는 [~そうだ, ~らしい, ~だろう] 등의 전문, 추측을 나타내는 양식 표현이 자주 호흥함.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "によると",
        "word": "一説によると, 薄毛には運動不足が関係しているらしい。",
        "mean": "일설에 의하면, 얇은 머리에는 운동 부족이 관계되어 있다고 한다."
      },
      {
        "answer": "によると",
        "word": "噂によると, あの二人は別れたようだ。",
        "mean": "소문에 의하면 그 둘은 헤어진 것 같아."
      },
      {
        "answer": "によると",
        "word": "厚生労働省の調査によると, 日本人女性の平均寿命は世界一といわれている。",
        "mean": "후생노동성 조사에 따르면 일본인 여성의 평균 수명은 세계 제일로 알려져 있다."
      },
      {
        "answer": "によれば",
        "word": "噂によれば, この学校には幽霊が出るらしい。",
        "mean": "소문에 의하면, 이 학교에는 유령이 나온다고 한다."
      },
      {
        "answer": "によると",
        "word": "知り合いから聞いたところによると, あそこのコンビニの向かいにラーメン屋ができるらしい。",
        "mean": "아는 사람한테 듣기로는 저기 편의점 건너편에 라면집이 생긴대."
      },
      {
        "answer": "によれば",
        "word": "天気予報によれば午後には風速が30メートルを超えるとのことだ。",
        "mean": "일기예보에 따르면 오후에는 풍속이 30m를 넘는다고 한다."
      },
      {
        "answer": "によると",
        "word": "聞くところによると, 消費税増税で飲食店は大打撃を受けているようだ。",
        "mean": "듣기로는 소비세 증세로 음식점들이 큰 타격을 입고 있는 것 같다."
      },
      {
        "answer": "によると",
        "word": "解剖記録によると, 死因は失血死だったそうだ。",
        "mean": "부검 기록에 따르면 사인은 실혈사였다고 한다."
      },
      {
        "answer": "による",
        "word": "嘘をつくことはいけないが, それは時と場合による。",
        "mean": "거짓말을 해서는 안 되지만, 그것은 때와 경우에 달려 있다."
      },
      {
        "answer": "による",
        "word": "飲み会は基本行かないが, 場合による。",
        "mean": "술자리는 기본 안가지만 경우에 따라 다르다."
      }
    ]
  },
  {
    "id": 68,
    "grammar": "~から~にわたって / にわたり / にわたる / にわたった",
    "means": "~에 걸쳐서",
    "description":
        "[から~まで] 와 동일하게 시간이나 공간의 범위를 나타낸다. \n\n다만 그 범위의 기점과 종점이 명확하고, 현상이 범위 전체에 퍼져 있는 듯한 뉘앙스를 가지고 있다.\n\n[ 長年にわたって / 長きにわたって] 는 장기간 지속되는 것을 나타내는 관용표현",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "にわたって",
        "word": "親から子と世代にわたって生活保護の人々もいる。",
        "mean": "부모부터 자녀와 세대에 걸쳐 생활보호자들도 있다."
      },
      {
        "answer": "長年に渡って",
        "word": "この研究は他の研究員らにより長年に渡って継続された。",
        "mean": "이 연구는 다른 연구원들에 의해 수년간 계속되었다."
      },
      {
        "answer": "にわたって",
        "word": "国道沿い２ｋｍにわたって桜並木が続いている。",
        "mean": "국도변 2㎞에 걸쳐 벚꽃길이 이어져 있다."
      },
      {
        "answer": "にわたる",
        "word": "秋田県から新潟県の日本海側にわたる広い地域で大雪警報が出ている。",
        "mean": "아키타 현에서 니가타 현 일본해 쪽에 걸친 넓은 지역에 대설경보가 내려져 있다."
      },
      {
        "answer": "にわたって",
        "word": "地震の影響でこの地区ほぼ全域が数週間にわたって断水した。",
        "mean": "지진의 영향으로 이 지구 거의 전역이 몇 주에 걸쳐 단수되었다."
      }
    ]
  },
  {
    "id": 69,
    "grammar": "~に加えて / に加え",
    "means": "~에 더하여",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に加え",
        "word": "目標を達成するには自分で行動する事に加え, 他人のサポートも必要です。",
        "mean": "목표를 달성하려면 스스로 행동하는 것 외에도 다른 사람의 도움도 필요합니다."
      },
      {
        "answer": "に加えて",
        "word": "彼女はその美貌に加えて何ともいえない妖艶さがある。",
        "mean": "그녀는 그 미모에 더해 뭐라고 말할 수 없는 요염함이 있다."
      },
      {
        "answer": "に加え",
        "word": "今年は心理学の勉強に加え, 陶芸もやってみたい。",
        "mean": "올해는 심리학 공부와 더불어 도예도 해보고 싶다."
      },
      {
        "answer": "に加え",
        "word": "栄養面で優れた食事に加え, 適切な食べ方で食事を摂ることも大切だ。",
        "mean": "영양면에서 뛰어난 식사와 더불어 적절한 먹는 방법으로 식사를 하는 것도 중요하다."
      },
      {
        "answer": "に加え",
        "word": "飲み会のあと, 二日酔いに加え腰痛も悪化した。",
        "mean": "술자리 후 숙취에 요통도 악화됐다."
      },
      {
        "answer": "に加え",
        "word": "貧血の症状に加え蕁麻疹まで出てつらい。",
        "mean": "빈혈 증세에다 두드러기까지 나서 괴롭다."
      },
      {
        "answer": "に加え",
        "word": "大量に捨てられたゴミに加え, 何十台もの無断駐輪。この辺りは身勝手な人が多いようだ。",
        "mean": "대량으로 버려진 쓰레기 외에도 수십 대의 무단 주차.이 근처는 제멋대로인 사람이 많은 것 같아."
      },
      {
        "answer": "に加え",
        "word": "声も低くて顔もカッコよくて, それに加え色気もあるところが最高。",
        "mean": "목소리도 낮고 얼굴도 멋있고 색감도 있는 게 최고."
      }
    ]
  },
  {
    "id": 70,
    "grammar": "~に関して / に関しての / に関する / に関しまして",
    "means": "~에 관해서",
    "description":
        "어떤 것과 화제가 관련되어 있음을 나타낸다.\n\n[~に関しまして(は)] 는 보다 격식을 차린 말\n\n[について / についての / につきましては] 보다 격식 있는 말",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に関しては",
        "word": "坊主なので散髪に関してはお金が全くかからない。",
        "mean": "삭발이라 이발에 관해서는 돈이 전혀 들지 않는다."
      },
      {
        "answer": "に関しては",
        "word": "彼は数学以外に関しては頭がいい。",
        "mean": "그는 수학 이외에는 머리가 좋다."
      },
      {
        "answer": "に関しては",
        "word": "新しいことに挑戦することに関してはあまり抵抗もないし, 苦痛も感じない。",
        "mean": "새로운 것에 도전하는 것에 관해서는 별로 거부감도 없고 고통도 느끼지 않는다."
      },
      {
        "answer": "に関しては",
        "word": "衣食住に関しての二人の感覚が近いことは大事だと思う。",
        "mean": "의식주에 관한 두 사람의 감각이 가까운 것은 중요하다고 생각한다."
      },
      {
        "answer": "に関しては",
        "word": "育休に関しての街頭アンケートを行っております。ご協力ください。",
        "mean": "육아휴직에 관한 가두 앙케이트를 실시하고 있습니다.협조 부탁드립니다."
      },
      {
        "answer": "に関する",
        "word": "このサイトではアメリカから生の留学に関する情報を発信しています。",
        "mean": "이 사이트에서는 미국에서 생유학에 관한 정보를 발신하고 있습니다."
      },
      {
        "answer": "に関しては",
        "word": "苦手な食べ物に関しては[ 体に良いから ]と自分に言い聞かせて食べるようにしている。",
        "mean": "싫어하는 음식에 관해서는 [ 몸에 좋으니까 ]라고 자신에게 타이르고 먹도록 하고 있다."
      },
      {
        "answer": "に関しては",
        "word": "同性愛に関しては世界的に見ても徐々に理解が進んできている。",
        "mean": "동성애에 관해서는 세계적으로 봐도 서서히 이해가 진행되고 있다."
      },
      {
        "answer": "に関しましては",
        "word": "詳しい日時に関しましては, 再度連絡いたします。",
        "mean": "자세한 날짜와 시간은 다시 연락드리겠습니다."
      },
      {
        "answer": "に関しましては",
        "word": "お問い合わせに関しましては下記までご連絡下さい。",
        "mean": "문의사항에 관해서는 아래로 연락해주세요."
      }
    ]
  },
  {
    "id": 71,
    "grammar": "~に対して / に対する / に対しての",
    "means": "1. ~에 대해서, ~에게\n2. ~에 비해서, ~에 비교해서",
    "description":
        "1. 동작의 대상: 명사에만 접속.\n\n2-1. 비례: 수량을 나타내는 명사에 접속해서 비례를 나타낸다.\n\n2-2. 대비: 명사, 동사, 이 형용사, 나 형용사에 접속해서 두 사물의 대비를 나타낸다",
    "connectionWays": "동사 사전형\nい형용사 보통형＋のに対して\nな형용사 어간＋な / である＋のに対して\n명사",
    "examples": [
      {
        "answer": "に対し",
        "word": "皆さまのご支援に対し, 深く感謝申し上げます。",
        "mean": "여러분의 지원에 대해 깊은 감사를 드립니다."
      },
      {
        "answer": "に対しては",
        "word": "悪口に対しては無視するのが一番良い。",
        "mean": "나쁜 말에 대해서는 무시하는 게 제일 좋아."
      },
      {
        "answer": "に対しても",
        "word": "彼は仕事や何に対しても言い訳ばかりだ。",
        "mean": "그는 일이나 무엇에 대해서나 변명뿐이다."
      },
      {
        "answer": "に対する",
        "word": "日本の性暴力に対する刑は軽いと思う。",
        "mean": "일본의 성폭력에 대한 형은 가볍다고 생각한다."
      },
      {
        "answer": "に対して",
        "word": "今回の区議会選挙では定数30人に対して, 立候補者は60人もいた。",
        "mean": "이번 구의회 선거에서는 정수 30명에 비해 입후보자는 60명이나 됐다."
      },
      {
        "answer": "に対して",
        "word": "水100ccに対して砂糖, 塩それぞれ5g入れます。",
        "mean": "물 100cc에 설탕, 소금 각각 5g 넣어요."
      },
      {
        "answer": "に対して",
        "word": "漢字の多くは, 一つの漢字に対して複数の読み方がある。",
        "mean": "한자의 대부분은 한 한자에 대해 복수의 읽는 방법이 있다."
      },
      {
        "answer": "に対して",
        "word": "お客様1人に対して, スタッフ3人で対応致します。",
        "mean": "고객 1명에 직원 3명으로 대응해 드리겠습니다."
      },
      {
        "answer": "に対して",
        "word": "兄は成績が良いのに対して, 弟はそうでもない。",
        "mean": "형은 성적이 좋은 반면 동생은 그렇지도 않다."
      },
      {
        "answer": "に対して",
        "word": "2016年の調査によると, 健康寿命は男性が72.14歳だったのに対して, 女性は74.79際だった。",
        "mean": "2016년 조사에 따르면 건강수명은 남성이 72.14세였던 반면 여성은 74.79세였다."
      },
      {
        "answer": "に対し",
        "word": "日本海側はよく雪が降るのに対し, 太平洋側の降雪量はそれほどでもない。",
        "mean": "일본해쪽은 자주 눈이 내리는 데 비해 태평양 쪽의 강설량은 그리 많지 않다."
      },
      {
        "answer": "に対し",
        "word": "駅の北側は商業施設が密集し人々が行き交うのに対し, 南側は住宅街があり物静かな印象を受ける。",
        "mean": "역 북쪽은 상업 시설이 밀집해 사람들이 오가는 데 반해 남쪽은 주택가 있어 차분한 인상을 받는다."
      }
    ]
  },
  {
    "id": 72,
    "grammar": "~に代わって / に代わり",
    "means": "~을 대신하여 / ~을 대신할",
    "description": "누군가를 대신해서 무언가를 하는 것을 나타낸다.\n\n보통은 인물을 나타내는 명사에 접속.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に代わって",
        "word": "課長に代わって私が会議に出席します。",
        "mean": "과장님 대신 제가 회의에 참석하겠습니다."
      },
      {
        "answer": "に代わって",
        "word": "後輩に代わって尻拭いをするはめになった。",
        "mean": "후배를 대신해 뒷걸음질을 해야 했다."
      },
      {
        "answer": "に代わる",
        "word": "この仕事について, 彼に代わる人はいない。",
        "mean": "이 일에 대해 그를 대신할 사람은 없다."
      },
      {
        "answer": "に代わり",
        "word": "亡くなった母に代わり, 私が弟の面倒を見る。",
        "mean": "돌아가신 어머니 대신 내가 동생을 돌볼게."
      }
    ]
  },
  {
    "id": 73,
    "grammar": "に決まっている",
    "means": "~할 게 뻔하다, 반드시~이다, ~임에 틀림없다",
    "description":
        "화자의 자신감 넘치는 강한 판단 / 단정을 나타낸다\n\n[~に違いない, ~に相違ない] 와 같은 뜻이지만 가장 부드러운 표현은 [~に決まっている] 이다\n\n[~に相違ない ] 주로 문어체로 사용",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간\n명사",
    "examples": [
      {
        "answer": "に決まっている",
        "word": "何をするにも楽しいほうがいいに決まっている。",
        "mean": "무엇을 하든 즐거운 편이 좋은 게 분명해."
      },
      {
        "answer": "に決まっている",
        "word": "夜の病院ではお化けが出るなんて嘘に決まっている。",
        "mean": "밤 병원에서는 귀신이 나온다는 건 거짓말이 분명해."
      },
      {
        "answer": "に決まっている",
        "word": "サービス業に休みなんかない。土日も仕事に決まっている。",
        "mean": "서비스업에 쉬는 날 같은 건 없어.주말에도 일하는게 분명하다."
      },
      {
        "answer": "に決まっている",
        "word": "彼はどうせ来ないに決まっている。",
        "mean": "그는 어차피 오지 않을 게 뻔하다."
      },
      {
        "answer": "に決まっている",
        "word": "理論は間違っていないから, 成功するに決まっている。",
        "mean": "이론은 틀리지 않았으니 성공할 게 뻔하다."
      },
      {
        "answer": "に決まっている",
        "word": "無理に痩せようとすると, 身体に負担がかかるに決まっている。",
        "mean": "무리하게 살을 빼려고 하면 몸에 부담이 되기 마련이다."
      }
    ]
  },
  {
    "id": 74,
    "grammar": "~に比べて / に比べると / と比べて / と比べると",
    "means": "~에 비교해서, ~에 비해",
    "description":
        "[ Ａに比べてＢ ]は, 対立関係にあるＡとＢを対比させるときに用います。\n　[ Ａと比べてＢ ]は, ＡとＢを相互に比較するときに用います。\n　この２つのニュアンスはやや異なります。",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に比べ",
        "word": "喫煙者は通常の人に比べ, 味覚が鈍くなると言われている。",
        "mean": "흡연자는 보통 사람에 비해 입맛이 둔해진다고 한다."
      },
      {
        "answer": "に比べ",
        "word": "今年度の申し込みは前年度に比べ, およそ１．５倍に増えた。",
        "mean": "올해 신청은 전년도에 비해 무려 1.5배로 늘었다."
      },
      {
        "answer": "に比べ",
        "word": "若い頃に比べると月日の流れが早く感じるようになった。",
        "mean": "젊었을 때에 비하면 세월의 흐름이 빨리 느껴지게 되었다."
      },
      {
        "answer": "に比べ",
        "word": "入社時に比べると明らかに仕事の新鮮味が薄れてきている。",
        "mean": "입사 때에 비하면 확실히 일의 신선미가 희미해지고 있다."
      },
      {
        "answer": "に比べ",
        "word": "この曲は, 他の曲に比べ断トツに気に入っている。",
        "mean": "이 곡은 다른 곡에 비해 훨씬 마음에 든다."
      },
      {
        "answer": "と比べ",
        "word": "あの人は頭が良すぎて, 私と比べ物にならない。",
        "mean": "저 사람은 머리가 너무 좋아서 나랑 비교도 안 돼."
      },
      {
        "answer": "と比べ",
        "word": "英語は文字が２６字しかないので, 日本語と比べて初級が楽だ。",
        "mean": "영어는 글자가 26자밖에 되지 않아 일본어에 비해 초급이 편하다."
      },
      {
        "answer": "と比べ",
        "word": "彼女は周囲と比べ理想が高すぎるから結婚できないのだろう。",
        "mean": "그녀는 주위에 비해 이상이 너무 높아서 결혼할 수 없는 것이겠지."
      }
    ]
  },
  {
    "id": 75,
    "grammar": "に違いない",
    "means": "~임에 틀림 없다",
    "description":
        "어떠한 근거에 근거한 화자의 강한 판단·단정을 나타낸다.\n\n[~に決まっている, ~に相違ない] 와 같은 뜻이지만 가장 부드러운 표현은 [~に決まっている] 이다\n\n[~に相違ない ] 주로 문어체로 사용",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간\n명사",
    "examples": [
      {
        "answer": "に違いない",
        "word": "彼女の表情を見る限り, 何か秘密があるに違いない。",
        "mean": "그녀의 표정을 보는 한 뭔가 비밀이 있는 게 틀림없어."
      },
      {
        "answer": "に違いない",
        "word": "私が抱いているこの感情は, きっと彼女に対する恋心に違いない。",
        "mean": "내가 품고 있는 이 감정은 분명 그녀에 대한 연정임에 틀림없다."
      },
      {
        "answer": "に違いない",
        "word": "見た感じ, 彼は相当な手練れに違いない。",
        "mean": "보아하니 그는 상당한 솜씨임에 틀림없다."
      },
      {
        "answer": "に違いない",
        "word": "みんなが口を揃えて言うんだから, そうに違いない。",
        "mean": "모두가 입을 모아 말하니 그럴 것이 틀림없다."
      },
      {"answer": "に違いない", "word": "神はいるに違いない。", "mean": "신은 있음에 틀림없다."},
      {
        "answer": "に違いない",
        "word": "これらは何らかの陰謀に違いない。",
        "mean": "이것들은 모종의 음모임에 틀림없다."
      }
    ]
  },
  {
    "id": 76,
    "grammar": "に相違ない",
    "means": "~임에 틀림 없다",
    "description":
        "화자의 자신감 넘치는 강한 판단·단정을 나타낸다.\n\n문어체로 사용된다.\n\n[~に決まっている, ~に相違ない] 와 같은 뜻이지만 가장 부드러운 표현은 [~に決まっている] 이다\n\n[~に相違ない ] 주로 문어체로 사용",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간\n명사",
    "examples": [
      {"answer": "に相違ない", "word": "あの人が犯人に相違ない。", "mean": "저 사람이 범인임에 틀림없다."},
      {
        "answer": "に相違ない",
        "word": "どれだけ釈明したとしても, 罪を犯したことに相違ない。",
        "mean": "아무리 해명했더라도 죄를 지은 것이나 다름없다."
      },
      {
        "answer": "に相違ない",
        "word": "今回の事件と, ５年前の事件は何か深い関係があるに相違ない。",
        "mean": "이번 사건과 5년 전 사건은 뭔가 깊은 관계가 있는 게 틀림없다."
      },
      {
        "answer": "に相違ありません",
        "word": "これは先日盗まれたものに相違ありません。",
        "mean": "이것은 얼마 전 도난당한 것임에 틀림없습니다."
      },
      {
        "answer": "に相違ない",
        "word": "過去ばかり振り返っているのは, 過去に生きていることに相違ない。",
        "mean": "과거만 되돌아보고 있는 것은 과거에 살고 있는 것임에 틀림없다."
      }
    ]
  },
  {
    "id": 77,
    "grammar": "~ような / ~ように",
    "means": "~ 것 같은 / ~것 같이, 처럼",
    "connectionWays": "명사(よう) 접속형에 따름",
    "examples": [
      {
        "answer": "ようだ",
        "word": "この銅像は精巧に作られていて, まるで生きているかのようだ。",
        "mean": "이 동상은 정교하게 만들어져 마치 살아 있는 것 같다."
      },
      {
        "answer": "ような",
        "word": "まるでサウナの中にいるような天気だ。",
        "mean": "마치 사우나 안에 있는 듯한 날씨다."
      },
      {"answer": "ようだ", "word": "人生は桜のようだ。", "mean": "인생은 벚꽃 같다."},
      {
        "answer": "ような",
        "word": "数学, 物理のような計算する科目は大っ嫌いだ。",
        "mean": "수학 물리 같은 계산하는 과목은 너무 싫어."
      },
      {
        "answer": "ような",
        "word": "彼女のような美しさが欲しい。",
        "mean": "그녀와 같은 아름다움을 갖고 싶다."
      },
      {
        "answer": "ような",
        "word": "あの人のような人生は送りたくない。",
        "mean": "그 사람과 같은 삶은 살고 싶지 않아."
      },
      {
        "answer": "ようだ",
        "word": "あの人困っているようだから, ちょっと助けに行こう。",
        "mean": "저 사람 곤란한 것 같으니 좀 구하러 가자."
      },
      {"answer": "ようだ", "word": "どうやら失敗したようだ。", "mean": "아무래도 실패한 것 같다."},
      {
        "answer": "ようだ",
        "word": "父は今日仕事に行かないようだ。",
        "mean": "아버지는 오늘 일하러 가지 않으실 것 같다."
      },
      {
        "answer": "ように",
        "word": "先生が言っていたように, 今学期から授業の内容が難しくなった。",
        "mean": "선생님 말씀대로 이번 학기부터 수업 내용이 어려워졌다."
      },
      {
        "answer": "ように",
        "word": "このグラフが示すように, 日本では晩婚化が進んでいます。",
        "mean": "이 그래프가 보여주듯이 일본에서는 만혼화가 진행되고 있습니다."
      },
      {
        "answer": "ように",
        "word": "皆さんニュースでご存じのように, 今世界中で新型コロナウイルスが流行しています。",
        "mean": "여러분 뉴스에서 아시다시피 지금 전 세계에 코로나19가 유행하고 있습니다."
      },
      {
        "answer": "ように",
        "word": "以下のように, 近年Ａ国の失業率は高くなってきている。",
        "mean": "아래와 같이 최근 A국의 실업률은 높아지고 있다."
      },
      {
        "answer": "ように",
        "word": "ご存じのように, 中国は２０２０年現在, 世界で最も人口が多い国です。",
        "mean": "아시다시피 중국은 2020년 현재 세계에서 가장 인구가 많은 나라입니다."
      },
      {
        "answer": "ような",
        "word": "調査の結果, 次のような結果が得られました。",
        "mean": "조사 결과 다음과 같은 결과를 얻을 수 있었습니다."
      },
      {
        "answer": "ように",
        "word": "その態度が表しているように, 彼女はこの話に興味がないらしい。",
        "mean": "그 태도가 나타내듯이 그녀는 이 이야기에 관심이 없는 것 같다."
      },
      {"answer": "ようだ", "word": "明日は雨が降るようだ。", "mean": "내일은 비가 올 것 같다."},
      {"answer": "ようだ", "word": "向こうで事故があったようだ。", "mean": "저쪽에서 사고가 있었던 것 같아."},
      {
        "answer": "ようだ",
        "word": "猫ちゃんお腹が空いているようだったから食べ物をあげた。",
        "mean": "고양이 배고픈 것 같아서 음식 줬어."
      },
      {
        "answer": "ようだ",
        "word": "彼は私の話がつまらないようだ。",
        "mean": "그는 내 말이 재미없는 것 같아."
      },
      {
        "answer": "ような",
        "word": "北海道のような自然に恵まれたところに住んでみたい。",
        "mean": "홋카이도(北海道)와 같은 자연스러운 곳에서 살아보고 싶다."
      },
      {
        "answer": "ような",
        "word": "私は父のような堅実な人になりたい。",
        "mean": "나는 아버지처럼 건실한 사람이 되고 싶다."
      }
    ]
  },
  {
    "id": 79,
    "grammar": "~ばよかった / なければよかった",
    "means": "~했으면 좋았을 텐데, ~ 했어야 하는데 / ~ 하지 말았어야 했는데",
    "description":
        "과거의 일에 대해 그렇게 했어야 했다고 후회하는 마음을 나타낸다.\n\n상대방의 행위에 사용할 때는 그것을 비난하는 마음이 포함된다.",
    "connectionWays": "동사 가정법 (ば)＋よかった\n동사 ない형＋なければよかった",
    "examples": [
      {
        "answer": "ばよかったと思う",
        "word": "高校生の頃に一目惚れした彼に告ればよかったと思う。ずっと忘れられないでいる。",
        "mean": "고등학생 때 첫눈에 반한 그에게 고했으면 좋았을 것 같아.계속 잊지 못하고 있어."
      },
      {
        "answer": "おけばよかった",
        "word": "傘忘れた。天気予報見ておけばよかった。",
        "mean": "우산 까먹었다 일기예보 봐둘걸."
      },
      {"answer": "おけばよかった", "word": "ちゃんと調べておけばよかった。", "mean": "제대로 알아둘걸 그랬어."},
      {
        "answer": "ばよかった",
        "word": "買う前にちゃんと考えればよかった。",
        "mean": "사기 전에 제대로 생각할 걸 그랬어."
      },
      {
        "answer": "こなければよかった",
        "word": "私なんて生まれてこなければよかった。",
        "mean": "나 같은 건 태어나지 말았어야 했어."
      },
      {
        "answer": "なければよかった",
        "word": "二度寝しなければよかった。",
        "mean": "두 번 자지 말았어야 했어."
      },
      {
        "answer": "なければよかったのに",
        "word": "感情がなければよかったのにと思う。",
        "mean": "감정이 없었으면 좋았을 텐데."
      },
      {
        "answer": "ばよかった",
        "word": "いつでも女らしさを求められ, 女じゃなければよかったと感じる。",
        "mean": "언제나 여성스러움을 요구받고 여자가 아니었으면 좋겠다고 느낀다."
      }
    ]
  },
  {
    "id": 80,
    "grammar": "~ばいい / なければいい",
    "means": "~면 된다 / ~ 안하면 된다",
    "description":
        "1. 상대방에 대한 제안이나 권유\n기본적으로는 제안이나 권유를 나타내지만 경우에 따라서는 [마음대로 하면 돼] 처럼 방임의 의미를 갖기도 한다.\n\n2. 화자의 소망 표현\n종조사 [な, ね] 등을 동반하여 상황이 원하는 쪽으로 향하기를 바라는 화자의 마음을 나타낸다.",
    "connectionWays": "동사 가정법 (ば)＋いい\n동사 ない형＋なければいい",
    "examples": [
      {
        "answer": "ばいい",
        "word": "困ったときは誰かに相談に乗ってもらえばいい。",
        "mean": "곤란할 때는 누군가에게 상담을 받으면 된다."
      },
      {
        "answer": "ばいい",
        "word": "私が皆さんの何か役に立てばいいなと思って来ました。",
        "mean": "제가 여러분에게 뭔가 도움이 됐으면 좋겠다는 생각으로 왔습니다."
      },
      {
        "answer": "なければいいん",
        "word": "明日も寒いのかな。寒暖差がなければいいんだけど。",
        "mean": "내일도 추울까?일교차가 없었으면 좋겠는데."
      },
      {
        "answer": "ばいいか",
        "word": "頑張れと言われても, どう頑張ればいいか分からない。",
        "mean": "힘내라고 해도 어떻게 노력해야 할지 모르겠어."
      },
      {
        "answer": "ばいいのに",
        "word": "この世界, 壊れちゃえばいいのに。",
        "mean": "이 세상 망가지면 좋을 텐데."
      },
      {
        "answer": "ばいいけど",
        "word": "腹痛収まればいいけど, もしこのままだったら仕事にも行けない。",
        "mean": "복통이 가라앉으면 좋겠지만, 만약 이대로라면 일하러 갈 수도 없어."
      },
      {
        "answer": "すればいいの",
        "word": "コロナで外出禁止とかになったらどうすればいいの？",
        "mean": "코로나 때문에 외출금지 같은 거 되면 어떻게 해야 돼?"
      }
    ]
  },
  {
    "id": 81,
    "grammar": "~ば~ほど",
    "means": "~면 ~ 수록",
    "description":
        "어떤 두 가지 사물이 동시에 변화하는 것을 나타내는 문법\n\n앞 내용이 변화함에 따라 뒷 내용도 그와 함께 변화해 가는 것을 나타낸다.",
    "connectionWays": "가정법 ば형",
    "examples": [
      {
        "answer": "ほど",
        "word": "考えれば考えるほど訳が分からなくなる。",
        "mean": "생각하면 할수록 영문을 알 수 없게 된다."
      },
      {
        "answer": "ほど",
        "word": "駅から近ければ近いほど家賃は高くなります。",
        "mean": "역에서 가까울수록 집세는 비싸집니다."
      },
      {
        "answer": "ほど",
        "word": "本気であればあるほど, 失敗したときのリスクは高い。",
        "mean": "진심일수록 실패했을 때의 위험은 높다."
      },
      {
        "answer": "ほど",
        "word": "周囲に反対されればされるほど恋は燃える。",
        "mean": "주위의 반대를 받을수록 사랑은 불타오른다."
      },
      {"answer": "ほど", "word": "噛めば噛むほど味が出る。", "mean": "씹을수록 맛이 난다."},
      {"answer": "ほど", "word": "目標は明確であればあるほどいい。", "mean": "목표는 명확할수록 좋다."},
      {
        "answer": "ほど",
        "word": "逃げれば逃げるほど, 問題は大きくなっていく。",
        "mean": "도망칠수록 문제는 커진다."
      },
      {
        "answer": "ほど",
        "word": "自由であればあるほど責任も増すものだ。",
        "mean": "자유로울수록 책임도 커지는 법이다."
      },
      {
        "answer": "ほど",
        "word": "何でも練習すればするほど上手になる。",
        "mean": "뭐든지 연습하면 할수록 잘하게 된다."
      },
      {
        "answer": "だけ",
        "word": "富裕層であればあるだけ, 投資を重視している。",
        "mean": "부유층일수록 투자를 중시하고 있다."
      },
      {
        "answer": "だけ",
        "word": "言い訳すればするだけ怪しく思えてくる。",
        "mean": "변명하면 할수록 수상하게 느껴진다."
      },
      {
        "answer": "ほど",
        "word": "今日は暑いので, 飲み物は冷たければ冷たいほど良い。",
        "mean": "오늘은 더우니까 음료는 차가울수록 좋아."
      }
    ]
  },
  {
    "id": 83,
    "grammar": "~前に / 前で",
    "means": "~하기 전에",
    "description":
        "1. 동사나 동작을 나타내는 명사에 붙으면, 앞 내용의 동작을 실시하기 전에 뒷 내용의 동작을 행하는 것을 나타낸다\n\n앞 내용에 제약은 없지만, 뒷 내용은 의지동사만 접속할 수 있다.\n\n2. 공간이나 시간을 나타내는 명사에 붙으면 물리적, 시간적 위치 관계의 전방을 나타낸다",
    "connectionWays": "명사 ＋の前に\n동사 사전형＋前に\n시간명사＋前に",
    "examples": [
      {
        "answer": "前に",
        "word": "雨が強くなる前に家に帰りたい。",
        "mean": "비가 세지기 전에 집에 가고 싶다."
      },
      {"answer": "前に", "word": "寝る前に歯を磨く。", "mean": "자기 전에 이를 닦다."},
      {
        "answer": "前に",
        "word": "死ぬ前に一度は美女たちに囲まれてみたい。",
        "mean": "죽기 전에 한 번쯤 미녀들에게 둘러싸여 보고 싶어."
      },
      {"answer": "前に", "word": "出発前に荷物の確認をする。", "mean": "출발 전에 짐 확인을 하다."},
      {
        "answer": "前に",
        "word": "卒業する前に友達と卒業旅行に行きたい。",
        "mean": "졸업하기 전에 친구들과 졸업여행을 가고 싶어."
      },
      {
        "answer": "前に",
        "word": "数日前に降った雪がまだ残っている。",
        "mean": "며칠 전에 내린 눈이 아직 남아 있다."
      },
      {"answer": "前に", "word": "駅前に商業施設ができるらしい。", "mean": "역전에 상업시설이 생긴대."},
      {"answer": "前で", "word": "目の前で事故が起きた。", "mean": "눈앞에서 사고가 났다."}
    ]
  },
  {
    "id": 84,
    "grammar": "~みたいだ / みたいに / みたいな",
    "means": "~것 같다 / ~ 같이 / ~같은",
    "description": "みないな ~것 같은 (ような의 회화체)\n\nみたいに ~것 같이, ~처럼 (ように의 회화체)",
    "connectionWays": "동사 사전형＋みたいだ\nい형용사 보통형＋みたいだ\nな형용사 어간＋みたいだ\n명사＋みたいだ　",
    "examples": [
      {
        "answer": "みたいな",
        "word": "葬式みたいな話は聞きたくない。",
        "mean": "장례식 같은 얘기는 듣고 싶지 않아."
      },
      {"answer": "みたいに", "word": "彼の鼻はバナナみたいに長い。", "mean": "그의 코는 바나나처럼 길다."},
      {"answer": "みたいな", "word": "彼女は太陽みたいな人だ。", "mean": "그녀는 태양 같은 사람이다."},
      {
        "answer": "みたいな",
        "word": "最近は子供みたいな大人が増えている。",
        "mean": "요즘은 어린애 같은 어른들이 늘고 있어."
      },
      {
        "answer": "みたいな",
        "word": "毎日ゴミみたいな生活をしている。",
        "mean": "매일 쓰레기 같은 생활을 하고 있다."
      },
      {
        "answer": "みたいな",
        "word": "兄みたいな人にはなりたくない。",
        "mean": "형 같은 사람이 되고 싶지 않아."
      },
      {
        "answer": "みたいに",
        "word": "あの人みたいに日本語を流暢に話せるようになりたい。",
        "mean": "그 사람처럼 일본어를 유창하게 할 수 있게 되고 싶어."
      },
      {
        "answer": "みたいに",
        "word": "今年の誕生日も, 去年みたいに盛大に祝ってほしい。",
        "mean": "올해 생일도 작년처럼 성대하게 축하해줬으면 좋겠어."
      },
      {
        "answer": "みたいな",
        "word": "チョコレートみたいな甘い物は食べると気持ち悪くなる。",
        "mean": "초콜릿 같은 단 음식은 먹으면 징그러워져."
      },
      {
        "answer": "みたいな",
        "word": "数日前から風邪みたいな症状が続いている。",
        "mean": "며칠 전부터 감기 같은 증상이 계속되고 있다."
      },
      {
        "answer": "みたいだ",
        "word": "あそこのお店はいつも行列ができていて, どうやら人気があるみたいだ。",
        "mean": "저기 가게는 항상 줄이 서 있어서 아무래도 인기가 많은 것 같아."
      },
      {
        "answer": "みたいだ",
        "word": "彼は舌打ちが癖になっているみたいだ。",
        "mean": "그는 혀를 차는 데 습관이 된 것 같다."
      },
      {
        "answer": "みたいです",
        "word": "道が濡れてるし, 雨が降ったみたいです。",
        "mean": "길이 젖어있고 비가 왔나봐요."
      },
      {"answer": "みたいだ", "word": "あの二人は結婚したみたいだ。", "mean": "저 둘은 결혼했나 봐."},
      {
        "answer": "みたいだ",
        "word": "うちの猫ちゃんは私がいないと寂しいみたいだ。",
        "mean": "우리집 고양이는 내가 없으면 외로운가봐."
      }
    ]
  },
  {
    "id": 85,
    "grammar": "たいものだ",
    "means": "~하고 싶다",
    "description":
        "원래 실현 불가능 혹은 실현 곤란한 것에 대한 강한 열망이나 기대를 나타낸다.\n\n또한 그 소망은 이전부터 오랜 시간 품고 있는 경우가 많다.",
    "connectionWays": "동사 ます형 접속",
    "examples": [
      {
        "answer": "たいものだ",
        "word": "普通と言われる人生を送る人間なんて, 一人としていやしない。いたらお目にかかりたいものだ。",
        "mean": "보통이라고 불리는 인생을 사는 사람은, 혼자도 싫어하지 않는다.있으면 뵙고 싶은 것이다."
      },
      {
        "answer": "たいものだね",
        "word": "こんな寒いときはお布団被って二度寝したいものだね。",
        "mean": "이렇게 추울 때 이불 덮고 두 번 자고 싶구나."
      },
      {
        "answer": "たいものだ",
        "word": "休みの日くらいぐっすり寝てたいものだ。",
        "mean": "쉬는 날쯤 푹 자고 싶다."
      },
      {
        "answer": "たいものだ",
        "word": "いつでも人は, 意思決定を先延ばししたいものだ。",
        "mean": "언제든지 사람은 의사결정을 미루고 싶어한다."
      },
      {
        "answer": "たいものです",
        "word": "彼とはできればこれからも仲良くしていたいものです。",
        "mean": "그와는 가능하다면 앞으로도 사이좋게 지내고 싶습니다."
      }
    ]
  },
  {
    "id": 86,
    "grammar": "たものだ",
    "means": "~하곤 했다",
    "description":
        "과거의 일을 떠올리며 감회가 깊은 모습을 나타낸다\n\n추억에 젖거나 그리워하는 듯한 느낌을 강하게 나타낼 수 있.\n[たもんだ] 회와체",
    "connectionWays": "동사 과거형",
    "examples": [
      {
        "answer": "だものだ",
        "word": "子どもの頃はよく川で泳いだものだ。",
        "mean": "어렸을 때는 강에서 수영하곤 했다."
      },
      {
        "answer": "たものだ",
        "word": "高校時代の先生にはよく遅刻して怒られたものだ。",
        "mean": "고등학교 때 선생님한테는 지각을 많이 해서 혼나곤 했다."
      },
      {
        "answer": "もんだ",
        "word": "学生時代は授業サボってよく遊びにいったもんだ。",
        "mean": "학창시절에는 수업 빼먹고 자주 놀러가곤 했어."
      },
      {
        "answer": "もんだ",
        "word": "母親からは部屋片づけなさいとよく言われたもんだ。",
        "mean": "엄마가 방 치우라는 소리를 많이 듣곤 했어."
      },
      {
        "answer": "もんだ",
        "word": "彼とは昔よくケンカしたもんだ。",
        "mean": "그와는 옛날에 자주 싸우곤 했지."
      },
      {
        "answer": "たものだ",
        "word": "母と喧嘩してよく家出したものだ。",
        "mean": "엄마랑 싸워서 집을 잘 나가곤 했어."
      },
      {
        "answer": "たものだ",
        "word": "若い時はよく徹夜したものだが, 今はもうそういう気力もない。",
        "mean": "젊었을 때는 밤을 새곤 했는데 이젠 그럴 기운도 없다."
      },
      {
        "answer": "たものだ",
        "word": "学生の頃はよくアルバイトで稼いだお金で遠くまで旅行しにいったものだ。",
        "mean": "학창시절에는 아르바이트로 번 돈으로 멀리 여행을 가곤 했다."
      }
    ]
  },
  {
    "id": 87,
    "grammar": "동사 사전형 + ものだ",
    "means": "~하는 법이다",
    "description":
        "본래 그렇다고 생각된다을 나타낸다.\n\n사물의 본래 성질이나 경향 등을 나타내다\n\n사회적 상식으로 그렇게 해야 한다고 말하고 싶을 때 쓰는 표현.",
    "connectionWays": "동사 사전형\n동사 ない형\nい형용사 보통형\nな형용사 어간 + な",
    "examples": [
      {
        "answer": "ものです",
        "word": "たくさん運動したら疲れるものです。",
        "mean": "운동을 많이 하면 피곤한 법이에요."
      },
      {
        "answer": "ものです",
        "word": "人は疲れたら, 眠くなるものです。",
        "mean": "사람은 피곤하면 졸리기 마련입니다."
      },
      {
        "answer": "ものです",
        "word": "誰でも, 残業はいやなものです。",
        "mean": "누구나 야근은 싫은 법이에요."
      },
      {
        "answer": "ものだ",
        "word": "人は誰でも間違いをするものだ。",
        "mean": "사람은 누구나 실수를 하는 법이다."
      },
      {
        "answer": "ものです",
        "word": "人は誰でも失敗するものです。",
        "mean": "사람은 누구나 실패하는 법입니다."
      },
      {
        "answer": "ものです",
        "word": "地震の時は誰でも慌てるものです。",
        "mean": "지진 때는 누구나 당황하게 마련입니다."
      },
      {
        "answer": "ものです",
        "word": "プレゼンテーションの前は誰でも緊張するものです。",
        "mean": "프레젠테이션 전에는 누구나 긴장하기 마련입니다."
      },
      {
        "answer": "ものだ",
        "word": "赤ちゃんはよく泣くものだから, ちょっとうるさいぐらいで, イライラしてはならない。",
        "mean": "아기는 잘 우는 법이니까 좀 시끄러울 정도로 짜증을 내면 안 된다."
      },
      {
        "answer": "ものだ",
        "word": "人は見かけではわからないものだ。",
        "mean": "사람은 겉모습으로는 모르는 법이다."
      },
      {
        "answer": "ものです",
        "word": "留学すると, 誰でも一度はホームシックを経験するものです。",
        "mean": "유학을 가면 누구나 한 번쯤 향수병을 경험하게 마련입니다."
      },
      {
        "answer": "ものだ",
        "word": "若い人はお年寄りに席を譲るものだ。",
        "mean": "젊은 사람은 노인에게 자리를 양보하기 마련이다."
      },
      {
        "answer": "ものだ",
        "word": "お年寄りには優しくするものだ。",
        "mean": "노인에게는 상냥하게 대하기 마련이다."
      },
      {"answer": "もんだよ", "word": "子供は早く寝るもんだよ。", "mean": "애들은 일찍 자는 거야."},
      {"answer": "ものだ", "word": "上司には敬語を使うものだ。", "mean": "상사에게는 존댓말을 쓰는 법이다."},
      {
        "answer": "もんだよ",
        "word": "お金は大切にするもんだよ。無駄遣いばかりしてはいけないよ。",
        "mean": "돈은 아끼는 거야.낭비만 하면 안 돼."
      },
      {
        "answer": "ものだ",
        "word": "話するときは, 相手の目を見て話すものだ。",
        "mean": "말할 때는 상대방의 눈을 보고 이야기하는 것이다."
      },
      {"answer": "ものじゃない", "word": "人の悪口は言うものじゃない。", "mean": "남의 험담은 하는게 아니야."},
      {
        "answer": "もんじゃないよ",
        "word": "知らない人を簡単に信じるもんじゃないよ。",
        "mean": "모르는 사람을 쉽게 믿는 게 아니야."
      },
      {
        "answer": "もんじゃないよ",
        "word": "不必要なものをなんでも買うもんじゃないよ。",
        "mean": "불필요한 걸 아무거나 사는 게 아니야."
      }
    ]
  },
  {
    "id": 88,
    "grammar": "~ように / ~ ないように",
    "means": "~하도록 / ~하지 않도록",
    "description":
        "목적을 나타내는 표현으로, 무의지 동사 (聞こえる, 見える, わかる)나, 가능형 동사에 자주 활용됩니다. ",
    "examples": [
      {
        "answer": "ように",
        "word": "皆さまに楽しんでいただけるように頑張ります。",
        "mean": "여러분이 즐기실 수 있도록 노력하겠습니다."
      },
      {
        "answer": "ないように",
        "word": "寝坊しないように早めにおやすみなさい。",
        "mean": "늦잠을 자지 않도록 일찍 주무세요."
      },
      {
        "answer": "よう",
        "word": "この服が似合う人になれるよう痩せなきゃ。",
        "mean": "이 옷이 어울리는 사람이 되도록 살을 빼야지."
      },
      {
        "answer": "ないように",
        "word": "体調を崩さないように皆さん気をつけて下さい。",
        "mean": "아프지 않게 다들 조심하시고요."
      },
      {
        "answer": "ないように",
        "word": "ちょっとした不注意で怪我しないようにしてください。",
        "mean": "사소한 부주의로 다치지 않도록 하세요."
      },
      {
        "answer": "ないように",
        "word": "お腹冷えないように気をつけてください。",
        "mean": "배 시리지 않게 조심하세요."
      },
      {
        "answer": "ように",
        "word": "みんなに聞こえるように大きい声で話してください。",
        "mean": "모두에게 들릴 수 있게 큰 소리로 말해주세요."
      },
      {"answer": "ように", "word": "可愛くなれるように努力する。", "mean": "귀여울 수 있도록 노력할게."},
      {
        "answer": "よう",
        "word": "皆様の支えに少しでもなれるよう頑張ります。",
        "mean": "여러분의 버팀목이 될 수 있도록 노력하겠습니다."
      },
      {
        "answer": "よう",
        "word": "忘れ物をしないよう注意してください。",
        "mean": "분실물을 남기지 않도록 주의해 주세요."
      },
      {"answer": "ように", "word": "明日のテスト, うまくいきますように。", "mean": "내일 시험 잘 보세요."},
      {"answer": "ように", "word": "病気が治りますように。", "mean": "병이 나으시길 바랍니다."},
      {"answer": "ように", "word": "明日いい天気になりますように。", "mean": "내일 좋은 날씨 되세요."},
      {
        "answer": "ように",
        "word": "第一志望の大学に合格できるように神社でお祈りをした。",
        "mean": "제1지망 대학에 합격할 수 있도록 신사에서 기도를 했다."
      }
    ]
  },
  {
    "id": 89,
    "grammar": "~ようにする / ないようにする",
    "means": "~하도록 하다, ~하도록 하고 있다",
    "description":
        "어느 목적을 달성하기 위해 노력하는 것을 표현.\n[~ようにしている / ~ないようにしている] 형태는 목적을 달성하기 위해 계속적으로 노력하고 있는 것, 즉 습관이 되어있는 것을 나타낸다",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "ようにします",
        "word": "今は手が離せませんが, 終わり次第できるだけ早く着くようにします。",
        "mean": "지금은 손을 뗄 수 없지만 끝나는 대로 최대한 빨리 도착하도록 하겠습니다."
      },
      {
        "answer": "しないようにしている",
        "word": "期待すると失望するから, 初めから期待しないようにしている。",
        "mean": "기대하면 실망하기 때문에 아예 기대하지 않으려고 한다."
      },
      {
        "answer": "ようにしたい",
        "word": "来年はロリ系の服買って着たい。髪型とかもそれに似合うようにしたい。",
        "mean": "내년에는 롤리 계열 옷 사 입고 싶어.헤어스타일 같은 것도 거기에 어울리게 하고 싶어."
      },
      {
        "answer": "しないようにしてね",
        "word": "辛かったら無理しないようにしてね。",
        "mean": "힘들면 무리하지 않도록 해."
      },
      {
        "answer": "ようにしている",
        "word": "デートの最後は『次はいつ会う？』って話を必ずするようにしている。",
        "mean": "데이트 마지막에는 '다음엔 언제 만날래?'라는 말을 꼭 하도록 하고 있다."
      },
      {
        "answer": "ようにしている",
        "word": "リラックスしているときは良いアイディアが浮かびやすい。思い付いたらすぐメモするようにしている。",
        "mean": "편안할 때는 좋은 아이디어가 떠오르기 쉽다.생각나는 대로 메모하도록 하고 있다."
      },
      {
        "answer": "ないようにする",
        "word": "周りに迷惑が掛からないようにする。",
        "mean": "주위에 폐가 되지 않도록 하다."
      },
      {
        "answer": "しないようにしている",
        "word": "失敗はしても後悔はしないようにしている。",
        "mean": "실패는 해도 후회는 하지 않으려고 한다."
      }
    ]
  },
  {
    "id": 90,
    "grammar": "~ようになる / ないようになる",
    "means": "~하기 되다, ~하지 않게 되다",
    "description": "능력적·상황적으로 불가능했던 일들이 실현 가능해졌음을 나타낸다.",
    "connectionWays": "동사 사전형\n동사 ない형",
    "examples": [
      {
        "answer": "ようになる",
        "word": "国民一人ひとりが政治に関心を持つようになると国は変わる。",
        "mean": "국민 개개인이 정치에 관심을 갖게 되면 나라는 달라진다."
      },
      {
        "answer": "ようになる",
        "word": "できるようになると楽しいが, そこまでの道のりは長く辛い。",
        "mean": "할 수 있게 되면 즐겁지만 거기까지 가는 길은 길고 힘들다."
      },
      {
        "answer": "ようになる",
        "word": "運転できるようになるのが今年の目標。",
        "mean": "운전할 수 있게 되는 것이 올해 목표."
      },
      {
        "answer": "ようになる",
        "word": "ハゲないようになる薬を早く開発してほしい。",
        "mean": "대머리 없게 되는 약을 빨리 개발했으면 좋겠다."
      },
      {
        "answer": "ようになった",
        "word": "自分の未来について少しだけ前向きに考えられるようになった。",
        "mean": "나의 미래에 대해 조금만 긍정적으로 생각할 수 있게 되었다."
      },
      {
        "answer": "ようになった",
        "word": "近所のコンビニの店員さんが顔を覚えてくれて, 毎回一言二言喋るようになった。",
        "mean": "근처 편의점 점원이 얼굴을 기억해줘서 매번 한두 마디 지껄이기 시작했다."
      },
      {
        "answer": "ようになって",
        "word": "うちの猫昔はあちこちでウンチしてたのに, 今はちゃんとトイレでするようになってくれた。",
        "mean": "우리 고양이 옛날에는 여기저기서 똥 싸다가 이제는 제대로 화장실에서 하게 돼줬어."
      },
      {
        "answer": "ようになって",
        "word": "ここから先は, ログインしないと閲覧できないようになっている。",
        "mean": "여기서부터는 로그인하지 않으면 열람할 수 없게 되어 있다."
      }
    ]
  },
  {
    "id": 95,
    "grammar": "~をきっかけにして / がきっかけで / がきっかけになって",
    "means": "~을 계기로",
    "description":
        "새로운 일이 시작되는 그 기점을 나타낸다. \n\n앞 문장에는 그 기점, 뒷 문장에는 그 후의 행위를 서술함\n\n[~を機に / を契機に] 로 바꿀 수 있는데, 이 표현은 다소 딱딱한 표현.\n\n앞 문장과 뒷 문장이 같은 행위일 때 이 문형은 사용할 수 없다\n\n앞 문장과 뒷 문장은 전혀 다른 행위를 말하고, 앞 문장이 기회나 동기가 되어 뒷 문장을 한다고 할 때 사용할 수 있다\n\n大阪への旅行をきっかけに, 京都にも旅行した。 (불가능).",
    "connectionWays": "명사 접속 형태를 따름",
    "examples": [
      {
        "answer": "をきっかけに",
        "word": "結婚をきっかけに新居を買った。",
        "mean": "결혼을 계기로 신혼집을 샀다."
      },
      {
        "answer": "をきっかけに",
        "word": "失恋をきっかけに髪をばっさり切った。",
        "mean": "실연을 계기로 머리를 싹둑 잘랐다."
      },
      {
        "answer": "をきっかけに",
        "word": "出産・育児をきっかけに離職する女性が増えているという。",
        "mean": "출산·육아를 계기로 이직하는 여성이 늘고 있다고 한다."
      },
      {
        "answer": "きっかけ",
        "word": "彼はこのドラマがきっかけとなって一躍有名となった。",
        "mean": "그는 이 드라마가 계기가 되어 일약 유명해졌다."
      },
      {
        "answer": "きっかけ",
        "word": "先生のある一言がきっかけで生きる道が変わった。",
        "mean": "선생님의 어떤 말 한마디가 계기가 되어 사는 길이 바뀌었다."
      },
      {
        "answer": "きっかけ",
        "word": "留学生と友達になったことがきっかけで, 外国に興味を持つようになった。",
        "mean": "유학생과 친구가 된 것을 계기로 외국에 흥미를 가지게 되었다."
      },
      {
        "answer": "きっかけ",
        "word": "共通の趣味がきっかけで付き合い始めた。",
        "mean": "공통의 취미가 계기가 되어 사귀기 시작했다."
      },
      {
        "answer": "きっかけ",
        "word": "どうでもいいことがきっかけで大きな喧嘩に発展した。",
        "mean": "아무래도 좋은 일이 계기가 되어 큰 싸움으로 발전했다."
      }
    ]
  },
  {
    "id": 96,
    "grammar": "~を通じて(つうじて) / を通して(とおして)",
    "means": "1.~내내\n2.~을 통해서",
    "description": "1.기간\n2.중개, 수단",
    "connectionWays": "명사에 직접 접속\n동사 사전형",
    "examples": [
      {
        "answer": "を通じて",
        "word": "SNSなどを通じて見知らぬ人に会うことはしばしば危険を伴う。",
        "mean": "SNS 등을 통해 낯선 사람을 만나는 것은 종종 위험을 수반한다."
      },
      {
        "answer": "を通して",
        "word": "この辺りは１年を通して温暖な気候だ。",
        "mean": "이 근처는 일년 내내 온난한 기후다."
      },
      {
        "answer": "を通じて",
        "word": "親は子供を通じて人生の多くを学ぶ。",
        "mean": "부모는 자녀를 통해 인생의 많은 부분을 배운다."
      },
      {
        "answer": "を通じて",
        "word": "新元号が発表される瞬間はテレビを通じて見ました。",
        "mean": "신원호가 발표되는 순간은 TV를 통해 보았습니다."
      },
      {
        "answer": "を通して",
        "word": "スポーツを通して心身の成長を図る。",
        "mean": "스포츠를 통해 심신의 성장을 도모하다."
      },
      {
        "answer": "を通して",
        "word": "将来は自分の演技を通して観客の心を動かしたいと思っています。",
        "mean": "장래에는 제 연기를 통해 관객의 마음을 움직이고 싶습니다."
      },
      {
        "answer": "を通して",
        "word": "子供は失敗することを通して様々なことを学んでいく。",
        "mean": "아이는 실패를 통해 다양한 것을 배워간다."
      },
      {
        "answer": "を通して",
        "word": "ボランティア活動を通して現地の人々とつながることができた。",
        "mean": "봉사활동을 통해 현지인들과 연결될 수 있었다."
      }
    ]
  },
  {
    "id": 97,
    "grammar": "わけ",
    "means": "~한 셈이다 (많은 용법이 존재함)",
    "description":
        "①이유\n\n②결론·사실을 강조하여 말하다\n\n③바꾸어 말하면, 요약 : [つまり, 要するに] 와 자주 호응함\n\n④납득·이해 : [どうりで, だから, それで, なるほど] 등과 자주 호흥함",
    "connectionWays":
        "동사 사전형＋(という)わけ\nい형용사 보통형＋(という)わけ\nな형용사 어간＋な / である / という＋わけ\n명사＋な / である / という＋わけ",
    "examples": [
      {
        "answer": "わけだから",
        "word": "今日は子どもの誕生日なんです。そういうわけだから私先に帰らせてください。",
        "mean": "오늘 아이 생일이거든요.그러니 저 먼저 돌아가게 해주세요."
      },
      {
        "answer": "わけだから",
        "word": "双子は生まれる前からずっと一緒にいたわけだから, 心が通じ合っているのも当然だ。",
        "mean": "쌍둥이는 태어나기 전부터 줄곧 함께 했으니 마음이 통하는 것도 당연하다."
      },
      {
        "answer": "わけだ",
        "word": "この映画は, 人々が主人公に共感できるから人気になったわけだ。",
        "mean": "이 영화는 사람들이 주인공에게 공감할 수 있기 때문에 인기가 높아진 셈이다."
      },
      {
        "answer": "わけだから",
        "word": "人間は視覚から得る情報量が最も多いわけだから, 身だしなみを整えることで第一印象を良くすることができる。",
        "mean": "인간은 시각에서 얻는 정보량이 가장 많기 때문에 몸가짐을 가다듬음으로써 첫인상을 좋게 할 수 있다."
      },
      {
        "answer": "わけだが",
        "word": "数年ぶりに地元へ帰って来たわけだが, 昔のまま何一つ変わっていなかった。",
        "mean": "몇 년 만에 고향으로 돌아온 셈인데 옛날 그대로 아무것도 달라진 게 없었다."
      },
      {
        "answer": "わけだが",
        "word": "大学４年生になったわけだが単位足りなくて卒業できなさそう。",
        "mean": "대학교 4학년이 되었는데 학점이 부족해서 졸업을 못할것 같아."
      },
      {
        "answer": "わけだけ",
        "word": "明日から夏休みなわけだけど何か予定とかあるの？",
        "mean": "내일부터 여름방학인데 무슨 계획 있어?"
      },
      {
        "answer": "なわけである",
        "word": "別れは出会いの始まり。終わりは始まりなわけである。",
        "mean": "이별은 만남의 시작.끝은 시작인 셈이다."
      },
      {
        "answer": "なわけだ",
        "word": "距離が近くなるほど, 長く一緒にいるほど素が出てくる。つまりそれが本性なわけだ。",
        "mean": "거리가 가까워질수록, 오래 함께 있을수록 소가 나온다.즉 그것이 본성인 셈이다."
      },
      {
        "answer": "わけだ",
        "word": "人は潜在意識に支配されている。つまり人の動機は潜在意識にあるわけだ。",
        "mean": "사람은 잠재의식에 지배되고 있다.즉 사람의 동기는 잠재의식에 있는 셈이다."
      },
      {
        "answer": "わけだ",
        "word": "窓を開けて寝ていた。どうりで寒いわけだ。",
        "mean": "창문을 열고 자고 있었다.어쩐지 추운 셈이다."
      },
      {
        "answer": "わけだ",
        "word": "彼とは趣味が同じだった。なるほど, だから気も合うし話も合うわけだ。",
        "mean": "그와는 취미가 같았다.그렇구나 그러니까 마음도 맞고 얘기도 맞는거지."
      },
      {
        "answer": "わけだ",
        "word": "人は後悔することができる。だから悩むわけだ。",
        "mean": "사람은 후회할 수 있다.그러니까 고민하는 거야."
      },
      {
        "answer": "わけか",
        "word": "内通者がいたから, それでこちらの情報が向こうに筒抜けだったわけか。",
        "mean": "내통자가 있었기 때문에, 그래서 이쪽의 정보가 저쪽에 빠진 것인가."
      }
    ]
  },
  {
    "id": 98,
    "grammar": "わけではない",
    "means": "~인 것은 아니다\r",
    "description":
        "부정을 표하지만 완전한 부정이 아니라 일부 예외의 존재나 허용할 수 있는 부분이 있음을 암시한다.\n\n그렇기 때문에 앞 내용, 뒷 내용에는 [ しかし, ~だが, だからといって ] 등의 역접을 나타내는 말을 사용함.\n\n‘항상 그렇다고는 할 수 없다’ \n\n필연적인 결과를 부정하는 표현.",
    "connectionWays":
        "동사 사전형＋(という)わけではない\nい형용사 보통형＋(という)わけではない\nな형용사 어간＋な / である / という＋わけではない\n명사＋な / である / という＋わけではない",
    "examples": [
      {
        "answer": "わけではないが",
        "word": "太っているわけではないが, 痩せているわけでもない。",
        "mean": "뚱뚱한 것은 아니지만 마른 것도 아니다."
      },
      {
        "answer": "わけではないが",
        "word": "眠くないわけではないが, 寝られない。",
        "mean": "졸리지는 않지만 잘 수가 없어."
      },
      {
        "answer": "というわけではない",
        "word": "マスクをしているからといって, 絶対に感染しないというわけではない。",
        "mean": "마스크를 쓴다고 해서 절대 감염되지 않는다는 것은 아니다."
      },
      {
        "answer": "わけじゃないが",
        "word": "犬は喋れるわけじゃないが, 人と心を通わせることができる。",
        "mean": "개는 말할 수 없지만 사람과 마음을 통하게 할 수 있다."
      },
      {
        "answer": "というわけじゃないけど",
        "word": "旅行好きというわけじゃないけど, 一人でドライブして遠くに行くのは好きだ。",
        "mean": "여행을 좋아하는 건 아니지만 혼자 드라이브하고 멀리 가는 건 좋아해."
      },
      {
        "answer": "というわけではないが",
        "word": "負の感情を抱くことが悪いというわけではないが, それを口に出したら悪口になって人をより傷つけてしまう。",
        "mean":
            "부정적인 감정을 품는 것이 나쁘다는 것은 아니지만, 그것을 입 밖에 내면 욕이 되어 사람에게 더 상처를 주고 만다."
      },
      {
        "answer": "わけじゃないが",
        "word": "激痛というわけじゃないが, 横腹が少し痛くて気になる。",
        "mean": "극심한 통증은 아니지만 옆구리가 조금 아프고 신경이 쓰인다."
      },
      {
        "answer": "わけではない",
        "word": "今日あることが明日も必ずあるわけではない。",
        "mean": "오늘 있는 일이 내일도 꼭 있는 것은 아니다."
      }
    ]
  },
  {
    "id": 99,
    "grammar": "~わけ(が)ない / わけ(は)ない",
    "means": "절대 ~그럴 리 없다",
    "description": "화자의 주관을 동반한 강한 부정을 나타낸다.\n\n[はずがない]로 바꿔 쓸 수 있음",
    "connectionWays": "동사 사전형\nい형용사 보통형\nな형용사 어간＋な / である\n명사＋な / である",
    "examples": [
      {
        "answer": "わけがない",
        "word": "俺の妹がこんなに可愛いわけがない",
        "mean": "내 여동생이 이렇게 귀여울 리가 없어"
      },
      {
        "answer": "わけがない",
        "word": "叱られた経験のない人間が, 部下を叱れるわけがない。",
        "mean": "꾸중을 들어본 경험이 없는 사람이 부하를 혼낼 리가 없다."
      },
      {"answer": "わけがない", "word": "英語なんて分かるわけがない。", "mean": "영어를 어떻게 알아."},
      {
        "answer": "わけがない",
        "word": "こんなうるさい環境で集中なんてできるわけがない。",
        "mean": "이런 시끄러운 환경에서 집중을 할 수 있을 리가 없어."
      },
      {
        "answer": "わけがない",
        "word": "揚げたてのドーナツが美味しくないわけがない。",
        "mean": "갓 튀긴 도넛이 맛이 없을 수가 없지."
      },
      {
        "answer": "わけがない",
        "word": "こんな量の宿題, 一晩で終わるわけがない。",
        "mean": "이런 양의 숙제가 하룻밤 사이에 끝날 리가 없다."
      },
      {"answer": "わけはない", "word": "プロ相手に勝てるわけはない。", "mean": "프로 상대를 이길 수는 없다."},
      {
        "answer": "わけがない",
        "word": "適当にやって成功できるわけがない。",
        "mean": "대충 해서 성공할 리가 없지."
      }
    ]
  },
  {
    "id": 100,
    "grammar": "わけにはいかない",
    "means": "~할 수는 없다",
    "description":
        "일반 상식이나 규칙, 경험 등에 근거한 주관적 판단에 의해 일을 수행해야 함을 나타낸다.\n\n글에 따라서는 강한 의무감이나 정의감을 나타낸다.",
    "connectionWays": "동사 기본형\n동사 ない형",
    "examples": [
      {
        "answer": "わけにはいかない",
        "word": "この試合は, 絶対に負けるわけにはいかない。",
        "mean": "이 경기는 절대 질 수 없다."
      },
      {
        "answer": "わけにはいかない",
        "word": "倒れている人が目の前にいるのに, 助けないわけにはいかない。",
        "mean": "쓰러져 있는 사람이 눈앞에 있는데 도와주지 않을 수 없다."
      },
      {
        "answer": "わけにはいかない",
        "word": "俺はこんなところで死ぬわけにはいかない。",
        "mean": "나는 이런 데서 죽을 수 없어."
      },
      {
        "answer": "わけにはいかない",
        "word": "他人に迷惑をかけるわけにはいかない。",
        "mean": "남에게 폐를 끼칠 수는 없다."
      },
      {
        "answer": "わけにはいかない",
        "word": "ここはまだスタート地点, 躓くわけにはいかない。",
        "mean": "여기는 아직 시작점, 실패할 수는 없다."
      },
      {
        "answer": "わけにはいかない",
        "word": "年下に払わせるわけにはいかない。",
        "mean": "후배에게 치르게 할 수는 없다."
      },
      {
        "answer": "わけにもいかない",
        "word": "早く寝たいけど, ベッド行く前にお風呂も入りたいし, 歯磨かないわけにもいかない。",
        "mean": "빨리 자고 싶지만 침대 가기 전에 목욕도 하고 싶고 양치질도 안 할 수가 없어."
      },
      {
        "answer": "わけにはいかない",
        "word": "コロナウイルスで外出制限といっても冷蔵庫何も入ってないし, 出かけないわけにはいかない。",
        "mean": "코로나 때문에 외출 제한이라고 해도 냉장고가 아무것도 안 들어 있고 안 나갈 수가 없어."
      }
    ]
  },
  {
    "id": 101,
    "grammar": "はずだ",
    "means": "~일 것이다, ~이다, ~일 터이다",
    "description":
        "상황이나 상식, 경험 등으로 추측한 주관적인 판단을 말하는 문법.\n\n화자는 그럴 가능성이 높다고 생각하지만 화자 자신도 상황을 완전히 파악하고 있는 것은 아니기 때문에 추측이 확실한지는 알 수 없다.\n\n또, 약속, 예정을 나타내기도 한다.",
    "connectionWays": "はず가 명사 임으로 명사 접속 형태",
    "examples": [
      {
        "answer": "はずだ",
        "word": "何度も説明してあげたし, ちゃんと理解できているはずだ。",
        "mean": "여러 번 설명해줬고 제대로 이해하고 있을 거야."
      },
      {"answer": "ないはずだ", "word": "完璧な人なんていないはずだ。", "mean": "완벽한 사람은 없을 거야."},
      {
        "answer": "はずだ",
        "word": "火のない所に煙は立たぬと言うし, きっと理由があるはずだ。",
        "mean": "불이 없는 곳에 연기가 나지 않는다고 하고, 분명 이유가 있을 것이다."
      },
      {
        "answer": "はずです",
        "word": "小学校の頃にサッカーやっていたので, リフティングは今でもできるはずです。",
        "mean": "초등학교 때 축구를 했기 때문에 리프팅은 지금도 할 수 있을 겁니다."
      },
      {
        "answer": "ないはずだ",
        "word": "再会のシーンで涙を流したのは私だけではないはずだ。",
        "mean": "상봉 장면에서 눈물을 흘린 사람은 나뿐만이 아닐 것이다."
      },
      {
        "answer": "ないはずだ",
        "word": "このチームは実力者揃いだし, どんな相手でも負けることはないはずだ。",
        "mean": "이 팀은 실력자가 모두 갖추어져 있고, 어떤 상대라도 지는 일은 없을 것이다."
      },
      {
        "answer": "はずだ",
        "word": "良い写真が撮れたはずだ。あとでパソコンで見てみよう。",
        "mean": "좋은 사진을 찍을 수 있었을 거야.이따가 컴퓨터로 보자."
      },
      {
        "answer": "はずだ",
        "word": "Ａ駅からＢ駅までは20分で行けたはずだよ。",
        "mean": "A역에서 B역까지는 20분이면 갈 수 있었을 거야."
      },
      {
        "answer": "はずだ",
        "word": "今日は -5度か。それは寒いはずだ。",
        "mean": "오늘은 -5도인가?그것은 추울 것이다."
      },
      {
        "answer": "はずだ",
        "word": "子どもたちの成長を振り返るとあっという間だった。自分も年を取ったはずだ。",
        "mean": "아이들의 성장세를 돌아보면 눈 깜짝할 사이였다.자신도 나이가 들었을 것이다."
      }
    ]
  },
  {
    "id": 102,
    "grammar": "はずがない",
    "means": "~절대~리 없어",
    "description":
        "말하는 사람이 강한 확신을 가지고 ‘절대~리 없어’ 라고 강하게 부정하는 표현.\n\n[~わけ(が)ない / わけ(は)ない] 와 바꿔 쓸 수 있음.",
    "connectionWays": "はず가 명사 임으로 명사 접속 형태",
    "examples": [
      {
        "answer": "ないはずがない",
        "word": "彼女は一言で言うとお姫様。こんな美貌で人気がないはずがない。",
        "mean": "그녀는 한마디로 공주.이런 미모로 인기가 없을 리가 없다."
      },
      {
        "answer": "はずがない",
        "word": "他人のために一生懸命になれるはずがない。",
        "mean": "남을 위해 열심히 할 수 있을 리가 없다."
      },
      {
        "answer": "はずないでしょ",
        "word": "あんな人に彼女なんているはずないでしょ。",
        "mean": "저런 사람한테 여자친구가 있을 리가 없잖아."
      },
      {
        "answer": "はずがない",
        "word": "運転歴30年無事故, 無違反だし, そんな私が事故るはずがない。",
        "mean": "운전력 30년 무사고 무위반이고 그런 내가 사고할 리가 없다."
      },
      {
        "answer": "はずがない",
        "word": "放課後ろくに勉強もせずに遊び放題。そんな状態で良い成績が出るはずがない。",
        "mean": "방과 후 제대로 공부도 하지 않고 놀기만함.그런 상태에서 좋은 성적이 나올 리가 없다."
      },
      {
        "answer": "はずがない",
        "word": "自分を幸せにできない人が他人を幸せにできるはずがない。",
        "mean": "자신을 행복하게 하지 못하는 사람이 다른 사람을 행복하게 할 수 있을 리가 없다."
      },
      {"answer": "はずがない", "word": "真実は負けるはずがない。", "mean": "진실은 질 리 없다."},
      {
        "answer": "はずがない",
        "word": "好きになるはずがないと思ってたけど, いつの間にかあなたを好きになっていました。",
        "mean": "좋아할 리가 없다고 생각했는데 어느새 당신을 좋아하게 되었습니다."
      }
    ]
  },
  {
    "id": 103,
    "grammar": "~始める / 始まる",
    "means": " ~하기 시작하다",
    "description":
        "동작의 시작을 나타낸다. (점점 시작함)\n\n 예) 雨が降り始める \n  처음에는 약한 비가 왔지만 점점 강해지는 느낌\n\n[始める] 는 타동사이기에 자신의 의지에 따른 동작을 말함.\n\n[始まる] 는 자동사이기에 자신의 의지와 무관한 동작이나 현상에 붙는다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {"answer": "始めたら", "word": "食べ始めたら止められない。", "mean": "먹기 시작하면 멈출 수가 없어."},
      {
        "answer": "始めた",
        "word": "政府は不法とされる難民を合意の上で強制送還し始めた。",
        "mean": "정부는 불법으로 알려진 난민들을 합의한 후 강제 송환하기 시작했다."
      },
      {
        "answer": "始めて",
        "word": "同棲し始めてからもう３ヶ月経つ。",
        "mean": "동거를 시작한지 벌써 3개월이 지났다."
      },
      {
        "answer": "始めた",
        "word": "髪の毛が抜け始めた。もう年かもしれない。",
        "mean": "머리카락이 빠지기 시작했다.이제 나이일 수도 있어."
      },
      {
        "answer": "始めた",
        "word": "[ 今自分は幸せか？ ]と考え始めた瞬間に不幸が始まる。",
        "mean": "지금 나는 행복한가?'라고 생각하기 시작하는 순간 불행이 시작된다."
      },
      {
        "answer": "始めた",
        "word": "二胡を弾けるようになりたいと思って, 練習し始めた。",
        "mean": "얼후를 칠 수 있게 되고 싶어서 연습하기 시작했다."
      },
      {"answer": "始めた", "word": "体重増え始めたやばい。", "mean": "몸무게 늘기 시작했어 미치겠네."},
      {"answer": "始めた", "word": "飼っている蛇が脱皮し始めた。", "mean": "키우는 뱀이 탈피하기 시작했다."}
    ]
  },
  {
    "id": 104,
    "grammar": "~出す",
    "means": "1. ~하기 시작하다.\n2. 예제 확인",
    "description":
        "1. 동작의 개시 (갑작스러움)\n 예) 雨が降り出す\n  잡가기 비가 세게 오는 느낌\n\n2-1. 안쪽에서 바깥쪽으로의 이동\n[引き出す, 取り出す, 抜き出す, 選び出す, 絞り出す]\n\n2-2 창조, 창출\n특정 동사에 접속해서 거기에서 새로운 것을 창조한다라는 의미를 더함\n[生み出す, 作り出す, 編み出す, 考え出す]",
    "connectionWays": "동사 ます형",
    "examples": [
      {"answer": "出したら", "word": "食べ出したら止まらない。", "mean": "먹기 시작하면 멈추지 않아."},
      {
        "answer": "取り出す",
        "word": "コインロッカーから預けた荷物を取り出す。",
        "mean": "코인 로커에서 맡긴 짐을 꺼내다."
      },
      {
        "answer": "作り出す",
        "word": "人工的に生命を作り出すことは倫理的に問題はないのだろうか。",
        "mean": "인공적으로 생명을 만들어내는 것은 윤리적으로 문제가 없는 것일까."
      },
      {"answer": "出した", "word": "赤ちゃんが急に泣き出した。", "mean": "아기가 갑자기 울기 시작했다."},
      {"answer": "引き出す", "word": "ATMからお金を引き出す。", "mean": "ATM에서 돈을 찾다."},
      {
        "answer": "出した",
        "word": "先生からの難問に, 生徒は一斉に考え出した。",
        "mean": "선생님의 어려운 문제에 학생들은 일제히 생각해냈다"
      },
      {"answer": "出した", "word": "突然雨が降り出した。", "mean": "갑자기 비가 내리기 시작했다."},
      {
        "answer": "出した",
        "word": "冷蔵庫から取り出したばかりの飲み物は冷たくておいしい。",
        "mean": "냉장고에서 막 꺼낸 음료는 차갑고 맛있어."
      }
    ]
  },
  {
    "id": 105,
    "grammar": "~終える / 終わる",
    "means": "~을 마치다, 다~하다",
    "description":
        "동작 완료를 나타낸다.\n\n[終える] 는 타동사이기 때문에 사람의 의지에 따라 동작이 완료된 것에 주목.\n\n[終わる] 는 자동사이기 때문에 일이 끝났다라는 현상에 주목.\n\n또한 자연 현상이나 생리 현상에는 사용할 수 없다.\n\n예를 들면 [降る, 吹く, 泣く, 笑う] 등은 사용할 수 없고 대신 [止む]를 사용",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "終わる",
        "word": "喧嘩すると彼女は私が言い終わる前に言い返してくるから話にならない。",
        "mean": "싸우면 그녀는 내 말이 끝나기 전에 되받아치기 때문에 대화가 안 돼."
      },
      {
        "answer": "終わったら",
        "word": "宿題し終わったら次は来週の予習しなくちゃ。",
        "mean": "숙제 끝나면 다음주 예습해야지."
      },
      {
        "answer": "終わったら",
        "word": "使い終わったらちゃんと元の場所に戻しておきなさいって言ってるでしょ！",
        "mean": "다 쓰고 나면 제대로 제자리에 갖다 놓으라고 하잖아!"
      },
      {
        "answer": "終わった",
        "word": "食べ終わった後に皿を洗うのが面倒くさい。",
        "mean": "다 먹은 후에 설거지가 귀찮아."
      },
      {"answer": "終わった", "word": "読みたい漫画全部読み終わった。", "mean": "읽고 싶은 만화 다 읽었어."},
      {"answer": "終わった", "word": "花壇の花に水をやり終わった。", "mean": "화단의 꽃에 물을 다 주었다."},
      {"answer": "終えた", "word": "部屋のゴミ, やっと処分し終えた。", "mean": "방 쓰레기 겨우 처분했어."},
      {"answer": "終わった", "word": "全部準備し終わった。", "mean": "다 준비했어."}
    ]
  },
  {
    "id": 106,
    "grammar": "続ける",
    "means": "계속~하다",
    "description": "동작의 계속·지속을 나타낸다.",
    "connectionWays": "동사 ます형",
    "examples": [
      {
        "answer": "続けている",
        "word": "以前もらったペンを今でも使い続けている。",
        "mean": "이전에 받은 펜을 지금도 계속 사용하고 있다."
      },
      {"answer": "続ける", "word": "努力し続けると必ず花開く。", "mean": "계속 노력하면 반드시 꽃이 핀다."},
      {
        "answer": "続け",
        "word": "夢の中で見知らぬ男に追われ続け, 起きた時には汗だくだった。",
        "mean": "꿈속에서 낯선 남자에게 계속 쫓겼고 일어났을 때는 땀투성이였다."
      },
      {
        "answer": "続けている",
        "word": "世界人口が増え続けている。",
        "mean": "세계 인구가 계속 증가하고 있다."
      },
      {"answer": "続ける", "word": "画面を見続けると目に悪い。", "mean": "화면을 계속 보면 눈에 안 좋아."},
      {
        "answer": "続けた",
        "word": "１時間待ち続けたけど, 結局彼は来なかった。",
        "mean": "1시간을 계속 기다렸지만 결국 그는 오지 않았다."
      },
      {
        "answer": "続ける",
        "word": "定年までこの仕事をし続けるつもりはない。",
        "mean": "정년까지 이 일을 계속할 생각은 없다."
      },
      {
        "answer": "続いている",
        "word": "昨晩から雨が降り続いている。",
        "mean": "어젯밤부터 비가 계속 내리고 있다."
      }
    ]
  },
  {
    "id": 107,
    "grammar": "~ていく",
    "means":
        "1. 이동 시의 상태\n2. 순차적 동작\n3. 동작의 계속(미래로)\n4. 조금씩 멀어짐\n5. 상태 변화의 진전\n6. 소실\n7. 이쪽에서 일방적인 동작",
    "description":
        "1. 移動時の状態\n이동과 관련된 동사에 접속하여 어떤 동작으로, 어떤 수단으로 이동이 이루어졌는지를 나타낸다.\n\n2. 順次的動作\n순차적 동작의 용법일 때 [ていく] 말 그대로 [てから行く] 뜻함.\n반드시 의사(意志)동사에 접속해서 그 동작이 완전히 끝난 후에 [行く]가 이루어진다.\n\n3. 動作の継続(未来へ)\n의지동사에 접속하여 그 동작이 그 후에도 미래에 걸쳐 계속될 것임을 나타낸다\n\n4. 少しずつ遠ざかる\n대상이 화자에게서 서서히 멀어지는 것을 나타낸다.\n물리적인 거리뿐만 아니라 정신적인 거리에서도 사용할 수 있다.\n\n5. 状態変化の進展\n무의지 동사에 접속하여 변화가 진행되고 있음을 나타낸다.\n[どんどん, だんだん] 등의 부사와 호응해서 사용되는 경우가 많다.\n\n6. 消失\n무의지 동사에 접속하여 원래 존재하던 사물이 화자의 시야에서 사라지는 것을 나타낸다.\n마지막은 완전히 사라져 보이지 않게 된다.\n[どんどん, だんだん] 등의 부사와 호응해서 사용되는 경우가 많다.\n\n7. こちらからの一方的な動作\n화자로부터 혹은 화자가 보고 있는 사람으로부터 다른 대상에 대해 일방적인 동작이 이루어지는 것을 나타낸다.",
    "connectionWays": "동사 て형",
    "examples": [
      {"answer": "ていく", "word": "教室まで歩いていく。", "mean": "교실까지 걸어가다."},
      {
        "answer": "いきましょう",
        "word": "天気が悪いからバスに乗っていきましょう。",
        "mean": "날씨가 안 좋으니까 버스를 타고 갑시다."
      },
      {
        "answer": "いった",
        "word": "タイヤがパンクしたので, 自転車を引っ張っていった。",
        "mean": "타이어가 펑크나서 자전거를 끌고 갔다."
      },
      {"answer": "ていく", "word": "川をカヌーでゆっくり下っていく。", "mean": "강을 카누로 천천히 내려가다."},
      {
        "answer": "いきます",
        "word": "先にこの仕事をすませていきます。",
        "mean": "먼저 이 일을 끝내고 가겠습니다."
      },
      {
        "answer": "いってください",
        "word": "遠慮せずに泊まっていってください。",
        "mean": "사양하지 말고 자고 가세요."
      },
      {"answer": "いこう", "word": "とりあえずここで休憩していこう。", "mean": "일단 여기서 쉬고 가자."},
      {
        "answer": "ていく",
        "word": "以後も変わらず努力していく。",
        "mean": "이후에도 변함없이 노력해 나갈 것이다."
      },
      {
        "answer": "ていく",
        "word": "就職しても趣味のマラソンは続けていくつもりだ。",
        "mean": "취직해도 취미인 마라톤은 계속해 나갈 생각이다."
      },
      {"answer": "ていく", "word": "これからもここで生きていく。", "mean": "앞으로도 여기서 살아갈거야."},
      {"answer": "いった", "word": "心はどんどん離れていった。", "mean": "마음은 점점 멀어졌다."},
      {
        "answer": "いきました",
        "word": "アリは自らの巣に戻っていきました。",
        "mean": "개미는 자신의 둥지로 돌아갔습니다."
      },
      {
        "answer": "いきました",
        "word": "授業が終わると学生はすぐに帰っていきました。",
        "mean": "수업이 끝나자 학생은 바로 돌아갔습니다."
      },
      {
        "answer": "ていく",
        "word": "高齢者人口は今後もどんどん増えていく。",
        "mean": "고령자 인구는 앞으로도 점점 늘어간다."
      },
      {"answer": "ていく", "word": "雪が積もっていく。", "mean": "눈이 쌓여가다."},
      {"answer": "ていく", "word": "これからますます寒くなっていくだろう。", "mean": "앞으로 점점 추워질거야."},
      {"answer": "いった", "word": "太陽が地平線に沈んでいった。", "mean": "태양이 지평선에 저물어갔다."},
      {"answer": "ていく", "word": "覚えたそばから忘れていく。", "mean": "외운 곁에서 잊어가다."},
      {
        "answer": "ていく",
        "word": "学生が卒業していくのは寂しくてたまらない。",
        "mean": "학생이 졸업해 가는 것은 외로워 죽겠다."
      },
      {
        "answer": "ていく",
        "word": "道行く人に次から次へと声をかけていく。",
        "mean": "행인에게 잇달아 말을 걸어가다."
      },
      {"answer": "いこう", "word": "手当たり次第に聞いていこう。", "mean": "닥치는 대로 물어보자."}
    ]
  },
  {
    "id": 114,
    "grammar": "~てくる [移動時の状態]",
    "means":
        "1. 이동 시 상태\n2. 순차적 동작\n3. 동작의 지속(과거부터 현재까지)\n4. 조금씩 다가옴\n5. 상태 변화의 시작\n6. 출현\n7. 이쪽으로의 일방적인 동작",
    "description":
        "1. 移動時の状態\n이동과 관련된 동사에 접속하여 어떤 동작으로, 어떤 수단으로 이동이 이루어졌는지를 나타낸다.\n\n2. 順次的動作\n순차적 동작의 용법일 때 말 그대로 [~하고 오다] 를 뜻.\n반드시 의사동사에 접속해서 그 동작이 완전히 끝난 후에 [来る]가 이루어집니다.\n\n3. 動作の継続(過去から現在まで)\n의지 동사에 접속하여 그 동작이 과거의 어느 시점부터 현재까지 지속되고 있음을 나타낸다.\n반드시 과거형 [てきた] 형태를 취함\n\n4. 少しずつ近づく\n대상이 화자에게 서서히 다가가는 것을 나타낸다.\n물리적 거리뿐만 아니라 정신적 거리로도 가능.\n\n5. 状態変化の開始\n무의지 동사에 접속하여 변화가 시작되었음을 나타낸다.\n[どんどん, だんだん] 부사어와 호응해서 사용되는 경우가 많다.\n\n6.\n의지가 없는 동사에 접속해서 원래 존재하지 않았다거나 말하는 사람이 보이지 않았던 것이 보이게 되는 것을 나타낸다.\n[どんどん, だんだん] 부사어와 호응해서 사용되는 경우가 많다.\n\n7. こちらへの一方的な動作\n화자, 혹은 화자가 보고 있는 사람에 대해 일방적인 동작이 이루어지는 것을 나타낸다.\"",
    "connectionWays": "동사 て형",
    "examples": [
      {"answer": "走ってくる", "word": "家まで走ってくる。", "mean": "집까지 달려오다."},
      {
        "answer": "乗ってきた",
        "word": "天気が悪いからタクシーに乗ってきた。",
        "mean": "날씨가 안 좋아서 택시 타고 왔어."
      },
      {
        "answer": "引っ張ってきた",
        "word": "タイヤがパンクしたので, 自転車を引っ張ってきた。",
        "mean": "타이어가 펑크나서 자전거를 끌고 왔다."
      },
      {"answer": "下りてきた", "word": "階段でゆっくり下りてきた。", "mean": "계단으로 천천히 내려왔어."},
      {
        "answer": "してきます",
        "word": "予約をしてきますので, ここで待っていてください。",
        "mean": "예약을 하고 올테니 여기서 기다려주세요."
      },
      {
        "answer": "いってきます",
        "word": "友達に家に遊びにいってきます。",
        "mean": "친구한테 집에 놀러 갔다 올게요."
      },
      {
        "answer": "話してきた",
        "word": "途中偶然友人に会って話してきたから遅くなった。",
        "mean": "도중에 우연히 친구를 만나서 이야기하고 오느라 늦었다."
      },
      {
        "answer": "てきたのに",
        "word": "ずっと努力してきたのに, なかなか結果が出ない。",
        "mean": "계속 노력했는데 결과가 잘 안나와."
      },
      {
        "answer": "てきた",
        "word": "何百年も前から続いてきたこの伝統を, これからも守っていく。",
        "mean": "수백 년 전부터 이어져 온 이 전통을 지켜나갈 것이다."
      },
      {
        "answer": "してきました",
        "word": "大学を卒業して以来, ずっとここで仕事をしてきました。",
        "mean": "대학을 졸업한 이후로 계속 여기서 일해 왔습니다."
      },
      {"answer": "近づいてきた", "word": "二人の距離は近づいてきた。", "mean": "두 사람의 거리는 가까워졌다."},
      {"answer": "こられました", "word": "ご主人様が戻ってこられました。", "mean": "주인님이 돌아오셨어요."},
      {
        "answer": "帰ってくる",
        "word": "うちの子はお腹がすくとすぐ帰ってくる。",
        "mean": "우리 애는 배고프면 금방 돌아와."
      },
      {
        "answer": "きている",
        "word": "高齢者人口はどんどん増えてきている。",
        "mean": "고령자 인구는 점점 늘어나고 있다."
      },
      {
        "answer": "積もってきた",
        "word": "ここ数日の大雪で雪が積もってきた。",
        "mean": "요 며칠 동안의 폭설로 눈이 쌓여 왔다."
      },
      {"answer": "なってきた", "word": "最近暑くなってきた。", "mean": "요즘 날씨가 더워졌어."},
      {"answer": "昇ってきた", "word": "太陽が地平線から昇ってきた。", "mean": "태양이 지평선에서 떠올랐다."},
      {"answer": "生えてきた", "word": "歯が生えてきた。", "mean": "이가 나기 시작했어."},
      {
        "answer": "やってきた",
        "word": "新年度になり新しい学生がやってきた。",
        "mean": "새해가 되어 새로운 학생이 찾아왔다."
      },
      {"answer": "てきた", "word": "知らない人が話しかけてきた。", "mean": "모르는 사람이 말을 걸었다."},
      {"answer": "付いてきた", "word": "猫が噛み付いてきた。", "mean": "고양이가 물었다."}
    ]
  },
  {
    "id": 121,
    "grammar": "~からなる / からできている",
    "means": "~로 구성되는",
    "description":
        "사물을 구성하는 요소나 재료를 나타내는 단어에 대해서 그것들로 전체가 이루어져 있음을 나타내는 문법.\n이 [から] 는 원재료를 나타내기 때문에 같은 원재료를 나타내는 [で] 또는 [によって] 로 바꿀 수 있다.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "からなっている",
        "word": "旧約聖書は３９巻, 新約聖書は２７巻からなっている。",
        "mean": "구약성경은 39권, 신약성경은 27권으로 구성돼 있다."
      },
      {
        "answer": "からなっている",
        "word": "今の自分は過去の自分の行動からなっている。",
        "mean": "지금의 나는 과거의 내 행동으로 이루어져 있다."
      },
      {
        "answer": "からなっている",
        "word": "銀河系は１０００億個の恒星からなっている。",
        "mean": "은하계는 1000억 개의 항성으로 이루어져 있다."
      },
      {
        "answer": "からできている",
        "word": "あなたは, あなたの食べた物からできている。",
        "mean": "당신은 당신이 먹은 것으로 이루어져 있다."
      },
      {
        "answer": "からできている",
        "word": "髪のおよそ９０％はたんぱく質からできている。",
        "mean": "머리카락의 약 90%는 단백질로 이루어져 있다."
      },
      {"answer": "からできている", "word": "麺は小麦粉からできている。", "mean": "면은 밀가루로 만들어졌다."},
      {
        "answer": "からできている",
        "word": "黒鉛とダイヤモンドなど同じ元素からできているのに性質が異なるものを同素体と呼ぶ。",
        "mean": "흑연과 다이아몬드 등 같은 원소로 이루어졌는데 성질이 다른 것을 이소체라고 부른다."
      },
      {
        "answer": "からできている",
        "word": "筋組織は, 筋細胞と結合組織からできている。",
        "mean": "근조직은 근세포와 결합조직으로 이루어져 있다."
      },
      {
        "answer": "からできている",
        "word": "味噌も醤油も大豆からできている。",
        "mean": "된장도 간장도 콩으로 이루어져 있다."
      },
      {
        "answer": "からできている",
        "word": "飛行機は３００万個の部品からできている。",
        "mean": "비행기는 300만 개의 부품으로 이루어져 있다."
      },
      {
        "answer": "からなる",
        "word": "現在太陽系は, １つの恒星と８つの惑星からなる。",
        "mean": "현재 태양계는 1개의 항성과 8개의 행성으로 구성된다."
      },
      {
        "answer": "からなっている",
        "word": "この会議は国籍の違う１０人の専門家からなっている。",
        "mean": "이 회의는 국적이 다른 10명의 전문가로 구성되어 있다."
      },
      {
        "answer": "からなる",
        "word": "水素原子２つと酸素原子１つからなる水は, 地球上の生命活動を維持する上で重要である。",
        "mean": "수소원자 2개와 산소원자 1개로 구성된 물은 지구상의 생명활동을 유지하는 데 중요하다."
      },
      {
        "answer": "からなっている",
        "word": "原子核は陽子と中性子からなっている。",
        "mean": "원자핵은 양성자와 중성자로 이루어져 있다."
      },
      {
        "answer": "からできている",
        "word": "子どもに[ 宇宙は何からできているの？ ]と聞かれた。",
        "mean": "아이가 [ 우주는 무엇으로 이루어져 있나요? ]라고 물었다."
      }
    ]
  },
  {
    "id": 122,
    "grammar": "1. 숫자 + あまり\n2. 감정 + あまり",
    "means": "1. ~정도\n2. ~한 나머지, 너무~해서",
    "description":
        "1. \n숫자에 대해 그 수보다 조금 더 많다는 것을 나타낸다.\n정확하고 세세한 숫자에 접속할 수 없다.\n\n〇１００人あまり\n✕１３８人あまり\n\n2.\n감정, 감각, 상태를 나타내는 명사나 동사에 접속하여 그 정도가 극단적으로 심하다는 것을 나타낸다",
    "connectionWays":
        "1. 숫자 + 조수사 + あまり\n\n2.\n명사 + のあまり(に)\n동사 보통형 + あまり(に)\nな형용사어간 + なあまり",
    "examples": [
      {
        "answer": "あまり",
        "word": "Ａ社は今期5000万円あまりの赤字となる見通しを示した。",
        "mean": "A사는 이번 분기 5000만엔 남짓 적자가 날 것으로 전망했다."
      },
      {
        "answer": "あまり",
        "word": "国連には１９０か国あまりの国が加盟している。",
        "mean": "유엔에는 190여 개국의 국가가 가입해 있다."
      },
      {"answer": "あまり", "word": "２週間で２キロあまり痩せた。", "mean": "2주 만에 2kg 남짓 빠졌다."},
      {
        "answer": "あまり",
        "word": "今日は雪２０センチあまり積もった。",
        "mean": "오늘은 눈 20여 센티미터 쌓였다."
      },
      {
        "answer": "あまり",
        "word": "１０個あまりのりんごが腐って無駄になった。",
        "mean": "10여 개의 사과가 썩어서 헛수고가 되었다."
      },
      {
        "answer": "あまり",
        "word": "５０匹あまりのミミズを飼っている。",
        "mean": "50여 마리의 지렁이를 키우고 있다."
      },
      {
        "answer": "あまり",
        "word": "首脳会談の警備に警察官３０００人あまりが動員された。",
        "mean": "정상회담 경비에 경찰관 3000여 명이 동원됐다."
      },
      {
        "answer": "あまり",
        "word": "このジャングルでは４０種類あまりの新種の生物が発見された。",
        "mean": "이 정글에서는 40여 종의 신종 생물이 발견됐다."
      },
      {
        "answer": "のあまり",
        "word": "激務のあまり, 疲れて仕事が捗らない。",
        "mean": "격무한 나머지 피곤해서 일이 진척되지 않는다."
      },
      {"answer": "のあまり", "word": "高さのあまり足がすくむ。", "mean": "높이가 너무 높아 발이 움츠러들다."},
      {
        "answer": "のあまり",
        "word": "美しさのあまり, 彼女ばかりに目が行ってしまう。",
        "mean": "너무 아름다워서 그녀에게만 눈길이 가버린다."
      },
      {
        "answer": "のあまり",
        "word": "痛みのあまり気を失ってしまった。",
        "mean": "아픈 나머지 정신을 잃고 말았다."
      },
      {
        "answer": "あまり",
        "word": "このゲームは戦略性を追求するあまり, 操作が複雑になっている。",
        "mean": "이 게임은 전략성을 추구한 나머지 조작이 복잡해졌다."
      },
      {
        "answer": "のあまり",
        "word": "恐怖のあまり冷静に物事を考えられなくなっている。",
        "mean": "공포에 질려 냉정하게 생각할 수 없게 되었다."
      },
      {
        "answer": "のあまり",
        "word": "眩しさのあまり彼女を直視できない。",
        "mean": "눈이 부신 나머지 그녀를 직시할 수 없다."
      },
      {"answer": "のあまり", "word": "動揺のあまり手が震える。", "mean": "동요한 나머지 손이 떨리다."}
    ]
  },
  {
    "id": 124,
    "grammar": "以上(は) ",
    "means": "~한 이상(에는) ",
    "description":
        "화자의 강한 의지나 의무감, 결의를 나타내는 문법.\n앞 문장에는 에서는 이미 발생한 사건을 말하고, 그 상황 하에서 해야 할 일을 뒤 문장에서 서술함.",
    "connectionWays":
        "명사＋である以上 (は) \n동사 사전형＋以上 (は) \nい형용사 보통형＋以上 (は) \nな형용사 보통형＋である / な＋以上 (は) ",
    "examples": [
      {
        "answer": "以上は",
        "word": "給料を貰ってる以上は一生懸命やるのみ。",
        "mean": "월급 받는 이상은 열심히 할 뿐이야."
      },
      {
        "answer": "以上",
        "word": "選ばれた以上, 文句も言っていられない。",
        "mean": "뽑힌 이상 불평할 수 없다."
      },
      {
        "answer": "以上",
        "word": "結局人類が人類である以上差別からは逃れられない。",
        "mean": "결국 인류가 인류인 이상 차별에서 벗어날 수 없다."
      },
      {
        "answer": "以上",
        "word": "ＦＷである以上, まずはゴールを意識しないとダメ。",
        "mean": "공격수인 이상 우선 골을 의식해야 한다."
      },
      {
        "answer": "以上は",
        "word": "試験勉強は一切してないが, 会場に来た以上は全力を出そうと思う。",
        "mean": "시험공부는 일절 하지 않았지만, 회장에 온 이상은 전력을 다하려고 한다."
      },
      {
        "answer": "以上は",
        "word": "証拠が無い以上は無罪だと考えるべきだ。",
        "mean": "증거가 없는 이상 무죄라고 봐야 한다."
      },
      {
        "answer": "以上は",
        "word": "タイムマシンが無い以上は, 歴史の教科書に書かれている憶測が正しいか確認できない。",
        "mean": "타임머신이 없는 이상은 역사교과서에 적혀 있는 억측이 맞는지 확인할 수 없다."
      },
      {
        "answer": "以上は",
        "word": "この仕事を引き受けた以上は責任をもってやり遂げる。",
        "mean": "이 일을 맡은 이상은 책임지고 해내다."
      }
    ]
  },
  {
    "id": 125,
    "grammar": "一方だ",
    "means": "~하기만 한다,~할 뿐이다",
    "description":
        "무언가가 한 방향으로 계속적으로 변화하고 있음을 나타낸다.\n좋은 일에도 나쁜 일에도 사용할 수 있지만 나쁜 일에 사용하는 편이 많다.",
    "connectionWays": "동사 사전형\n명사 + の",
    "examples": [
      {
        "answer": "一方だ",
        "word": "トレーニングしないと運動能力は落ちてく一方だ。",
        "mean": "훈련하지 않으면 운동 능력은 떨어질 뿐이다."
      },
      {
        "answer": "一方だ",
        "word": "関税収入減と共に, 政府の税収は減る一方だ。",
        "mean": "관세 수입 감소와 함께 정부 세수는 줄어들기만 한다."
      },
      {
        "answer": "一方だ",
        "word": "マジで何かしないと太る一方だ。",
        "mean": "진짜 뭐 안 하면 살 찌기만 해."
      },
      {
        "answer": "一方だ",
        "word": "彼女ほど純粋な存在はない。どんどん好きになっていく一方だ。",
        "mean": "그녀만큼 순수한 존재는 없다.점점 좋아지기만 한다."
      },
      {
        "answer": "一方だ",
        "word": "大抵の場合は逃げればその分リスクは大きくなる一方だということを理解しておかなければならない。",
        "mean": "대개 도망치면 그만큼 위험이 커질 수밖에 없다는 것을 알아야 한다."
      },
      {"answer": "一方だ", "word": "このままでは衰退の一方だ。", "mean": "이대로라면 쇠퇴하기만 할 것이다."}
    ]
  },
  {
    "id": 126,
    "grammar": "一方で",
    "means": "1.~하는 한편\n2.~하면서",
    "description": "1. 대비 : A는~, 반면에 B는~\n2. 병렬 : A하면서 B를 한다",
    "connectionWays":
        "동사 사전형＋一方 (で) \nい형용사 보통형＋一方 (で) \nな형용사 어간＋な / である＋一方 (で) \n명사＋である＋一方 (で) ",
    "examples": [
      {
        "answer": "一方で",
        "word": "人口減少が加速する一方で, 東京への人口と富の一極集中が進んでいます。",
        "mean": "인구 감소가 가속화되는 한편, 도쿄로의 인구와 부의 일극 집중이 진행되고 있습니다."
      },
      {
        "answer": "一方で",
        "word": "断られると残念な一方でちょっと嬉しかったりもする。",
        "mean": "거절당하면 안타까운 한편으로 좀 기쁘기도 하다."
      },
      {
        "answer": "一方で",
        "word": "喜びの声が上がる一方で嘆きの声もあった。",
        "mean": "기쁨의 목소리가 높아지는가 하면 탄식의 소리도 있었다."
      },
      {
        "answer": "一方で",
        "word": "大学院生である一方で, 実業家でもある。",
        "mean": "대학원생이면서 기업인이기도 하다."
      },
      {
        "answer": "一方で",
        "word": "富裕層はますますお金持ちになる一方, 貧困者は増え続けている。",
        "mean": "부유층은 점점 부자가 되는 반면 빈곤자는 계속 늘고 있다."
      },
      {
        "answer": "一方で",
        "word": "田舎に住みたい人もいる一方で, 大きな都市に住みたい人もいる。",
        "mean": "시골에 살고 싶은 사람도 있는 반면 큰 도시에 살고 싶은 사람도 있다."
      },
      {
        "answer": "一方で",
        "word": "田舎に住みたい人もいるが, 一方で大きな都市に住みたい人もいる。",
        "mean": "시골에 살고 싶은 사람도 있지만, 한편으로는 큰 도시에 살고 싶은 사람도 있다."
      },
      {
        "answer": "一方で",
        "word": "一方ではやり直したい気持ちが, 他方では逃げたい気持ちがあって, 自分でもどっちが本音か分からない。",
        "mean":
            "한편으로는 다시 시작하고 싶은 마음이, 다른 한편으로는 도망치고 싶은 마음이 있어서, 스스로도 어느 쪽이 진심인지 모른다."
      }
    ]
  },
  {
    "id": 127,
    "grammar": "~(た)上で",
    "means": "~한 후에",
    "description": "앞 문장이 완전히 끝나지 않으면 뒷 문장으로 넘어가지 않을 것임을 강조하는 듯한 뉘앙스를 가짐.",
    "connectionWays": "동사 과거형\n명사の",
    "examples": [
      {
        "answer": "た上で",
        "word": "両親と相談した上で, Ａ大学への進学を決めた。",
        "mean": "부모님과 상의한 후, A 대학에의 진학을 결정했다."
      },
      {
        "answer": "た上で",
        "word": "どこが悪いのかしっかり理解した上で謝ってください。",
        "mean": "어디가 나쁜지 잘 이해한 후 사과하세요."
      },
      {"answer": "の上だ", "word": "死ぬことは覚悟の上だ。", "mean": "죽는 것은 각오한 바이다."},
      {
        "answer": "の上",
        "word": "内容をご確認の上, 三日以内にご返信ください。",
        "mean": "내용 확인 후 3일 이내에 회신 부탁드립니다."
      },
      {
        "answer": "た上で",
        "word": "身長とか年収とか, 諸々のことを加味した上で今の彼に決めた。",
        "mean": "키라든가 연수입이라든가, 여러가지를 가미한 후에 지금의 그로 결정했다."
      },
      {
        "answer": "た上で",
        "word": "現状を正確に把握した上で目標を設定することが大事だ。",
        "mean": "현재 상황을 정확히 파악한 후 목표를 설정하는 것이 중요하다."
      },
      {
        "answer": "た上で",
        "word": "登山を舐めてはいけません。事前の準備をしっかりした上でのぞみましょう。",
        "mean": "등산을 핥아서는 안됩니다.사전 준비를 단단히 한 후에 들여다봅시다."
      },
      {
        "answer": "の上",
        "word": "使用の際はその危険性をしっかりとご理解の上, 自己責任でお願いします。",
        "mean": "사용 시 그 위험성을 잘 이해하시고 자기 책임 하십시요."
      },
      {
        "answer": "た上で",
        "word": "大きな成功は基盤をしっかり整えた上で, 誰もやったことがないことにチャレンジするから手に入れられる。",
        "mean": "큰 성공은 기반을 다지고 아무도 해보지 못한 일에 도전하기 때문에 얻을 수 있다."
      },
      {"answer": "た上で", "word": "酔った上での犯行。", "mean": "취한 다음의 범행"},
      {
        "answer": "た上で",
        "word": "ご理解頂けた上でお声かけ頂けますと幸いです。",
        "mean": "이해하시고 말씀해주시면 감사하겠습니다."
      },
      {
        "answer": "た上で",
        "word": "ご理解いただけた上でのご参加をお願いします。",
        "mean": "이해하시고 참여 부탁드립니다."
      }
    ]
  },
  {
    "id": 128,
    "grammar": "동사 기본형 + 上で",
    "means": "~하는데 있어서",
    "description":
        "어떤 일을 할 때 생기는 문제에 대해서 말하는 문법.\n뒷 내용에서는 어떠한 문제가 생기는 것, 혹은 그 문제에 대한 대응 등이 기술된다.",
    "connectionWays": "동사 기본형",
    "examples": [
      {
        "answer": "上で",
        "word": "中古車を買う上で注意しなければならないことは何ですか。",
        "mean": "중고차를 살 때 주의해야 할 것은 무엇입니까?"
      },
      {
        "answer": "上で",
        "word": "企画を実施する上で, これは重要だ。",
        "mean": "기획을 실시하는 데 있어 이것은 중요하다."
      },
      {
        "answer": "上で",
        "word": "西洋文化を理解する上で, キリスト教文化は欠かせない。",
        "mean": "서양 문화를 이해하는 데 기독교 문화는 필수다."
      },
      {
        "answer": "上で",
        "word": "あの人は計画を遂行する上でどうしても必要な存在だ。",
        "mean": "저 사람은 계획을 수행하는 데 꼭 필요한 존재야."
      },
      {
        "answer": "上で",
        "word": "成功する上で最も大切なのは己と成功者との距離だ。",
        "mean": "성공하는 데 가장 중요한 것은 자신과 성공자 사이의 거리다."
      },
      {
        "answer": "上で",
        "word": "目的を達成する上で足枷となるものを排除しなければならない。",
        "mean": "목적을 달성하는 데 족쇄가 되는 것을 배제해야 한다."
      },
      {
        "answer": "上で",
        "word": "失敗は人間が成長する上で必ず通る道だ。",
        "mean": "실패는 인간이 성장하는 데 반드시 지나는 길이다."
      },
      {
        "answer": "上で",
        "word": "お酒の場は本音が出やすく, 仕事をする上で重要なことが得られるところだ。",
        "mean": "술자리는 속내를 드러내기 쉽고, 일하는 데 중요한 것을 얻을 수 있는 곳이다."
      },
      {
        "answer": "上で",
        "word": "趣味を継続する上で他人に迷惑かけるなんていうのは以ての外。",
        "mean": "취미를 계속하는 데 있어서 다른 사람에게 폐를 끼친다는 것은 의외다."
      },
      {
        "answer": "上で",
        "word": "音楽はやっぱり生きていく上で不可欠だと思う。",
        "mean": "음악은 역시 살아가는데 필수적이라고 생각해."
      },
      {
        "answer": "上で",
        "word": "成長する上で素直さがあれば, 知らないことに謙虚な姿勢で向き合い教えてもらうことができる。",
        "mean": "성장하는 데 솔직함이 있다면 모르는 것을 겸허한 자세로 마주 보고 배울 수 있다."
      },
      {
        "answer": "上で",
        "word": "筋肉を付ける上で最も重要なのはたんぱく質だ。",
        "mean": "근육을 키우는 데 가장 중요한 것은 단백질이다."
      },
      {
        "answer": "上で",
        "word": "経済を学ぶ上で, まず自国の経済を知っておくことは基本です。",
        "mean": "경제를 배우는데 있어서, 우선 자국의 경제를 알아 두는 것은 기본입니다."
      },
      {"answer": "上で", "word": "ホウレンソウは仕事の上での鉄則。", "mean": "시금치는 업무상의 철칙."}
    ]
  },
  {
    "id": 129,
    "grammar": "上(じょう)で",
    "means": "~상으로(는)",
    "description": "어떠한 데이터나 근거를 나타내는 명사에 대해 그것들을 참조하는 것을 나타낸다",
    "connectionWays": "명사＋の上で (は) \n명사＋上",
    "examples": [
      {
        "answer": "上で",
        "word": "データ上でしか物事を見るのではなく, 目の前の実態も観察したほうがいい。",
        "mean": "데이터 상에서만 사물을 볼 것이 아니라 눈앞의 실태도 관찰하는 것이 좋다."
      },
      {
        "answer": "上で",
        "word": "明日から暦の上では新学期が始まる。",
        "mean": "내일부터 달력상으로는 새 학기가 시작된다."
      },
      {
        "answer": "上で",
        "word": "資料の上では昔ここに墓地があったらしい。",
        "mean": "자료상으로는 옛날에 여기 묘지가 있었대."
      },
      {
        "answer": "上で",
        "word": "今の情報の上では新たな被害者は確認されていない。",
        "mean": "지금의 정보상으로는 새로운 피해자는 확인되지 않았다."
      },
      {
        "answer": "上で",
        "word": "富士山は地図の上では静岡県と山梨県に跨がっている。",
        "mean": "후지산은 지도상으로는 시즈오카현과 야마나시현에 걸쳐 있다."
      },
      {
        "answer": "上で",
        "word": "地図上では国境線が引かれているが, 実際そこには線など何もない。",
        "mean": "지도상으로는 국경선이 그어져 있지만 실제로 그곳에는 선이란 아무것도 없다."
      },
      {
        "answer": "上で",
        "word": "聞いた話の上では厳しい人らしいが, 会ってみると意外に柔和な人だった。",
        "mean": "들은 말로는 엄한 사람이라는데 만나보니 의외로 유화적인 사람이었다."
      },
      {
        "answer": "上で",
        "word": "新型コロナウイルスなど, 長い人類の歴史の上では多くあるうちのほんの１つの流行り病でしかない。",
        "mean": "코로나19 등 오랜 인류 역사상 흔한 중 단 하나의 유행병일 뿐이다."
      }
    ]
  },
  {
    "id": 131,
    "grammar": "によらず",
    "means": "~에 관계없이",
    "description": "어떠한 상황에도 관계가 없는 것을 나타낸다",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "によらず",
        "word": "彼は見かけによらず, 神経質だ。",
        "mean": "그는 보기와는 달리 신경질적이다."
      },
      {
        "answer": "によらず",
        "word": "猫は可愛いが見かけによらず狂暴だ。",
        "mean": "고양이는 귀엽지만 보기와는 달리 광포하다."
      },
      {"answer": "によらず", "word": "人は見かけによらない。", "mean": "사람은 겉보기와는 다르다."},
      {
        "answer": "によらず",
        "word": "脂っこいものを食べた次の日は場所によらずニキビができる。",
        "mean": "기름진 음식을 먹은 다음날은 장소에 구애받지 않고 여드름이 생긴다."
      },
      {
        "answer": "によらず",
        "word": "話し合いによらず力で相手をねじ伏せるのが軍事力だ。",
        "mean": "대화에 관계없이 힘으로 상대를 비틀어 엎드리는 것이 군사력이다."
      },
      {
        "answer": "によらず",
        "word": "当委員会では子どもが保護者の経済状況によらず進学できるよう, その費用の一部を援助しています。",
        "mean": "본 위원회에서는 자녀가 학부모의 경제상황에 관계 없이 진학할 수 있도록 그 비용의 일부를 지원하고 있습니다."
      },
      {
        "answer": "によらず",
        "word": "性別, 年齢によらず, 条件に当てはまる方であれば誰でもいいです。",
        "mean": "성별, 나이에 상관없이 조건에 맞는 분이면 누구나 좋습니다."
      },
      {
        "answer": "によらず",
        "word": "日常生活における決済手段は, 支払い金額によらず現金の利用は減少傾向にある。",
        "mean": "일상생활에서의 결제수단은 지불금액에 관계없이 현금 이용은 감소 추세이다."
      }
    ]
  },
  {
    "id": 132,
    "grammar": "ても始まらない",
    "means": "~해도 소용없다",
    "description": "전건이 사태 진전에 아무런 도움이 되지 않음을 나타낸다.",
    "examples": [
      {
        "answer": "も始まらないし",
        "word": "留学先でどうなるかなんて心配していても始まらないし, 実行あるのみだ。",
        "mean": "유학지에서 어떻게 될지 걱정해도 소용없고 실행이 있을 뿐이다."
      },
      {
        "answer": "も始まらない",
        "word": "今さら終わったことを後悔しても始まらない。",
        "mean": "이제 와서 끝난 것을 후회해도 소용없다."
      },
      {"answer": "も始まらない", "word": "泣き言言っても始まらない。", "mean": "우는 소리 해도 소용없다."},
      {
        "answer": "も始まらない",
        "word": "自分にはどうにもならないことでくよくよしても始まらない。",
        "mean": "자신에게는 어쩔 수 없는 일로 끙끙 앓아도 소용없다."
      },
      {
        "answer": "も始まらないし",
        "word": "否定ばかりしていても始まらないし, 新しいことを受け入れていくことも重要だ。",
        "mean": "부정만 해도 소용없고 새로운 것을 받아들이는 것도 중요하다."
      },
      {
        "answer": "も始まらない",
        "word": "自分を責めても始まらないと分かっているが, 今でもあの光景が脳裏から離れない。",
        "mean": "스스로를 탓해도 소용없다는 것을 알지만 지금도 그 광경이 뇌리에서 떠나지 않는다."
      },
      {"answer": "も始まらない", "word": "愚痴を言っていても始まらない。", "mean": "푸념해도 소용없다."}
    ]
  },
  {
    "id": 133,
    "grammar": "なくて済む",
    "means": "~하지 않아도 된다",
    "description":
        "그렇게 하지 않아도 문제가 해결될 수 있음을 나타낸다.보통은 나쁜 사태를 회피하는 데 사용함.\n[~ないですむ, ~ずにすむ] 회화체 ",
    "connectionWays": "동사 ない형",
    "examples": [
      {
        "answer": "ずに済んだ",
        "word": "インフルは息子だけで, 家族にうつらずに済んだ。",
        "mean": "독감은 아들 하나만으로 가족에게 전염되지 않고 끝났다."
      },
      {"answer": "ずに済んだ", "word": "周りにバレずに済んだ。", "mean": "주변에 들키지 않고 끝났다."},
      {"answer": "ずに済む", "word": "メモしておけば忘れずに済む。", "mean": "메모해 두면 잊지 않아도 된다."},
      {
        "answer": "ずに済んだ",
        "word": "ちゃんと説明したら怒られずに済んだのではないか。",
        "mean": "제대로 설명했으면 혼나지 않고 끝난 것 아닌가."
      },
      {
        "answer": "くて済む",
        "word": "amazonさえあれば外出なくて済む。",
        "mean": "amazon만 있으면 외출하지 않아도 된다."
      },
      {
        "answer": "くて済んでよかった",
        "word": "階段から落ちたけど怪我しなくて済んでよかった。",
        "mean": "계단에서 떨어졌는데 다치지 않아서 다행이야."
      },
      {
        "answer": "くて済んだ",
        "word": "予約してたおかげで待ち時間が全くなくて済んだ。",
        "mean": "예약한 덕분에 대기시간이 전혀 없어서 끝났어."
      },
      {
        "answer": "くて済んだ",
        "word": "一時はどうなることかと思ったが何事もなくて済んだ。",
        "mean": "한때는 어떻게 되는 줄 알았는데 아무 일 없이 끝났다."
      }
    ]
  },
  {
    "id": 134,
    "grammar": "~に向け / に向けて",
    "means": "~을 목표로,~을 향해",
    "description":
        "1. 방향\n장소나 방향을 나타내는 명사에 접속하여 물건이 그 방향으로 이동하는 것. 또는 사람의 자세나 시선의 방향을 나타낸다.\n\n2. 목적지\n장소를 나타내는 명사에 접속하여 사람이나 사물의 이동 목적지를 나타낸다. 후항에서는 이동 관련 동사가 사용된다.\n\n3. 상대(방)\n사람이나 조직·단체를 나타내는 명사에 접속하여 그것들에 대해 어떠한 태도를 취하는 것, 또는 무언가를 호소하는 것을 나타낸다.\n\n4.목표\n목표가 되는 사물을 나타내는 명사에 접속하여 그것을 실현하기 위해 어떤 행동을 하는 것을 나타낸다.\n\n각각 [~へ向け / ~へ向けて] 도 같음.",
    "connectionWays": "명사에 직접 접속",
    "examples": [
      {
        "answer": "に向けて",
        "word": "北に向けて飛行機が飛んで行った。",
        "mean": "북쪽을 향해 비행기가 날아갔다."
      },
      {
        "answer": "に向けて",
        "word": "息子は背を私に向けて反抗している。",
        "mean": "아들은 등을 돌리고 반항하고 있다."
      },
      {
        "answer": "へ向けて",
        "word": "３時間前に山頂へ向けて出発したが, いまだ辿り着かない。",
        "mean": "3시간 전에 산꼭대기를 향해 출발했지만 아직 도달하지 못했다."
      },
      {
        "answer": "に向け",
        "word": "ＦＷに向けパスを出したが, 惜しくもオフサイドでうまく通らなかった。",
        "mean": "공격수를 향해 패스를 했지만 아쉽게도 오프사이드에서 잘 통하지 않았다."
      },
      {"answer": "に向けて", "word": "聴衆に向けて演説をする。", "mean": "청중을 향해 연설을 하다."},
      {
        "answer": "に向けて",
        "word": "Ａ国は各国に向けて強気の姿勢を貫いている。",
        "mean": "A국은 각국을 향해 강경한 자세를 고수하고 있다."
      },
      {
        "answer": "に向け",
        "word": "来月のスピーチコンテストに向け, 毎日特訓している。",
        "mean": "다음 달 스피치 콘테스트를 위해 매일 특훈하고 있다."
      },
      {
        "answer": "に向け",
        "word": "この問題の解決に向け, 人員を増やして取り組んでいる。",
        "mean": "이 문제를 해결하기 위해 인원을 늘려 노력하고 있다."
      }
    ]
  },
  {
    "id": 135,
    "grammar": "もの",
    "means": "(그러니까) 왜냐하면~걸, ~말야,~거든",
    "description":
        "주관적인 원인·이유를 나타낸다.\n여자나 아이들이 비교적 많이 사용하는 표현.\n전항에는 [だって] 가 자주 호응함.그 경우는 제멋대로 변명하는 듯한 뉘앙스를 포함합니다.\n　남성도 사용할 수 있지만 젊고 어린 인상을 주기 때문에 일부러가 아닌 한 친한 사람 이외에는 사용하지 않다.\n\n[もん]는 회화체",
    "connectionWays":
        " (だって) + 동사 보통형 + もの / もん\n (だって) + い형용사 보통형 + もの / もん\n (だって) + な형용사 어간 + だもの / だもん\n (だって) + 명사 + だもの / だもん",
    "examples": [
      {
        "answer": "もん",
        "word": "早く大人になりたい。だって大人にならないとお姉ちゃんと結婚できないもん。",
        "mean": "빨리 어른이 되고 싶다.왜냐하면 어른이 되어야 누나랑 결혼할 수 있거든."
      },
      {
        "answer": "もん",
        "word": "だって牛乳嫌いだもん。背低いのはしょうがないでしょ。",
        "mean": "왜냐하면 우유를 싫어하거든.키 작은 건 어쩔 수 없지."
      },
      {
        "answer": "もん",
        "word": "諦めてもいいじゃん。だって辛いんだもん。",
        "mean": "포기해도 되잖아.왜냐하면 맵거든."
      },
      {
        "answer": "もん",
        "word": "だって私女の子だもん。可愛いって言われたいよ。",
        "mean": "왜냐면 나 여자애거든.귀엽다는 소리 듣고 싶어."
      },
      {
        "answer": "もん",
        "word": "だって生きてて良い事ないもん。死んでもいいでしょ。",
        "mean": "왜냐하면 살면서 좋은 일이 없거든요.죽어도 되잖아."
      },
      {
        "answer": "もん",
        "word": "最近ニュース見なくなった。同じ内容ばっかりで見る価値ないもん。",
        "mean": "요즘 뉴스 안 보게 됐어.같은 내용만 가지고 볼 가치가 없는걸."
      },
      {
        "answer": "もん",
        "word": "このアニメずっと見ちゃう。だって面白いんだもん。",
        "mean": "이 애니메이션 계속 보게 돼.왜냐하면 재밌거든."
      },
      {
        "answer": "もん",
        "word": "女の子大好き。だって男だもん。",
        "mean": "여자애들 너무 좋아. 왜냐면 남자거든."
      }
    ]
  },
  {
    "id": 136,
    "grammar": "とは",
    "means": "~다니,~라니",
    "description": "~라니 뜻밖이다, 놀랍다",
    "connectionWays": "동사 보통형",
    "examples": [
      {
        "answer": "とは",
        "word": "あの若さ, ５０歳を超えているとは信じられない。",
        "mean": "저 젊음, 50세가 넘었다니 믿을 수 없다."
      },
      {"answer": "とは", "word": "こんな短期間で結果が出るとは。", "mean": "이렇게 단기간에 결과가 나오다니"},
      {
        "answer": "とは",
        "word": "年上にタメ口とは, 失礼だと思わないか？",
        "mean": "연상에게 반말이라니 실례라고 생각하지 않아?"
      },
      {
        "answer": "とは",
        "word": "まさか落とした財布が戻ってくるとは。",
        "mean": "설마 잃어버린 지갑이 돌아올 줄이야."
      },
      {"answer": "とは", "word": "あんな天気で海で遊ぶとは…", "mean": "저런 날씨에 바다에서 놀다니.."},
      {"answer": "とは", "word": "彼がこんなにも優しいとは。", "mean": "그가 이렇게 착할 줄이야."},
      {
        "answer": "とは",
        "word": "痴漢されても物怖じしないとは, 恐ろしい人だ。",
        "mean": "치한을 당해도 겁내지 않다니 무서운 사람이다."
      },
      {
        "answer": "とは",
        "word": "そこに気がつくとは, 君才能あるね。",
        "mean": "그걸 깨닫다니, 자네 재능 있네."
      }
    ]
  }
];
